{
  "site": {
    "title": "Game Design Docs",
    "description": "คลังเอกสาร Game Design Document (GDD) สำหรับโปรเจกต์ของคุณ"
  },
  "posts": [
    {
      "id": "dungeon-dungry-structured",
      "title": "Dungeon Dungry — GDD (จัดหมวดอ่านง่าย)",
      "date": "2025-08-20",
      "tags": [
        "GDD",
        "Dungeon Dungry",
        "structured"
      ],
      "summary": "รวมทุกหน้า แล้วจัดกลุ่มเป็นหมวดชัดเจน (หัวข้อใหญ่เดียว/สารบัญเดียว อ่านลื่น)",
      "content_md": "# Dungeon Dungry — GDD (จัดหมวดอ่านง่าย)\n\n> รวมเนื้อหาจาก PDF แล้วจัดกลุ่มเป็นหมวด เพื่ออ่านง่าย · อัปเดต: 2025-08-20\n\n---\n\n## Overview (ภาพรวม)\n\nGame Design Document \"Dungeon Dungry \"\n\nจัดทำโดย\nนายธนพัฒน์ บุญขำ รหัสนักศึกษา: 6530611012\nนางสาวพิชญธิดา  สุวรรณธาดา   รหัสนักศึกษา: 6530611016\nนายอนิวรรต  บุญคงมาก   รหัสนักศึกษา: 6530611018\n\nอาจารย์ที่ปรึกษา\nดร.วรวิกา วัฒนสุนทร\n\nข้อเสนอโครงการฉบับนี้เปน็ ส่วนหนงึ่ ของวิชา 968 -391 Project in\nComputing มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตภูเก็ต\nภาคการศึกษาที่ 2/2567 - 1/2568\n\nDungeon Drugry ผจญภัยในโลกดันเจี้ยน\n\nภาพรวมเกม ( Game Overview )\nTitle game : Dungeon Drugry ผจญภัยในโลกดันเจี้ยน\nElevator pitch : Dungeon Dungry เปน็ เกมสำรวจดันเจี้ยนแบบ 3 D ที่ผู้เล่นจะได้รับบทเป็น \"ไลออน\"\n(Lion) นักทำอาหารที่ต้องเดินทางเข้าสู่ถ้ำ \" Elenia\" เพื่อตามหา \"เนื้ออาร์ดัส\" ทสี่ ามารถฟื้นฟูสมดุลของ\nธรรมชาติ เกมจะมีการค้นหาวัตถุดิบจากแผนที่และมอนสเตอร์ พร้อมระบบทำอาหารและการต่อสู้\n\nConcept\nOverview\n- Genre: Adventure / Explore\n- Target audience:\no Age: 15-30 o Gender: Male/Female\n- Monetization: Freemium\n- Platforms & system requirements:\no Windows PC\nไอเดียหลัก ( Game Concept )\nDungeon Dungry เป็นเกมสำรวจดันเจี้ยนแบบ 3 D ที่ผู้เล่นจะได้รับบทเป็น \"ไลออน\" (Lion) นกั\nทำอาหารที่ต้องเดินทางเข้าสู่ถ้ำ \" Elenia\" เพื่อตามหา \"เนื้ออาร์ดัส\" ที่สามารถฟื้นฟูสมดุลของธรรมชาติ เกมจะ\nมีการค้นหาวัตถุดิบจากแผนที่และมอนสเตอร์ พร้อมระบบทำอาหารและการต่อสู้\n\nUI ( User Interface )\nMain menu\nOverview\n\nMockup\n\nLoading screens\n\n*จากหน้า: 1, 2, 31, 32*\n\n---\n\n## Controls & Camera (การควบคุม & กล้อง)\n\n- วางแผนและจัดการการทดสอบสมดุลของเกม ( Game Balancing)\n- สร้างและดูแล GDD สำหรับทมี พัฒนา 9. ความเชื่อมโยงกับหน้าที่อื่น ( Interdependencies)\n- ต้องประสานงานกับ:\no Programmer: เพื่อพัฒนาและทดสอบระบบการเล่นที่ออกแบบ o Artist: เพื่อใหแ้\nน่ใจว่าโลกและตัวละครสอดคล้องกับการออกแบบ o Sound Designer: เพื่อทำใหป้\nระสบการณ์เสียงสอดคล้องกับธีม o QA Tester: เพื่อทดสอบการทำงานของระบบต่างๆ\nในเกม\n- Input/Output ที่ต้องแลกเปลี่ยน:\no Input: ความต้องการและข้อเสนอแนะจากทีมเพื่อพัฒนาแนวทางการออกแบบ o Output:\nสร้างเอกสารการออกแบบและการประสานงานกับทีมในการพฒั นาต่อไป Game\nDevelopment – Tanapat\n1. ชื่อ-นามสกลุ (Name)\nนายธนพัฒน์ บุญขำ 2.\nตำแหน่ง/บทบาท ( Role)\n- Programmer\n3. หน้าที่และความรับผิดชอบหลัก ( Responsibilities) สรุปงานที่รับผดิ ชอบโดยย่อ\nเช่น\n- เขียนเอกสารออกแบบระบบการต่อสู้\n- พัฒนาสคริปต์ AI\n- ทดสอบบั๊กและปรับบาลานซ์\n\n4. เครื่องมือ\n- Unity\n- C#\n5. ช่องทางติดต่อ ( Contact Info)\n- s6530611018@phuket.psu.ac.th\n- เบอร์โทรศัพท์\n6. เวลาที่พร้อมทำงาน ( Availability)\n- วัน-เวลาที่สะดวก (เช่น จันทร์ –ศุกร์ 09:00–17:00)\n- ประเมินปริมาณงานต่อสัปดาห์ (ชั่วโมง)\n7. ความรับผดิ ชอบต่อเป้าหมายหลัก ( Key Deliverables)\n- รายการชิ้นงานหรือมิลสโตนที่ต้องส่งมอบ\n- กำหนดเวลา (Deadline)\n8. ความเชื่อมโยงกับหน้าที่อื่น ( Interdependencies)\n- ใครต้องประสานงานด้วย\n- Input/Output ที่ต้องแลกเปลี่ยนระหว่างทีม\n\nGame Artist – Pichayathida\n1. ชื่อ-นามสกลุ (Name) ระบุชื่อเต็มของ Game Artist เช่น\n- นาย/นางสาว [ชื่อเต็ม]\n2. ตำแหน่ง/บทบาท ( Role) Game Artist  บทบาทหลัก:\nรับผิดชอบในการออกแบบและสร้างงานศิลปะสำหรับเกม เช่น ตัวละคร, ฉาก, วัตถุ, เอฟเฟกต์ ภาพ,\nและการออกแบบ UI/UX เพื่อให้โลกของเกมดูมีชีวิตชีวาและสอดคล้องกับธีมและสไตล์ที่กำหนด\n3. หน้าที่และความรับผิดชอบหลัก ( Responsibilities)\n- สร้างและออกแบบตัวละคร, ศัตรู, ฉาก, และวัตถุภายในเกม\n- ออกแบบและสร้าง UI (User Interface) เช่น เมนู, ปุ่ม, และองค์ประกอบอื่นๆ ที่ผู้เล่นสามารถ\nโต้ตอบ\n- ออกแบบและสร้างเอฟเฟกต์ภาพ ( Visual Effects) เช่น การระเบิด, แสง, หรือเอฟเฟกต์ของท่าทาง\nการต่อสู้\n- ร่วมมือกับทีม Game Designer และ Programmer เพื่อให้แน่ใจว่าศิลปะในเกมมีความเข้ากันได้ดี\nกับการเล่น\n- ทำงานกับทีมเพื่อสร้างสไตล์กราฟิกของเกม (เช่น 2 D, 3D, สไตล์การวาด, หรือกราฟิกแบบพิกเซล)\n- ร่วมมือกับทีมพัฒนาเพื่อประสานการปรับปรุงและการทดลองศิลปะตามคำติชมจากทีม\n- ดูแลความถูกตอ้ งของแอสเซ็ตต่างๆ เช่น โมเดล 3 D, เท็กซ์เจอร์, ภาพพื้นหลัง ฯลฯ\n4. ทักษะ/ความชำนาญ ( Skills & Expertise)\n- เครื่องมือการออกแบบกราฟิก:\no 2D Art Tools:  Adobe Photoshop , Illustrator, Clip Studio Paint , Krita\n\n- ผลงานที่เกี่ยวข้อง:\no มีส่วนร่วมในการออกแบบศิลปะในเกมที่สำเร็จ o\nประสบการณ์ในการทำงานร่วมกับทีมพัฒนาเกมในด้านศิลปะ\n8. ความรับผดิ ชอบต่อเป้าหมายหลัก ( Key Deliverables)\n- สร้างและออกแบบตัวละคร, สภาพแวดล้อม, เอฟเฟกต์ภาพ, และ UI สำหรับเกม\n- ดูแลและปรับปรุงแอสเซ็ตกราฟิกตามข้อเสนอแนะจากทีมพัฒนา\n- พัฒนาและปรับแต่งโมเดล 3 D และแอนิเมชันที่จำเป็น\n- ออกแบบและปรับแต่ง UI ตามประสบการณ์ผู้เล่นที่ต้องการ\n9. ความเชื่อมโยงกับหน้าที่อื่น ( Interdependencies)\n- ต้องประสานงานกับ:\no Game Designer:\nเพื่อให้แน่ใจว่าองค์ประกอบกราฟิกทั้งหมดมีความสอดคล้องกับกลไก\nและระบบของเกม\no Programmer:\nเพื่อให้การทำงานร่วมกันระหว่างกราฟิกและการเล่นของเกมเป็นไปได้อย่าง ราบรื่น\no Sound Designer:  เพื่อให้แน่ใจว่าเอฟเฟกต์เสียงและภาพทำงานร่วมกันได้ดี o QA\nTester: เพื่อทดสอบกราฟิกในบริบทต่างๆ ของเกม\n- Input/Output ที่ต้องแลกเปลยี่ น:\no Input: คำแนะนำจากทีมพัฒนาและการทดสอบของผู้เล่น o Output:\nแอสเซ็ตกราฟิกที่เสร็จสมบูรณ์และพร้อมใช้งานในเกม\n\n2. สำรวจถ้ำเอเลเนีย (4 ชนั้ )  ตอ่\nสู้กับมอนสเตอร์กลายพันธุ์และมินิบอสเก็บวัตถุดิบระดับสูงในแต่ละชั้น\n3. พัฒนาไลออน & อาวุธ  ปลดล็อกชั้นดันเจี้ยน, และอาวุธขั้นสูง\n4. ปลดล็อกเนื้อเรื่อง & ดันเจี้ยนใหม่  ความลับของอัซมารอสและอดีตของโลกจะค่อย ๆ เปิดเผย\n5. ศึกสุดท้ายกับ “อาร์ดัส”  เอาชนะบิ๊กบอสเพื่อได้วัตถุดิบศักดิ์สิทธิ์ นำไปปรุงเมนูที่ช่วยชำระพลังมืด\nและฟื้นฟูอิกนาร์ทิส\nObjectives\n1. สำรวจ โลกหลังหายนะและดันเจี้ยนลึกลับ\n2. ต่อสู้ กับมอนสเตอร์กลายพันธุ์และบอสสุดโหด\n3. ปรุงอาหาร ดว้ ยวัตถุดิบวิเศษเพื่อเพิ่มพลังและฟื้นฟูธรรมชาติ\n4. รวบรวมวัตถุดิบ  หายากเพื่ออัปเกรดอาวุธครัวเวท\n5. ดำเนนิ เนื้อเรื่อง  เพื่อค้นหาความลับของ “อาหารแห่งพระเจ้า”\n6. กอบกู้โลก โดยสร้างเมนูศักดิ์สิทธิ์จาก “เนอื้ อาร์ดัส”\n\n\nMechanics\nPhysics  วัตถุในโลกมีแรงดึงดูดและการชนกัน เช่น\nมอนสเตอร์ที่โจมตีผู้เล่น\nMovement\nCharacter Movement:  การเคลื่อนที่ในทิศทางต่างๆ ด้วยการใช้ปุ่ม W, A, S, D ผู้เล่นสามารถวิ่ง,\nกระโดด, และหลบหลีกจากการโจมตี\n\nLevels\nLevel 1: Floor 1 Silverleaf Village\nSynopsis ไลออนตื่นขึ้นในหมู่บ้านซิลเวอร์ลีฟในยามรงุ่ อรุณ\nแอลเดอร์อธิบายถึงการเสื่อมสภาพของโลกและมอบหมาย ภารกิจแรกให้เขา:\nไปหามีดเนื้ออาร์ดัสจากถ้ำเอเลเนีย ในระดับนี้จะเป็นการแนะนำการควบคุมเกม การเล่า เรื่อง\nและการตั้งเป้าหมายของเกม Objectives\n1. พบกับแอลเดอร์ที่เตาผิงกลางหมู่บ้าน\n2. เรียนรู้การเคลอื่ นไหวพื้นฐาน: เดิน, วิ่ง, กระโดด, และหลบหลีก\n3. ทำภารกิจสอนทำอาหารของแอลเดอร์ (เตรยี มสตูว์บำรุงร่างกายง่ายๆ)\n4. ออกจากหมู่บ้านและเข้าสู่ประตูถ้ำ Locations\n1. หมู่บ้านซิลเวอร์ลีฟ  o กระท่อมของแอลเดอร์,\nสถานีทำอาหาร, พ่อค้า NPC\n2. ขอบหมู่บ้าน o พื้นที่ฝึกทักษะที่มีหุ่นไม้และมอนสเตอร์\n\"None\" ระดับต่ำ\n3. ประตูถ้ำเอเลเนีย  o ประตูที่มีคบเพลิงและทางเข้าถ้ำ\n\nการฝึกฝน – เตาผิงหมู่บ้าน\n- แอลเดอร์อธิบายการควบคุมเกม\n- \"เดินไปที่เตาผิง\" → ฝึกการเดินและวิ่ง\n- \"หลบการระเบดิ ของเปลวไฟ\" → ฝึกการหมุนหลบ การฝึกทำอาหาร –\nห้องครัวหมู่บ้าน\n- เก็บวัตถุดิบจากถัง\n- ทำตามคำแนะนำบนหน้าจอเพื่อทำอาหารง่ายๆ\n- ทานอาหารเพื่อฟื้นฟูพลังชีวิต (สอนการใชอ้ ินเวนทอรี่และไอเท็ม) การฝึกการต่อสู้ –\nพื้นทฝี่ ึกขอบหมู่บ้าน\n- ต่อสู้กับมอนสเตอร์ \" None\" 2 ตัว\n- ฝึกการโจมตีเบา/หนักและการป้องกัน\n- รางวัล: 50 XP, การอัปเกรดเคลฟเวอร์พื้นฐานที่ร้านของแจ็ค การส่งตัวของแอลเดอร์ –\nประตูหมู่บ้าน\n- กลับไปพบแอลเดอร์: เขามอบคบไฟและเครื่องหมายภารกิจ\n- แอลเดอร์เตือนเกี่ยวกับมอนสเตอร์หินที่อยู่ข้างหน้า เข้าสู่ประตูถ้ำ\n- เข้าไปที่ทางเข้าที่ส่องแสง\n- การโหลดหน้าจอระดับถัดไปและแสดงแผนที่สำหรับระดับที่ 2\n\n3.\n- ใส่ Tip หรือ Fun Fact ที่เปลี่ยนไปเรื่อยๆ\n\nStart Page\n\n\nGame Art :\n- ทำ Background , Logo , Button และ Sound effect / BG\n- การจัดวาง Layout ต่างๆ\n- เล่น Background Music หรือ Sound Effect เบาๆ Game Dev :\n- ลิ้งค์ปุ่มต่าง คือ ปุ่ม Start ไปยัง Main PLay / ปุ่ม Setting หน้าการตั้งค่า / หรือปุ่ม\nExit เพื่อออกไปยัง หน้า Icon Page\n\n4.\n- hold button เมื่อชี้ปุ่ม\n\nMain Play\n\n\nGame Art :\n- ลักษณะหลอดเลือด / พลังงาน\n- layout หน้า Main Play\n- Assets ต่างๆภายในพื้นที่\n- Icon อาวุธ อาหาร ยา และ ฟันเฟือง Game Dev :\n- กดปุ่มเพื่อไปยังหน้าอื่น เช่น กด I เพื่อเข้าหน้า Inventory หรือ การกด left click\nเพื่อโจมตี\n- การตั้งค่าการโจมต\n- ท่าทางต่างๆของตัวละคร\n\n5.\nGame Art\n\nGame Art :\n- Icon สำหรับ เมนูใน Inventory\n- การจัดวาง Layout ใน Inventory\n- ตัวละคร Game Dev :\n- การลิ้งค์ Icon ข้อมูล ค่าสถานะ ของวัตถุดิบ\n- กด icon paper เพื่อไปหน้า book page\n- การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน\n\n6.\nBook Page\n\n\nGame Art :\n- ทำข้อมูลในกระดาษ\n- ลักษณธของกระดาษ\n- Layout ของหน้ากระดาษ  Game Dev :\n- การกด Book 1 เพื่ออ่านข้อมูลในกระดาษ\n- กด icon person เพื่อไปหน้า Stat\n- การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน\n\n7.\n\nStat Page\n\nGame Art :\n- ทำหลอดสถานะต่างๆ\n- การจัดวางของส่วนต่างๆ Game Dev :\n- การลิ้งค์ Icon ข้อมูล ค่าสถานะ ของตัวละคร\n- กด icon food เพื่อไปหน้า craft page\n- การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน\n\n\nCraft Page\n\n8.\n\n\nGame Art :\n- ทำ Icon สำหรับ เมนูใน craft page\n- การจัดวาง Layout ใน Craft page\n- ตัวละคร Game Dev :\n- กด craft เพื่อไปยัง Cutscene ของอาหารแต่ละเมนู\n- การผสมวัตถุดิบ\n- การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน\n\n9.\nSetting Page\n\n\nGame Art :\n- ทำ Icon สำหรับ setting เช่น valume music และ Exit\n- การจัดวาง Layout ใน Setting Page Game Dev :\n- ปรับการตั้งค่า ลด - เพิ่มเสียง เกมและเพลง\n- ลิ้งค์ปุ่ม Exit ( on click ) ให้ออกไปยังหน้า Start\n- การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC หรือปุ่ม BACK\nเพื่อออกจากหน้าปัจจุบัน\n\n10.\n\nTrading Page\n\nGame Art :\n- ทำ Icon สำหรับ Trading วตั ถดุ บิ แร่\n- การจัดวาง Layout ใน Trading page Game Dev :\n- วางวัถุดิบให้ตรงกับความต้องการของพ่อค้าเพื่อจะแลกเปลี่ยน\n- การเพิ่ม – ลดวัตถุดิบที่แลกเปลี่ยนแล้ว\n- การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC หรือปุ่ม BACK\nเพื่อออกจากหน้าปัจจุบัน\n\n11.\n\nCutscene\n\nGame Art :\n- ออกแบบ Motion Graphic ให้เล่าเนื้อเรื่อง Game Dev :\n- การลิ้งค์กับส่วนต่างๆที่ต้องมี Cutscene\n- การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม Space Bar เพื่อข้าม\n\n\nTeleport Page\n\n12.\n\nGame Art :\n- การจัดวาง Layout ใน Teleport Game Dev :\n- on click เพื่อไปยังจุดเทเลพอร์ต\n- เชื่อมต่อหน้าเทเลพอร์ตกับจุดเทเลพอร์ต\n- การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน\n\n\nRead Paper Page\n\n13.\n\nGame Art :\n- การจัดวาง Layout ข้อความ ชื่อเรื่อง Game Dev :\n- นำกระดาษเข้ามาในกระเป๋าหลังจากเจอแผ่นกระดาษแล้ว\n- เชื่อมต่อกับหน้า Inventory\n- การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน\n\nWin/Lost page\n\n)\nกลไกการเล่นเกม ( Gameplay Mechanics\nPlayer Controls & Actions\n- Idle, Walk, Run, Hit, Dash, Dead\n- สำรวจพื้นที่ ค้นหาทางลับ และไขปริศนา\n- ต่อสู้กับมอนสเตอร์เพื่อเก็บวัตถุดิบ\n- ทำอาหารจากวัตถุดิบที่หาได้\n- อัปเกรดอาวุธและเกราะ\n- แลกเปลี่ยนไอเทมกับ NPC\n     Combat System\n- ระบบต่อสู้แบบ Hack & Slash\n- ศัตรูมีพฤติกรรม AI แบบ Chase Player\n- Mini Boss (หิน/ไฟ) มีการโจมตี Melee\n     Crafting & Cooking\n- เก็บวัตถุดิบจากธรรมชาติและมอนสเตอร์\n- ใช้ระบบทำอาหารเพื่อเพิ่ม Buff ให้ตัวละคร\n- ระบบอัปเกรดอาวุธและเกราะ\nกระบวนการออกแบบ ( Level Design )\nDungeon Structure\n- ดันเจี้ยนแบ่งเป็น 4 ชั้น\n- แต่ละชั้นมีมอนสเตอร์และวัตถุดิบที่แตกต่างกัน\n\n*จากหน้า: 7, 8, 9, 11, 29, 33, 34, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 55*\n\n---\n\n## Mechanics (ระบบการเล่น)\n\nProject scope\nOur team Game Designer – Aniwat\n1. ชื่อ-นามสกลุ (Name)\n- นายอนิวรรต บุญคงมาก\n2. ตำแหน่ง/บทบาท ( Role) Game Designer บทบาทหลัก: รับผิดชอบการออกแบบระบบการเล่น,\nกฎของเกม, การวางแผนเนื้อหา, และการทำให้ ประสบการณ์ของผู้เล่นเป็นไปตามที่ตั้งใจไว้\n3. หน้าที่และความรับผิดชอบหลัก ( Responsibilities)\n- ออกแบบกลไกการเล่น ( Gameplay Mechanics) เช่น ระบบต่อสู้, การสำรวจ, การจัดการทรัพยากร\nฯลฯ\n- สร้างระบบความก้าวหน้าในเกม ( Progression Systems) เช่น เลเวล, ความสำเร็จ, ความสามารถที่\nปลดล็อก\n- ออกแบบประสบการณ์ผู้เล่น ( Player Experience) ทั้งในด้านความสนุกและการสร้างอารมณ์ในการ\nเล่น\n- วางแผนการพัฒนาเนื้อหาหรือเนื้อเรื่องของเกม\n- สร้างระบบและสภาพแวดล้อมที่เกี่ยวข้องกับธีมและสไตลข์ องเกม\n- การทำเอกสาร GDD ที่เกี่ยวขอ้ งกับกลไก, ประสบการณ์ผู้เล่น, และการออกแบบโลกในเกม\n- สื่อสารและทำงานร่วมกับทีมเพื่อให้มั่นใจว่าการออกแบบเกมเป็นไปตามแนวทางที่ตั้งใจไว้\n4. ทักษะ/ความชำนาญ ( Skills & Expertise)\n- เครื่องมือการออกแบบเกม: Unity, GDD Writing Tools / Nuclino\n- ความรู้ในระบบการออกแบบเกม: เช่น ระบบการต่อสู้, การพัฒนา AI, ระบบการจัดการทรัพยากร\n\n- ความเชี่ยวชาญในด้านการสร้างกลไกและระบบในเกม ( Gameplay Systems Design)\n- การวิเคราะห์และปรับปรุงสมดุลในเกม ( Game Balancing)\n- ทักษะในการเขียนเอกสารและสื่อสารไอเดีย ( GDD, Pitch Documents)\n- ความรู้พื้นฐานในการออกแบบ UI/UX\n- ประสบการณ์ในการทำงานร่วมกับทีมพัฒนา ( Cross-functional teams)\n5. ช่องทางติดต่อ ( Contact Info)\n- อีเมล: s6530611018@phuket.psu.ac.th\n- เบอร์โทรศัพท์: 0826940174\n6. เวลาที่พร้อมทำงาน ( Availability)\n- วัน-เวลาที่สะดวก จันทร์ –ศุกร์ 09:00–17:00\n- ประเมินชั่วโมงการทำงานต่อสัปดาห์ 20 -30 ชั่วโมง/สัปดาห์\n7. ประสบการณ์ที่ผ่านมา ( Relevant Experience)\n- โปรเจกต์ที่ผ่านมาที่เกี่ยวข้อง:\no โปรเจกต์ : -\n- ผลงานที่เกี่ยวข้อง:\no มีส่วนร่วมในการออกแบบกลไกหรือระบบในเกมที่สำเร็จ\no ประสบการณ์ในการทำงานร่วมกับทีมพัฒนาเกมในส่วนต่างๆ เช่น Art, Programming,\nSound, etc.\n8. ความรับผิดชอบต่อเป้าหมายหลัก ( Key Deliverables)\n- สร้างเอกสารการออกแบบระบบการเล่นทั้งหมด ( Game Systems Design Docs)\n- ออกแบบและพัฒนา Gameplay Mechanics สำหรับดันเจี้ยนและการต่อสู้\n\n2. Walk (เดิน):\no เดินช้า ๆ มุ่งหน้าเข้าหาผู้เล่นเมื่ออยู่ในระยะตรวจจับ\n3. Hit (โจมตี):\no ใช้ท่าต่อยหรือกัดแบบรวดเร็วเมื่อเข้าใกล้ผู้เล่น o\nมีเสียงคำรามตอนโจมตีเพื่อเพิ่มแรงกดดัน\n4. Dead (ตาย):\no ทรุดตัวลงอย่างรุนแรง สลายร่างด้วยเงามืด o\nอาจปล่อยของดรอป (เช่น สมุนไพรเน่า,\nชิ้นส่วนเวทตกค้าง)\nรูปแบบการเคลื่อนที่: Chase Player\n- AI เคลื่อนที่โดยมีพฤติกรรมดงั นี้: o ตรวจจับผู้เลน่ :\nเมื่อผู้เล่นเข้าใกล้ในระยะตรวจจับ o วิ่งไล่:\nเดินตรงเข้าหาผู้เล่น o เข้าโจมตี:\nหากอยู่ในระยะประชิด จะเปลี่ยนเป็นโหมด Hit o\nหยุดไล่: หากผู้เล่นวิ่งหนีเกินระยะจะยืน Idle ต่อ\nMechanic ของมอนสเตอร์\n- ประเภทการโจมตี:  Melee Attack o โจมตีด้วยการ ตอ่\nย หรอื กัด o มีคูลดาวน์เล็กน้อยระหว่างการโจมตี\n\no เดินช้า ๆ มุ่งหน้าเข้าหาผู้เล่นเมื่ออยู่ในระยะตรวจจับ o\nเคลื่อนไหวแบบเซ ๆ บ่งบอกถึงสภาพร่างกายที่ไม่สมบูรณ์\n3. Hit (โจมตี):\no ใช้ท่าต่อยหรือกัดแบบรวดเร็วเมื่อเข้าใกล้ผู้เล่น o\nมีเสียงคำรามตอนโจมตีเพื่อเพิ่มแรงกดดัน\n4. Dead (ตาย):\no ทรุดตัวลงอย่างรุนแรง สลายร่างด้วยเงามืด o\nอาจปล่อยของดรอป (เช่น สมุนไพรเน่า,\nชิ้นส่วนเวทตกค้าง)\nรูปแบบการเคลื่อนที่: Chase Player\n- AI เคลื่อนที่โดยมีพฤติกรรมดงั นี้: o ตรวจจับผู้เลน่ :  เมื่อผู้เล่นเข้าใกล้ในระยะตรวจจับ o\nวิ่งไล่: เดินตรงเข้าหาผู้เล่น o เข้าโจมตี: หากอยู่ในระยะประชิด จะเปลี่ยนเป็นโหมด Hit o หยุดไล่:\nหากผู้เล่นวิ่งหนีเกินระยะจะยืน Idle ต่อ\nMechanic ของมอนสเตอร์\n- ประเภทการโจมตี:  Melee Attack o โจมตีด้วยการ ตอ่ ย หรอื กัด o\nมีคูลดาวน์เล็กน้อยระหว่างการโจมตี Meteor มิเทอร์\n“หินฟ้าที่ตกลงมาเพื่อนำทาง…หรือทำลาย?”\n- ประเภท: มินิบอส / ธาตุหิน\n- ชั้นที่พบ: ชั้นที่ 2 – Stone Golem\n- บทบาท: ผู้พิทกั ษ์ประตูทางลงสู่ชั้นที่ 3 ลักษณะภายนอก:\n\n- ร่างกายใหญ่โตมหึมา รูปร่างคล้ายยักษ์หิน\n- พื้นผิวเป็นหินดำผสมแร่เรืองแสงสีแดงคล้ายอุกกาบาต\n- ดวงตาเดียวตรงกลางหัวเปล่งแสงสีส้มราวกับลาวาที่กำลังเดือด ความสามารถพิเศษ:\n- Meteor Slam: กระโดดทบุ พื้นจนเกิดแรงสั่นสะเทือน\n- มีการโจมตีที่รนุ แรง\n- มีการป้องกันที่สูง กลยุทธ์การต่อสู้:\n- การโจมตีและการเคลื่อนไหวช้า บทบาทเชิงเนื้อเรื่อง:\n- Meteor ถูกสร้างขึ้นโดยพลังเวทของอัซมารอสจากอุกกาบาตจริงที่ตกสู่ดินแดนอิกนาร์ทิส\n- มันไม่ใช่เพียงเครื่องป้องกันดันเจี้ยน แต่เป็นตัวแทนของ\n“การทดสอบความแข็งแกร่งของจิตใจ”\n- ไลออนต้องใช้มากกว่ากำลัง — ต้องอาศัยความอดทนในการเอาชนะมัน Attack Mechanic\n- Melee Attack – โจมตีระยะประชิดด้วยหมัดหนัก\n- AoE Attack – กระแทกพื้น ทำให้เกิดแรงสนั่ สะเทือนเป็นวงกว้าง 5 Action\n- Idle – ยืนนิ่งพร้อมขยับเล็กน้อย\n- Walk – เดินเข้าหาผู้เล่น\n- Run – วิ่งเมื่อเข้าใกล้\n- Hit – ใช้การโจมตี Melee หรือ AoE\n- Dead – ล้มลงและระเบิดพลังเวทสุดท้าย\nMovement Type: Chase Player\n- ตรวจจับผู้เล่นในระยะ → เดิน/วิ่งเข้าใกล้\n- เมื่ออยู่ในระยะประชิด → สุ่มใช้ Melee หรือ AoE\n- หากผู้เล่นถอยออกนอกระยะ → บอสหยุดไล่\n\n\n\nBlazer เบลสเซอร์\n\nRdus (อาร์ดสั )\n\nGameplay & mechanics\nGameplay\nCore gameplay loop\n\n\n\n\n\nGame progression\n1. เริ่มต้นในหมู่บา้ นซิลเวอร์ลีฟ  เรียนรู้พื้นฐานการต่อสู้ ทำอาหาร และระบบอัปเกรด\n\nDodge Roll: สามารถใช้การหมุนหลบการโจมตีหรือหลีกเลี่ยงอันตรายจากมอนสเตอร์\nObjects\nCollecting & Inventory Management:\nเก็บวัตถุดิบจากมอนสเตอร์หรือธรรมชาติไว้ในช่องเก็บของ\nผู้เล่นสามารถจัดระเบียบหรือเลือกใช้สิ่งของในสต็อก Crafting\n& Upgrading:\nอัปเกรดอาวุธครัวและอุปกรณ์ต่างๆ โดยใช้วัตถุดิบที่เก็บได้จากการสำรวจ\nActions\nCombo Attacks:\nการโจมตีแบบคอมโบเพื่อเพิ่มความเสียหาย\ninteracting with objects\nCooking : ใชว้ ัตถุดิบที่เก็บได้มาทำอาหาร\nTalking\nDialogue System:  เลือกบทสนทนาเพื่อเพิ่มความสัมพันธ์กับ NPC และปลดล็อกเควสใหม่\nReading\nBooks : การอ่านจะช่วยให้ผู้เล่นเข้าใจเนอื้ เรื่องและพัฒนาตัวละคร\n\n- เดินตามทางเดินที่มีคบเพลิง: เก็บสมุนไพร 10 ชิ้น (การโต้ตอบ “เก็บ”)\n- เจอมอนสเตอร์ \"นัน\" หิน 5 ตัว ฝึกการต่อสู้และท่าโจมตพี ื้นฐาน\n- เจอมอนสเตอร์ \"สตาร\"์ หิน 5 ตัว ฝึกการตอ่ สู้และท่าโจมตีพื้นฐาน\nแท่นหลอมในหมู่บ้าน\n- ผู้เล่นสามารถกลับไปยังหมู่บ้านได้เมื่อเก็บของอัปเกรดได้แล้ว\nการเผชิญหน้ากับมิเทอร์ในอารีน่า\n- ก้าวเข้าไปในพื้นที่; มิเทอร์ปรากฏตัวพร้อมกับการสั่นสะเทอื น\n(ฝึกการหลบหลีกและการใช้คอมโบ)\n- หลีกเลี่ยงการโจมตีจากมิเทอร์\n- ชนะแล้วเปิดประตูหินขนาดใหญ่ไปยังระดับถัดไป\n\n\nLevel 3: Floor 3 Blaze Zone\nSynopsis หลังจากเอาชนะมินิบอสหิน มิเทอร์ ไลออนเดินทางเข้าสู่ “ Blaze Zone”\nพื้นทที่ ี่เต็มไปด้วยลาวา และพลัง แห่งธาตุไฟ เขาต้องเผชิญหน้ากับมินิบอส “เบลสเซอร์”\nผู้ควบคุมเปลวเพลิงอันเกรี้ยวกราด พร้อมตามหา “พริกศักดิ์สิทธิ์” ส่วนผสมลบั ของเมนูศักดิ์สิทธิ์\nและฝึกควบคุมพ ลังความร้อนระหว่างต่อสู้ Objectives\n1. เก็บสมุนไพร 10 ชิ้น\n2. เอาชนะมอนสเตอร์ \" None\" ไฟ 5 ตัว\n3. อัปเกรดอาวุธที่ร้านของแจ็คโดยใช้แร่\n4. ทำอาหารเพื่อใช้ฟื้นฟูเลือด\n\nLevel walkthrough\n5. เอาชนะมอนสเตอร์ \"ไลท์\" หนิ 5 ตัว\n6. ค้นหามินิบอส \"เบลสเซอร์\" และเอาชนะเพื่อเปิดประตูไปยังชั้นสุดท้าย Locations\n1. อารีน่าของเบลสเซอร์  o มินิบอส \"เบลสเซอร์\"\nโผล่ออกมาจากลาวา\n2. เขาวงกต\no เส้นทางแคบ มีลาวาไหลและพุ่มไม้พริกศักดิ์สิทธิ์\n3. แท่นหลอมในหมู่บ้าน  o ร้านตีเหล็กของแจ็คในที่ชั้น 1\n4. บริเวณชั้นนอกพื้นที่บอส  o มอนสเตอร์ 10\nตัวคอยขัดขวางผู้เล่นและปอ้ งกันมินิบอส \"เบลสเซอร์\" เขาวงกต\n- เขาวงกตที่ทำให้ผู้เล่นได้สับสนงงงวยเพื่อเพิ่มความผจญภยั\nและสามารถฟาร์มเก็บของแรร์ได้ บริเวณชั้นนอกพื้นที่บอส\n- เดินตามทางเดินที่มีคบเพลิง: เก็บสมุนไพร 10 ชิ้น (การโต้ตอบ “เก็บ”)\n- เจอมอนสเตอร์ \"นัน\" ไฟ 5 ตัว ฝึกการต่อสู้และท่าโจมตพี ื้นฐาน\n- เจอมอนสเตอร์ \"ไลท์\" ไฟ 5 ตัว ฝึกการต่อสู้และท่าโจมตพี ื้นฐาน แท่นหลอมในหมู่บ้าน\n- ผู้เล่นสามารถกลับไปยังหมู่บ้านได้เมื่อเก็บของอัปเกรดได้แล้ว การเผชิญหนา้\nกับมิเทอร์ในอารีน่า\n- ก้าวเข้าไปในพื้นที่; เบลสเซอร์ปรากฏตัว (ฝึกการหลบหลกี และการใช้คอมโบ)\n- หลีกเลี่ยงการโจมตีจากเบลสเซอร์\n- ชนะแล้วเปิดประตูหินขนาดใหญ่ไปยังระดับสุดท้าย\n\n- ผู้เล่นสามารถกลับไปยังหมู่บ้านได้เมื่อเก็บของอัปเกรดได้\nแล้ว การเผชิญหนา้ กับมิเทอร์ในอารีน่า\n- ก้าวเข้าไปในพื้นที่; อาร์ดัส ปรากฏตัว\n(ฝึกการหลบหลีกและการใช้คอมโบ)\n- หลีกเลี่ยงการโจมตีจาก อาร์ดัส\n- ชนะแล้วเปิดประตูหิเพื่อกลับไปยังหมู่บ้านและทำอาหาร\nศักดิ์สิทธิ์\n\nขอบเขตระยะเวลาการทำงานโปรเจกต์ ( Milestone & Development Timeline )\nSemester 2/67\n- Game Design 100%\n- Art 40%\n- Development (Core Mechanics 40%) Semester 3/67\n- Art 60%\n- Core Mechanics 60% Semester 1/68\n- Full Game Development 100%\n- Playtest (30 Testers)\n- Documentation\n\n*จากหน้า: 5, 6, 21, 23, 24, 25, 26, 27, 28, 30, 36, 37, 39, 59*\n\n---\n\n## Systems (ระบบ)\n\no 3D Art Tools:  Blender, Maya, 3ds Max, ZBrush o\nAnimation Tools:  Spine, Unity Animator , After Effects  o\nUI Design Tools:  Figma, Sketch, Adobe XD\n- ทักษะการสร้างคอนเซ็ปต์อาร์ต ( Concept Art)\n- การออกแบบและสรา้ งตัวละคร ( Character Design)\n- การสร้างสภาพแวดล้อม ( Environment Design)\n- การสร้างและแก้ไขโมเดล 3 D และเท็กซ์เจอร์ (3 D Modeling & Texturing)\n- การออกแบบและสรา้ งแอนเิ มชัน ( Animation)\n- การออกแบบ UI/UX และการทำงานกบั ระบบอินเตอร์เฟซ\n- การสร้างเอฟเฟกต์ภาพ ( VFX)\n5. ช่องทางติดต่อ ( Contact Info)\n- อีเมล: [อีเมล]\n- เบอร์โทรศัพท:์  [เบอร์โทรศัพท์]\n- Slack/Discord ID:  [ID]\n6. เวลาที่พร้อมทำงาน ( Availability)\n- วัน-เวลาที่สะดวก (เช่น จันทร์ –ศุกร์ 09:00–17:00)\n- ประเมินชั่วโมงการทำงานต่อสัปดาห์ (เช่น 20 -30 ชั่วโมง/สัปดาห์)\n7. ประสบการณ์ที่ผา่ นมา ( Relevant Experience)\n- โปรเจกต์ทผี่ ่านมาที่เกี่ยวข้อง:\no โปรเจกต์ A: [คำอธิบายสั้นๆ เกี่ยวกับบทบาทในโปรเจกต์] o\nโปรเจกต์ B: [คำอธิบายสั้นๆ เกี่ยวกับบทบาทในโปรเจกต์]\n\n)\n- Cooking Ingredients: สมุนไพร, เนื้อ, แร่\n- Key Items: แผ่นบันทึก เงื่อนไขการชนะ ( Game\nProgression & Win Condition )\n- ผู้เล่นต้องผ่าน 4 ชั้นของดันเจี้ยน\n- เอาชนะ Mini Boss และ Big Boss\n- ค้นหาวัตถุดิบเพื่อทำอาหารศักดิ์สิทธิ์\n- ชนะเกมเมื่อสร้างอาหารสำเร็จและฟื้นฟูสมดุลขอ\nงโลก\n\n\nการออกแบบหน้าตาเกม ( UI & UX Design\n- โครงสร้างเมนูหลัก\n- HUD (Heads-up Display) เช่น แถบพลังชีวิต,\nMini-map\n- ระบบแจ้งเตือน (เช่น Low HP Warning, Buff\nStatus) งานภาพและงานเสียง ( Art & Sound )\n- Art Style: Stylized 3D and Stylized\nFantasy\n- Environment Reference : Genshin Impact\n- UI Design Reference : Dark Souls 3\n\n*จากหน้า: 10, 57*\n\n---\n\n## World & Story (โลก & เนื้อเรื่อง)\n\nเรื่องราวและสถานที่ เรื่องราวของเกม ( Game Story )\nเมื่อหลายร้อยปีก่อน ดินแดน “อิกนาร์ทิส” เคยเป็นศูนย์กลางของพลังแห่งธรรมชาติและ\nเป็นแหล่งวัตถุดิบล้ำค่าที่สุดในโลกเอเลเนีย แต่การปรากฏตัวของ \"จอมเวทต้องสาป อัซมารอส\"  ได้\nนำมาซึ่งหายนะครั้งใญ่ เขาทดลองเวทมนตร์ต้องห้ามเพื่อสร้าง \"อาหารแห่งพระเจ้า\" ที่สามารถให้พลัง\nเหนือขีดจำกัดแก่มนุษย์ แต่กลับนำมาซึ่งคำสาปที่แทรกซมึ เข้าไปในธรรมชาติ พลังลึกลับได้\nแพร่กระจายจากส่วนลึกของอิกนาร์ทิส ทำให้สิ่งมีชีวิตทุกชนิดเริ่มกลายพันธุ์ พื ชพันธุ์เน่าเปื่อย และ\nดินแดนทั้งหมดถูกปกคลุมดว้ ยพลังมืด   แม้ว่าจอมเวทอัซมารอสจะถกู ผนึกไ ปแล้ว\nแต่พลังของเขายังคงส่งผลกระทบต่อโลก และไม่มี ใครสามารถหยุดยั้งมันได้ จนกระทั่ง Elder ผู้เฒา่\nแห่งหมู่บ้านซิลเวอรล์ ีฟ  พบว่ามีเพยี งอาหาร ศักดิ์สิทธิ์บางอย่างเท่านั้นที่สามารถฟื้นฟูสมดุลได้\nและวัตถุดิบที่ขาดไม่ได้คือ “เนื้ออาร์ดัส” ซึ่งเป็น หัวใจสำคัญของเมนูนี้   ไลออน เป็นเดก็\nหนุ่มที่เกิดและเติบโตในหมู่บ้านซิลเวอร์ลฟี แม้ว่าเขาจะมีพรสวรรค์ในการ ทำอาหารมาตั้งแต่เด็ก\nแต่สิ่งที่ทำให้เขาแตกต่างจากเชฟทั่วไปคือ \"สัมผัสแห่งวัตถุดบิ \"  พลังพิเศษที่\nช่วยให้เขารับรู้คุณสมบัติของวัตถุดิบและดึงรสชาติที่แท้จริงของมั นออกมา\nElder จึงมอบหมายให้ไลออนทำภารกิจตามหา \"เนื้ออารด์ ัส\" จากส่วนลึกของ ถ้ำเอเลเนีย ถ้ำแห่งนี้\nเป็นหนึ่งในสถานที่ที่ได้รับผลกระทบจากพลังของอิกนาร์ทิส ทำให้มอนสเตอร์ภายในกลายพันธุ์และดุ ร้ายขึ้น\nเส้นทางสู่เนื้ออาร์ดัส: ดันเจี้ยนอันตรายและมินิบอสสุดโหด ถ้ำเอเลเนีย ไม่ใช่สถานที่ธรรมดา\nแต่เป็นดันเจี้ยนที่ถูกสร้างขึ้นจากพลังแห่งสมดุล และถูกแบ่ง ออกเป็น 4 ชั้นหลัก แต่ละชนั้ มี มินิบอส ทเี่\nฝ้าประตูไว้ และไลออนต้องเอาชนะพวกมันให้ได้เพื่อ ปลดล็อกชั้นต่อไป\n\nTheme and setting\nDungeon Dungry เป็นเกมแนวแอ็คชัน RPG แบบผจญภัย ตั้งอยู่ในโลกแฟนตาซีมืดหลังวัน\nโลกาวินาศ ซึ่งธรรมชาติถูกคำสาปกระทำลาย ผู้เล่นสวมบท ไลออน เชฟหนุ่มผู้มีพลังพิเศษ ออกสำรวจ\nดันเจี้ยนใต้ดินขนาดใหญ่ แบง่ เป็นหลายชั้นธีมธาตุแตกต่างกัน พร้อมกับต่อสู้กับมอนสเตอร์กลายพันธุ์\nรวบรวม วัตถุดิบล้ำค่า และปรุง “เมนูศักดิ์สิทธิ์” เพอื่ คืนสมดุลให้โลก สภาพแวดล้อมหลักคือ ถ้ำเอเลเนีย\nชั้นต่างๆ ได้แก่\n- Silverleaf Village : หมูบ้านซิลเวอรล์  ีฟ\n- Stone Golem: ห้องผลึกธาตุหิ น\n- Blaze Zone: เขตลาวาและเพลิงร้อนแรง\n- Heart of the Alenia: ศูนย์กลางพลังมืดและที่อยู่ของบอส Rdus\nเกมผสมผสานบรรยากาศโบราณร้างกับความหวังในการเยียวยาผ่านพลังของอาหาร\nให้ผู้เล่นได้สัมผัสทั้งความ ท้าทายและช่วงเวลาที่งดงามของโลกแฟนตาซีที่รอวันคืนชีพ\nLearn more about the Locations, Story, and Characters of the game.\n\nGame Setting\nstory\nLocations Floor\n1 Silverleaf Village\nหมู่บ้านเล็กๆ ที่ยังคงเหลือซงึ่ แสงแห่งความหวังในโลกที่ล่มสลาย ผู้คนที่นี่อาศัยอยู่ด้วยความพยายาม\nและศรัทธาในการเยียวยาโลกอีกครั้ง ภายในหมู่บ้านมีร้านค้าสำหรับแลกเปลี่ยนวัตถุดิบ อัปเกรดอาวุธ และ\nศูนย์กลางข้อมูลการเดินทาง ผู้เฒ่าอารอน ซิลเวอร์ลีฟ ไดค้ ้นพบความลับของ “เมนูศักดิ์สิทธิ์”\nที่จะช่วยชำระพลังมืดจากโลก และ วัตถุดิบหลักคือ “เนื้ออาร์ดัส” ซึ่งอยู่ ลึกสุดในถ้ำเอเลเนีย\nที่นี่เป็นจุดเริ่มต้นของไลออน เด็กหนุ่มผู้มีพรสวรรค์ในการทำอาหาร และกำลังจะเริ่มต้นภารกิจเปลี่ยนโลกด้วย\nพลังของ \"รสชาติ\"\nLevel 1: Floor 1 Silverleaf Village  ตัวเอก ไลออน\nเป็นเด็กที่เกิดขึ้นมาหลังโลกล่มสลายเขาได้อาศัยอยู่ใน  หมู่บ้านซิลเวอรล์  ีฟ หมู่บ้าน เล็ก ๆ\nที่ยังคงปลอดภัยจากพลังมืดที่แพรก่ ระจายไปทั่วโลก ที่นั่น เขาได้พบกับ  ผู้เฒ่า Elder ผู้นำของหมู่บ้าน\nซึ่งเปิดเผยความจริงเกี่ยวกับพลังชั่วร้าย และมอบหมายภารกิจสำคัญให้ไลออน เพื่อฟื้นฟูสมดุลของโลก\n\nFloor 2 Stone Golem\n ดินแดนแห่งหินและแรงสั่นสะเทือน\nเมื่อไลออนก้าวเข้าสู่ถ้ำเอเลเนีย สิ่งแรกที่เขาเผชิญคือชั้นที่ปกคลุมด้วยหินเก่าและแร่พลังงานแปลกประหลาด\nดินแดนนี้เต็มไปด้วยมอนสเตอร์ธาตุหินที่แข็งแกร่งและทนทาน เช่น Star (สตาร์) ทีมีความแข็งแกร่ง และ\nNone (นัน) มอนสเตอร์ไม่มีธาตุที่อ่อนแอแต่มีเยอะจนน่ารำคาญ มินิบอส:\nMeteor (มิเทอร์)\nโกเล็มยักษ์ที่เกดิ จากหินอุกกาบาตซึ่งดูดซับพลังเวทจากอดีตของอิกนาร์ทิส การโจมตีของมันช้าแต่รุนแรง\nและ สามารถสั่นสะเทือนพื้นดินจนทำให้ผู้บุกรุกเสียหลัก การเอาชนะมิเทอร์ต้องอาศัยไหวพริบ\nLevel 2: Floor 2 Stone Golem\n\nFloor 4 Heart of the Alenia ศูนย์กลางแห่งพลังมืดและบทสรุปของตำนาน\nชั้นสุดท้ายของถ้ำ ลึกเกินกว่าจะวัดได้ ดินแดนนี้ถูกปกคลมุ ด้วยเงาแห่งอดีตและเสียงกระซิบจากวิญญาณที่ล้ม\nตาย ที่ใจกลางมีพลังเวทที่ยังคงหลงเหลือจากการทดลองของอัซมารอส ความจริงบางอย่างกำลังรอไลออนอยู่\nที่นี่\nบิ๊กบอส: Rdus (อาร์ดัส) สัตว์ร้ายที่เกิดจากการทดลองที่ผิดพลาด มนั ไม่ใช่เพียงแค่สัตว์กลายพันธุ์\nแต่คือ “เครื่องทดลองที่มีชีวิต” ร่าง ของอาร์ดัสเต็มไปด้วยพลังเวทไฟและแรห่ ินที่แปรปรวน มนั\nทั้งปกป้องและทุกข์ทรมานกบั พลังในตัวเอง ไลออ นต้องไม่เพียงแค่เอาชนะมั น แต่ต้อง “เข้าใจมัน”\nเพื่อดึงเนื้ออาร์ดัสบริสุทธิ์ออกมาสำหรับเมนูศักดิ์สิทธิ์ Level 4: Floor 4 Heart of the Alenia\nศูนย์กลางแห่งพลังมืด และบทสรุปของตำนาน นี่คือชั้นสุดท้ายของถ้ำเอเลเนีย —\nลึกเกินกว่าจะมีแสงธรรมชาติส่องถึง\nทุกก้าวที่เดิน ลมหายใจของอดีตและพลังแห่งคำสาปยังคงล่องลอยอยู่\nเศษซากของเวทมนตร์ต้องห้ามยังคงรบกวนจิตใจ\nเสียงกระซิบจากวิญญาณผลู้ ้มตายสะท้อนก้อง สื่อสารถึงความทรมานที่ไมม่ ีใครได้ยินนานนับศตวรรษ\nณ ใจกลางของความมืด Rdus (อาร์ดัส)  บิ๊กบอสสุดท้าย ปรากฏตัว\nมันคือผลลัพธ์จากการทดลองที่ผิดพลาดของจอมเวทอัซมารอส ร่างของมันคือการรวมกันของเวทไฟและแร่หิน\nวิปลาส แข็งแกร่ง ดุดัน และเต็มไปด้วยความเจ็บปวด มันมิได้มีเพียงร่างกาย… แต่วิญญาณของมันยงั โหยหา\nการปลดปล่อย ไลออนไม่อาจเอาชนะอาร์ดัสได้ด้วยการฟาดฟันเพียงอย่างเดียว  เขาต้อง “เข้าใจ”\nธาตุแท้ของมัน\nใช้สัมผัสแห่งวตั ถุดิบเพื่อหาจุดสมดุลระหว่างรสชาติแห่งชีวิตและความเจ็บปวด แล้วดึง “เนื้ออาร์ดัสบริสุทธิ์”\nออกมา วัตถุดิบสุดท้ายของเมนูศักดิ์สิทธิ์ เพื่อปรุงอาหารที่จะเปลี่ยนโลกนี้กลับไปสู่ความสมดุลอีกครงั้\nBackstory\nหลายร้อยปีก่อน โลกของ เอเลเนีย เคยรุ่งเรอื งและอุดมสมบูรณ์ด้วยพลังแห่งธรรมชาติ โดยเฉพาะ\nดินแดนศักดิ์สิทธิ์ที่ชื่อว่า “อิกนาร์ทิส” ซึ่งเป็นศูนย์กลางของพลังชีวิตและวัตถุดิบล้ำค่า ชนเผ่าและผู้คนจากทั่ว\nสารทิศต่างหลั่งไหลมาเพื่อนำวัตถุดิบเหล่านี้ไปใช้ในการปรุงยา รักษาโรค และเสริมพลังเวท\nแต่ทุกสิ่งกลับเปลี่ยนไปเมื่อชายผู้หนึ่งนามว่า “อัซมารอส” ปรากฏตัว เขาเคยเป็นนักปราชญ์ผู้เปี่ยมด้วย\nความรู้เวทมนตร์ แต่หลงใหลในแนวคิดสุดโต่งที่เชื่อว่า \"มนุษย์ควรเทียบเท่าทวยเทพ\" เพื่อบรรลุจุดนั้น เขาจึง\nทดลองเวทมนตร์ต้องห้ามเพื่ อตามหา “อาหารแห่งพระเจ้า” เมนใู นตำนานที่จะมอบพลังไร้ขีดจำกัดให้ผู้ที่กิน\n\nมัน การทดลองครั้งนั้นใช้วัตถุดิบต้องคำสาปมากมาย และมันได้สร้างผลกระทบร้ายแรง\nพลังมืดที่ไม่อาจควบคุมได้ ได้แทรกซึมลงไปในผืนดิน นำ้ อากาศ และสิ่งมีชีวิต\nดินแดนอิกนาร์ทิสกลายเป็นแหลง่ พลังชั่วร้าย สัตว์พืช กลายพันธุ์ คนล้มตาย และธรรมชาติล่มสลาย\nแม้ว่าหลายประเ ทศจะร่วมมือกันผนึกตัวอัซมารอสได้ในที่สุด แต่ผลจากเวทต้องห้ามของเขายังคงแพร่กระจาย\nอย่างต่อเนื่อง ไม่มีใครหยุดยั้งมันได้ โลกเริ่มแหลกสลาย ผู้คนต้องอพยพลงใต้ดินเพื่อความอยู่รอด และนั่นคือ\nจุดเริ่มต้นของ หมู่บ้านซิลเวอร์ลีฟ  หนึ่งในที่หลบภัยสุดทา้ ยของมนุษย์ ห ลายชั่วอายุคนผ่านไป\nผู้เฒ่าแห่งหมู่บ้านซลิ เวอร์ลีฟได้ค้นพบเอกสารโบราณที่กล่าวถึง “เมนู ศักดิ์สิทธิ์”\nซึ่งสามารถชำระล้างพลังมืดและฟื้นฟูสมดุลให้กับเอเลเนียได้ แต่ในการทำเมนูนั้น จำเป็นต้องใช้\nวัตถุดิบพิเศษที่สุด “เนื้ออาร์ดัส” จากสัตว์กลายพันธุ์ระดับสูงในส่วนลึกของถ้ำเอเลเนีย จากตำนาน\nกลายเป็นภารกิจ\nจากความหวังริบหรี่ กลายเปน็ โอกาสครั้งสุดท้าย นี่คือจุดเริ่มต้นของเรื่องราวของ ไลออน เดก็\nหนุ่มเชฟผู้แบกรับชะตาของโลก ด้วยมีดทำครัวในมือ และหัวใจที่ เชื่อในพลังของอาหาร\n\n\nKey plot elements\nโลกที่ล่มสลาย\nโลกเอเลเนียเคยอุดมสมบูรณ์ด้วยพลังธรรมชาติ แต่ปัจจุบันกลับถูกพลังมืดกัดกินอย่างช้าๆ\nการทดลองเวทมนตร์ของ “อัซมารอส” ได้สร้างคำสาปที่แพร่กระจายไม่หยุด จอมเวทต้องสาป อัซมารอส\nตัวการสำคัญทจี่ ุดชนวนภัยพิบัติของโลก ด้วยความทะเยอทะยานสร้าง “อาหารแห่งพระเจ้า”\nแม้จะถูกผนึกแล้ว แต่พลังของเขายังหลงเหลือและเปลี่ยนแปลงธรรมชาติ\nElder แห่งหมู่บู้านซิลเวอร์ลีฟ\nผู้นำทางภูมิปัญญา ผู้ค้นพบตำนาน \"เมนูศักดิ์สิทธิ์\" ที่เป็นทางรอดสุดท้ายของโลก\nเป็นคนที่มอบภารกิจให้ไลออนออกเดินทาง ไลออน\nเด็กหนุ่มผู้มีพรสวรรค์ด้านการทำอาหาร และ“สัมผัสแห่งวัตถุดิบ” ที่ช่วยให้เขาเข้าใจคุณสมบัติ\nลึกซึ้งของวัตถุดิบเขาคือความหวังสุดท้ายในการปรุงเมนูที่จะชำระล้างโลก ถ้ำเอเลเนีย\nดันเจี้ยนที่แบ่งออกเป็น 4 ชั้น แต่ละชั้นสะท ้อนพลังของธรรมชาติที่ผิดเพี้ยน\n\n- มีมอนสเตอร์กลายพันธุ์, มินิบอส และสุดท ้ายคือ บอสใหญ่ Rdus\nซึ่งเป็นวัตถุดิบหลักของเมนู เนื้ออาร์ดัสวัตถุดิบศักดิ์สิทธิ์ที่หาได้เพียงหนึ่งเดียว และต้องได้มาด้วยความ\nกล้าหาญและความเข ้าใจในธรรมชาติ\n- ไม่ใช่เพียงแค่ “เอาชนะ” แต่ต้อง “เข้าถึงหัวใจ” ของอาร์ดัสเพื่อดึงเนื้อที่บริสุทธิ์ที่สุดออกมา\nเมนูศักดิ์สิทธิ์\n- อาหารที่สามารถฟื้นฟูสมดุลของโลก และขจัดพลังมืดของอัซมารอสออกไปจากเอเลเนีย จะถูกปรุงขึ้นเ\nมื่อไลออนกลับจากการเดินทาง พร้อมวัตถุดิบที่ได้จากทั้ง 4 ชั้น\nการต่อสู้ + การปรุงอาหาร\n- เกมเพลย์ผสมการต่อสู้กับมอนสเตอร์ในสไตล์ Action RPG กับการรวบรวมวัตถุดิบเพื่อใช้ในการ\nคราฟต์เมนูพิเศษ\n- การทำอาหารไม่ใช่แค่เรื่องรสชาติ แต่คือการเยียวยาโลก\n\nCharacters\nMain Characters Lion – Backstory\nไลออนเกิดและเติบโตในหมู่บ้านซิลเวอร์ลฟี หนึ่งในสถานที่ปลอดภัยไม่กี่แห่งที่เหลืออยู่หลังจากโลก\nถูกพลังมืดกลืนกิน เขาเติบโตมาในครอบครัวของช่างทำอาหารพื้นบ้าน และเรียนรู้การใช้วัตถุดิบจากธรรมชาติ\nอย่างลึกซึ้ง ตั้งแต่ยังเด็ก เขาแสดงความสามารถแปลกประหลาดที่ทำให้เขาสามารถรับรู้พลังและสภาวะของ\nวัตถุดิบได้ เอลเดอร์ของหมู่บ้านจึงเชื่อว่าเขาเป็น \"ผู้ถูกเลอื ก\" ที่จะคืนสมดุลให้กับโลก\nการเดินทางของไลออนเริ่มต้นขึ้นเมื่อเอลเดอร์มอบหมายภารกิจสำคัญให้เขาออกเดินทางไปยังถ้ำเอเล เนีย\nเพื่อนำเนื้ออาร์ดัสมาใช้ในการปรุง เมนูศักดิ์สิทธิ์ เมนูเดียวที่จะขจัดพลังมืดและฟื้นฟูเอเลเนียได้อีกครั้ง\nPersonality\n1. อ่อนโยนและเห็นใจ: ไลออนมักมองเห็นคุณค่าในสิ่งเล็กๆ แม้กระทั่งวัตถุดิบที่คนอื่นมองข้าม\n2. มุ่งมั่นแต่ถ่อมตวั: เขาไม่คิดว่าตัวเองเป็น “ผู้กอบกู้” แต่พรอ้ มจะทำหน้าที่ของตนให้ดีที่สุด\n3. ช่างสังเกตและมีจิตใจละเอียดอ่อน: เขาเข้าใจรสชาติ ความรู้สึก และพลงั ของสิ่งต่างๆ ได้ลึกซึ้ง\n4. เชื่อมั่นในพลังของอาหาร: เขาเชื่อว่าอาหารไม่เพียงเติมเต็มท้อง แต่ยังเติมเต็มใจและโลกได้\nAppearance เพศ: ชาย อายุ: 17–18 ปี รูปร่าง: สูงเพรียว กระฉับกระเฉง ผม: สีน้ำตาลไหม้\nปลายยุ่งเลก็ น้อยเหมือนเชฟที่เพิ่งออกจากครัว ตา: สีน้ำตาลประกายทอง\nสื่อถึงสัมผัสวัตถดุ ิบ ชุดประจำตัว: เสื้อคลุมแบบผสมผสานกับชุดนักผจญภัย\nมีซองเก็บมีดทำครัวอยู่ข้างเอว สัญลักษณ์เฉพาะตัว : ผ้าผูกหัวที่ได้รับจากแม่\nและมีดทำครัวสืบทอดจากพ่อ\nSpecial abilities 1. สัมผัสแห่งวัตถุดิบ ( Ingredient Sense)\n- รับรู้ความบริสุทธิ์ พลังเวท และเงื่อนไขการใช้วัตถุดิบให้เกิดประสิทธิภาพสูงสุด\n- ตรวจจับวัตถุดิบลับที่ผู้เล่นทั่วไปหาไม่เจอ\n\nJack Whitesmith ( แจ็ค ไวท์สมิธ) – พ่อค้าอัปเกรดอาวุธ บทบาท:\n- ช่วยอัปเกรดอาวุธของไลออน เช่น มีดทำครัว กระทะไฟ เครื่องปรุงเวท\n- เพิ่มค่าสถานะพิเศษ หรือเปิดท่าโจมตีใหม่\n- ใช้วัตถุดิบจากมอนสเตอร์ + แร่พิเศษที่ได้จากดันเจี้ยนแต่ละชั้น\n- ให้ไอเท็มคราฟต์ระดับสูงสำหรับสายต่อสู้ บุคลิก:\n- ขรึม พูดน้อย ตรงไปตรงมา\n- เป็นอดีตทหารหลวงที่ผันตัวมาเป็นช่างเหล็กเพื่อหลีกหนีสงคราม\n- แอบห่วงไลออนเหมือนน้องชาย คำพูดประจำตัว:\n“คมของมีดไม่สำคัญเท่ามือท ี่ถือมัน... แต่ขัดไว้ก็ไม่เสียหาย”\n\nElder (แอลเดอร์) - ผู้นำแห่งหมู่บ้านซิลเวอร์ลีฟ และผู้มอบภารกิจหลัก บทบาท:\n- ผู้เปิดเผยความจริงเบื้องหลังคำสาปและ “เมนูศักดิ์สิทธิ์”\n- เป็นคนส่งไลออนออกผจญภัย และคอยแนะนำเมื่อกลับจากดันเจี้ยน\n- อัปเดตเรื่องราวหลัก ( Main Quest Progress)\n- มีบทพูดที่ชี้แนะเชิงปรัชญาและจรรยาบรรณของเชฟผู้เยียวยา บุคลิก:\n- ฉลาด ลึกซึ้ง นมุ่ นวล\n- เปรียบเสมือนพ่อคนที่สองของไลออน\n- มีอดีตลึกลับกับอัซมารอส และเคยเห็นโลกในยุคก่อนล่มสลาย คำพูดประจำตัว:\n“อาหารที่แท้จริง... คือสิ่งที่หล่อเลี้ยงทั้งร่างกายและจิตวิญญาณ”\n\nMonsters None\nนัน\n- ประเภท: ไม่มีธาตุ\n- ต้นกำเนิด: เคยเป็นสัตว์ป่าหรือสิ่งมีชีวิตทั่วไปที่อาศัยในโลกธรรมชาติ\n- ผลกระทบจากพลังมืด:  โดน “กลืนกิน” จนสูญเสียสัญชาตญาณพื้นฐาน กลายเป็นสิ่งมีชีวิตที่ไม่มี\nจุดมุ่งหมาย นอกจากการทำลายทุกสิ่งที่เคลื่อนไหว\n- รูปลักษณ:์ เปน็ สัตว์ 4 ขา\n- ลักษณะการโจมตี:  ดุร้าย รวดเร็ว คาดเดาไม่ได้ พฤติกรรมเหมือนสิ่งมีชวี ิตที่กำลังเจ็บปวดอยู่\nตลอดเวลา\n- จุดเด่น:\no แรงโจมตีสูงแต่ไร้แบบแผน o\nยิ่งอยู่ใกล้พลังมืดมาก ยิ่งแข็งแกร่งและบ้าคลั่ง บทบาทในเกม:\n- ความท้าทาย: ผู้เล่นต้องปรับกลยุทธ์ ในการต่อสู้\n- เชิงเนื้อเรื่อง: สื่อถึงผลของการทดลองที่ล้มเหลวและธรรมชาติที่ถูกบิดเบือนโดยเวทต้องสาป\n- แนวคิด: \"None\" แสดงถึงสงิ่ มีชีวิตที่สูญเสียทุกสิ่ง —แม้แต่ตัวตน\n4 Action หลักของมอนสเตอร์\n1. Idle (ยืนนิ่ง):\no ยืนในตำแหน่งเดิม เคลื่อนไหวน้อยมาก o สลับท่าทาง เช่น\nขยับหัว หายใจแรง ดูรอบๆ อย่างระแวง\n\nฉากเนื้อเรื่อง/อาหาร ( Cutscene ) โครงสร้างหน้าต่างๆของเกม ( Game\nWireframe )\n- icon  64×64px ถึง 128×128px Game Dev :\n- on click เข้าไปยังตัวเกม\n- ชื่อเกม Dungeon Dungry\n\n\n\n)\n- มี Mini Boss ในแต่ละชั้น และ Big Boss\nที่ชั้นสุดท้าย\nEnvironmental Design\n- ทางเดินบางจุดแคบและมืดและบางจุดเป็นถ้ำกว้\nางขนาดใหญ่\n- ธีมของแต่ละชั้นแตกต่างกัน เช่น หิน, ไฟ,\nธรรมชาติ\nผู้เล่น และ ศตั รู ( Characters & Enemies\nMain Character\n- Lion (ไลออน) –\nนักทำอาหารที่ต้องผจญภัยเพื่อช่วยทุกคน\nBosses\n- Big Boss - ศัตรูสุดท้ายในดันเจี้ยน\n- Mini Bosses - หิน & ไฟ\nMonster / Enemies\n- มอนสเตอร์หิน ( x5)\n- มอนสเตอร์ไฟ ( x5)\n- มอนสเตอร์ทั่วไป ( x10) ไอเทม และ\nกระเปา๋ ( Items & Inventory )\n- Weapons: มีด 3 ระดับ\n- Armors: เกราะ 3 ระดับ\n- Potions: ฟื้นฟู HP และ Stamina\n\n)\n- Sound Design : Background Music + SFX\n(No Voice Over) เครื่องมือการทำงาน ( Development\nTools )\n- Engine: Unity (C#)\n- 3D Modeling: Blender\n- 2D Assets: Adobe Illustrator\n- Animation: Adobe After Effects\n- Sound Editing: Adobe Audition\nสมาชิกทีมพัฒนา ( Team Responsibilities )\n1. ธนพัฒน์ บุญขำ ( Game Development ) -\nProgramming, UI, Level Design\n2. พิชญธิดา สุวรรณธาดา ( Game Artist )\n- Art, Effects, Character Design\n3. อนิวรรต บุญคงมาก ( Game Design )\n- Story, UI, Scene Design\n\n*จากหน้า: 3, 4, 12, 14, 15, 16, 17, 19, 20, 40, 41, 56, 58*\n\n---\n\n## Characters (ตัวละคร)\n\n2. Alchemy Cook ( ปรุงเพื่อเสริมพลัง)\n- ปรุงอาหารระหว่างการผจญภัย เพื่อบัฟค่าต่อสู้ ฟื้นพลัง หรือสร้างสถานะพิเศษ\n- อาหารบางชนิดสามารถใช้ “ปลุกความทรงจำ” ของมอนสเตอร์ ทำให้เกิดทางเลือกใหม่ เช่น การ\nเจรจา แทนการต่อสู้\n3. Culinary Combat ( การต่อสู้ด้วยศาสตร์การทำอาหาร)\n- ใช้อุปกรณ์ทำอาหารเป็นอาวุธ เช่น มีดทำครวั แบบสั้น -เร็ว, กระทะไฟร้อนแรง, ขวดปรุงรสสร้างม่าน\nหมอก\n- สกิลพิเศษคือ “ Cooking Combo” ซึ่งผสมการฟันและการปรุงชั่วขณะเพื่อสร้างความเสียหายเวท\nผสมสถานะ\n\nNPCs\nGeorge Blacksmith ( จอรจ์ แบล็คสมิธ) - พ่อค้าแลกเปลี่ยนสมนุ ไพรและวัตถุดิบธรรมชาติ บทบาท:\n- ตั้งร้านอยู่ที่หมู่บ้านซิลเวอร์ลฟี\n- แลกเปลี่ยนสมุนไพร, เห็ด, วัตถุดิบจากมอนสเตอร์ หรือพืชกลายพันธุ์\n- ให้ข้อมูลเชิงลกึ เกี่ยวกับการใช้วัตถุดิบเพื่อรักษา หรือปรุงอาหารบางประเภท\n- มีเควสย่อยให้ไลออนออกหา \"พืชพิเศษ\" ตามฤดูกาลหรือสภาพดันเจี้ยน บุคลิก:\n- ใจดี อารมณ์ขนั ขี้แซว แต่เกง่ เรื่องสมุนไพรขั้นเทพ\n- เคยเป็นนักเดินทางมาก่อน แต่ตอนนี้เปิดร้านเพราะขาเจ็บจากการต่อสู้กับมอนสเตอร์\nคำพูดประจำตัว:\n“ของขมหน่อย แต่รักษาได้แม้แต่ใจที่เหนื่อยล้า!”\n\n*จากหน้า: 18*\n\n---\n\n## Enemies & Bosses (ศัตรู & บอส)\n\nหลังได้รับภารกิจจาก ผู้เฒ่า Elder ไลออนต้องออกจากหมู่บ้านซิลเวอร์ลีฟเป็นครั้งแรก เขาเดินทางสู่\nทางเข้าของ “ถ้ำเอเลเนีย” ดันเจี้ยนลึกลับที่ถูกพลังมืดกลืนกิน\nชั้นแรกของถ้ำพาเขาเข้าสู่ \" Stone Golem \" พื้นที่ลึกใต้ภูเขาที่เต็มไปด้วยหินผลึก เรืองแสง และซากอารย\nธรรมโบราณที่ถูกหลงลืม\nที่นี่ ไลออนต้องเผชิญหน้ากับ \" Star\" มอนสเตอร์ที่คอยขวาง และ \" Meteor\" มินิบอสยักษ์ที่ปกป้องทางลงสู่ชั้น\nถัดไป เพื่อเอาชีวิตรอด ไลออนต้องใช้ทักษะการต่อสู้ร่วมกับการปรุงอาหารจากสมุนไพรที่หาได้ในพื้นที่ เพื่อฟื้น\nพลังและเพิ่มสถานะ ก่อนจะท้าทายศัตรูสุดโหดของชั้ นนี้\n\nFloor 3 Blaze Zone อาณาเขตแห่งไฟและความโกลาหล\nแสงสีแดงส้มสะท้อนอยู่ตลอดผนังถ้ำ ลาวาและไอน้ำร้อนพวยพุ่งในทุกฝีก้าว ไฟไม่เพียงเผาไหม้ทุกสิ่ง แต่ยัง\nแทรกซึมเข้าไปในใจของสิ่งมชี ีวิต ทำให้พวกมันคลั่งเกินควบคุม มอนสเตอร์ในชั้นนี้ได้แก่ Light (ไลท์)\nมังกรไฟขนาดเล็กที่โจมตีด้วยเปลวเพลิง และ None (นัน) มอนสเตอร์ไม่ มีธาตุที่โดนไฟกลืนกินจนบ้าคลั่ง\nมินิบอส: Blazer (เบลสเซอร์)\nสัตว์ร้ายครึ่งมนุษย์ครึ่งอัคคี ผู้ควบคุมเปลวเพลิงได้ตามใจนึก ไลออนต้องใช้พลังของสมุนไพรเย็นที่พบในชั้น\nก่อนหน้าเพื่อต้านทานความร้อนและเปิดโอกาสในการโจมตี Level 3: Floor 3 Blaze Zone\nหลังเอาชนะมินิบอสแห่งชั้นหิน ไลออนดำดิ่งสู่ชั้นถัดไป ซึ่งต่างจากก่อนหน้าโดยสิ้นเชิง — Blaze\nZone คืออาณาเขตแห่งไฟและความโกลาหล\nแสงแดงส้มสะท้อนตามผนังถ้ำ ลาวาเดือดพวยพุ่งในทุกฝีก้าว ไอร้อนแทรกซึมเข้าทั้งกายและจิตใจ ในพื้นที่นี้\nไฟไม่ได้แค่เผาไหม ้ แต่ยังปลุกความบ้าคลั่งให้สงิ่ มีชีวิต\nมอนสเตอร์ประจำชั้น ได้แก่:\n- Light – มังกรไฟขนาดเล็ก ปราดเปรียว โจมตีด้วยลมหายใจเพลิง\n- None – สิ่งมชี ีวิตไร้ธาตุที่ถูกไฟกลืนกินจนไร้สติ มินิบอส: Blazer\n(เบลสเซอร์)\nอสูรร่างครึ่งคนครึ่งเปลวเพลิง ที่ควบคุมไฟได้ตามใจคิด\nไลออนต้องใช้สมุนไพรเย็นจากชั้นก่อนหน้าในการปรุงอาหารเพื่อลดผลกระทบจากอุณหภูมิและสรา้ งโอกาส\nโจมตีสวนกลับ\nการเอาชนะเบลสเซอร์ไม่ใช่แค่การชิงชัยด้วยกำลัง แต่ต้องใช้ความเข้าใจในวัตถุดิบและจังหวะอย่างแท้จริง\n\nLevel walkthrough\nLevel 2: Floor 2 Stone Golem\nSynopsis\nไลออนเดินทางลึกเข้าไปในถ้ำเอเลเนียที่มีมอนสเตอร์หิน ท่ามกลางพื้นที่ที่มืด เขาต้องเก็บแร่หายากเพื่ออัป\nเกรดเครื่องครัวของเขาก่อนที่จะเผชิญหน้ากับมินิบอส \"มิเทอร์\" เพื่อเปิดทางไปยังระดับถัดไป\nObjectives\n1. เก็บสมุนไพร 10 ชิ้น\n2. เอาชนะมอนสเตอร์ \" None\" หนิ 5 ตัว\n3. อัปเกรดอาวุธที่ร้านของแจ็คโดยใช้แร่\n4. ทำอาหารเพื่อใช้ฟื้นฟูเลือด\n5. เอาชนะมอนสเตอร์ \"สตาร์\" หิน 5 ตัว\n6. ค้นหามินิบอส \"มิเทอร\"์ และเอาชนะเพื่อเปิดประตูไปยัง Blaze Zone Locations\n1. อารีน่าของมิเทอร์ o มินิบอส \"มิเทอร์\" โผล่ออกมาจากมุมมืด\n2. เขาวงกต\no เขาวงกตที่ทำให้ผู้เล่นได้งงงวยเพื่อเพิ่มความผจญภัย\n3. แท่นหลอมในหมู่บ้าน o ร้านตีเหล็กของแจ็คในที่ชั้น 1\n4. บริเวณชั้นนอกพื้นที่บอส o มอนสเตอร์ 10\nตัวคอยขัดขวางผู้เล่นและปอ้ งกันมินิบอส \"มิเทอร์\" เขาวงกต\n- เขาวงกตที่ทำให้ผู้เล่นได้สับสนงงงวยเพื่อเพิ่มความผจญภยั\nและสามารถฟาร์มเก็บของแรร์ได้ บริเวณชั้นนอกพื้นที่บอส\n\nLevel 4: Floor 4 Heart of the Alenia\nSynopsis หลังจากฝ่าฟันดันเจี้ยนทั้งสองชั้น ไลออนมาถึงใจกลางของถ้ำเอเลเนีย สถานที่ที่พลังมดื\nของอัซมารอสยังคง สถิตอยู่ และเป็นที่อาศัยของมอนสเตอร์กลายพันธุ์ขั้นสุดยอด: อาร์ดัส ( Rdus)\nผู้ปกป้องหัวใจของพลัง ธรรมชาติ เขาต้องต่อสู้กับมันและเลือกว่าจะกำจัดหรือสงบมัน เพื่ อนำ\n“เนื้ออาร์ดัส” กลับไปยังหมู่บ้านเพื่อ ปรุงเมนูศักดิ์สิทธิ์\nObjectives\n1. เก็บสมุนไพร 5 ชิ้น\n2. อัปเกรดอาวุธที่ร้านของแจ็คโดยใช้แร่\n3. ทำอาหารเพื่อใช้ฟื้นฟูเลือด\n4. ค้นหาบอส \"อาร์ดัส\" และเอาชนะและจบเรื่องราว\nLocations ลานกว้างที่อยอู่\nาศัยของ อาร์ดัส\n- มินิบอส \"อารด์ ัส\" โผล่ออกมา แท่นหลอมในหมู่บ้าน\n- ร้านตีเหล็กของแจ็คในที่ชั้น 1 บริเวณชั้นนอกพื้นที่บอส\n- เดินตามทางเดินที่มีคบเพลิง: เก็บสมุนไพร 5 ชิ้น Level walkthrough\nบริเวณชั้นนอกพื้นที่บอส\n- เดินตามทางเดินที่มีคบเพลิง: เก็บสมุนไพร 10 ชิ้น (การโต้ตอบ “เก็บ”)\nแท่นหลอมในหมู่บ้าน\n\n*จากหน้า: 13, 35, 38*\n\n---\n\n## Game Art (งานภาพ)\n\n2.\nLoading Page\n\n\nGame Art :\n- ออกแบบภาพ Background\n- Loading Icon\n- Process Bar\n- เล่น Background Music หรือ Sound Effect เบาๆ Game Dev :\n- นำ Asset มาใช้\n- ทำให้โหลดฉากแบบ Async และเพิ่ม Animation หรือ Effect\n\n14.\n\n\nGame Art :\n- การจัดวาง Layout ข้อความที่ปรากฎ Game Dev :\n- สร้างเงื่อนไขการชนะและแพ้ เพื่อให้ข้อความขึ้น\n\n*จากหน้า: 42, 54*\n\n---\n\n## Settings/Options (การตั้งค่า)\n\nStar สตาร์\n- ประเภท: มอนสเตอร์ธาตุหิน\n- แหล่งที่พบ: ชนั้ ที่ 2 – Stone Golem Domain\n- ต้นกำเนิด: หนิ ศักดิ์สิทธิ์จากภูเขาแห่งความสมดุลที่ถูกพลังมืดของอิกนาร์ทิสแทรกซึม\n- รูปลักษณ:์ o ร่างกายเป็นก้อนหินกลมใหญ่คล้ายดาวเคราะห์ขนาดเล็ก o\nพื้นผิวแตกเป็นลายเรืองแสงคล้ายเส้นพลังเวท\n- ลักษณะพิเศษ:  o มีเยอะจนน่าหงุดหงิด\n- จุดอ่อน:\no มีการโจมตีที่ช้า o\nมีความเชื่องช้า บทบาทในเกม:\n- การต่อสู้: ผู้เล่นต้องหลบโจมตี\n- กลยุทธ์:\nใช้สมุนไพรที่เพิ่มเลือดเพื่อเอาตัวรอด\n- เชิงสัญลักษณ:์\nStar แสดงถึง \"พลังธรรมชาติที่ถูกควบคุม\" และสิ่งศักดิ์สิทธิ์ที่ถูกบิดเบือนโดยเวทมนตร์ต้องสาป\n4 Action หลักของมอนสเตอร์\n1. Idle (ยืนนิ่ง):\no ยืนในตำแหน่งเดิม เคลื่อนไหวน้อยมาก\no สลับท่าทาง เช่น ขยับหัว หายใจแรง ดูรอบๆ อย่างระแวง\n2. Walk (เดิน):\n\n*จากหน้า: 22*"
    },
    {
      "id": "dungeon-dungry-readable",
      "title": "Dungeon Dungry — ฉบับอ่านง่าย (หัวข้ออัตโนมัติ)",
      "date": "2025-08-20",
      "tags": [
        "GDD",
        "Dungeon Dungry",
        "readable",
        "reformat",
        "auto-title"
      ],
      "summary": "เวอร์ชันรีฟอร์แมต อ่านง่าย พร้อมหัวข้ออัตโนมัติจากเนื้อหา",
      "content_md": "# Dungeon Dungry — ฉบับอ่านง่าย (หัวข้ออัตโนมัติ)\n\n> รีฟอร์แมตจาก PDF และตั้งชื่อหัวข้ออัตโนมัติ · อัปเดต: 2025-08-20\n\n\n---\n\n\n## Game Design Document \"Dungeon Dungry \" (จากหน้า 1)\n\nGame Design Document \"Dungeon Dungry \"  \n\n**จัดทำโดย \nนายธนพัฒน์ บุญขำ รหัสนักศึกษา**: 6530611012  \nนางสาวพิชญธิดา  สุวรรณธาดา   รหัสนักศึกษา: 6530611016  \n**นายอนิวรรต  บุญคงมาก   รหัสนักศึกษา**: 6530611018  \n\nอาจารย์ที่ปรึกษา  \nดร.วรวิกา วัฒนสุนทร  \n\nข้อเสนอโครงการฉบับนี้เปน็ ส่วนหนงึ่ ของวิชา 968 -391 Project in \nComputing มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตภูเก็ต \nภาคการศึกษาที่ 2/2567 - 1/2568\n\n\n---\n\n\n## Overview (ภาพรวม) (จากหน้า 2)\n\nDungeon Drugry ผจญภัยในโลกดันเจี้ยน  \n\nภาพรวมเกม ( Game Overview )  \n**Title game **: Dungeon Drugry ผจญภัยในโลกดันเจี้ยน   \n**Elevator pitch **: Dungeon Dungry เปน็ เกมสำรวจดันเจี้ยนแบบ 3 D ที่ผู้เล่นจะได้รับบทเป็น \"ไลออน\" \n(Lion) นักทำอาหารที่ต้องเดินทางเข้าสู่ถ้ำ \" Elenia\" เพื่อตามหา \"เนื้ออาร์ดัส\" ทสี่ ามารถฟื้นฟูสมดุลของ \nธรรมชาติ เกมจะมีการค้นหาวัตถุดิบจากแผนที่และมอนสเตอร์ พร้อมระบบทำอาหารและการต่อสู้   \n\nConcept  \nOverview  \n<ul>\n<li>Genre: Adventure / Explore  </li>\n<li>Target audience:  </li>\n</ul>\n**o Age**: 15-30 o Gender: Male/Female  \n<ul>\n<li>Monetization: Freemium  </li>\n<li>Platforms & system requirements:   </li>\n</ul>\no Windows PC  \nไอเดียหลัก ( Game Concept )  \nDungeon Dungry เป็นเกมสำรวจดันเจี้ยนแบบ 3 D ที่ผู้เล่นจะได้รับบทเป็น \"ไลออน\" (Lion) นกั \nทำอาหารที่ต้องเดินทางเข้าสู่ถ้ำ \" Elenia\" เพื่อตามหา \"เนื้ออาร์ดัส\" ที่สามารถฟื้นฟูสมดุลของธรรมชาติ เกมจะ \nมีการค้นหาวัตถุดิบจากแผนที่และมอนสเตอร์ พร้อมระบบทำอาหารและการต่อสู้\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (จากหน้า 3)\n\nเรื่องราวและสถานที่ เรื่องราวของเกม ( Game Story )    \nเมื่อหลายร้อยปีก่อน ดินแดน “อิกนาร์ทิส” เคยเป็นศูนย์กลางของพลังแห่งธรรมชาติและ \nเป็นแหล่งวัตถุดิบล้ำค่าที่สุดในโลกเอเลเนีย แต่การปรากฏตัวของ \"จอมเวทต้องสาป อัซมารอส\"  ได้ \nนำมาซึ่งหายนะครั้งใญ่ เขาทดลองเวทมนตร์ต้องห้ามเพื่อสร้าง \"อาหารแห่งพระเจ้า\" ที่สามารถให้พลัง \nเหนือขีดจำกัดแก่มนุษย์ แต่กลับนำมาซึ่งคำสาปที่แทรกซมึ เข้าไปในธรรมชาติ พลังลึกลับได้ \nแพร่กระจายจากส่วนลึกของอิกนาร์ทิส ทำให้สิ่งมีชีวิตทุกชนิดเริ่มกลายพันธุ์ พื ชพันธุ์เน่าเปื่อย และ \nดินแดนทั้งหมดถูกปกคลุมดว้ ยพลังมืด   แม้ว่าจอมเวทอัซมารอสจะถกู ผนึกไ ปแล้ว \nแต่พลังของเขายังคงส่งผลกระทบต่อโลก และไม่มี ใครสามารถหยุดยั้งมันได้ จนกระทั่ง Elder ผู้เฒา่ \nแห่งหมู่บ้านซิลเวอรล์ ีฟ  พบว่ามีเพยี งอาหาร ศักดิ์สิทธิ์บางอย่างเท่านั้นที่สามารถฟื้นฟูสมดุลได้ \nและวัตถุดิบที่ขาดไม่ได้คือ “เนื้ออาร์ดัส” ซึ่งเป็น หัวใจสำคัญของเมนูนี้   ไลออน เป็นเดก็ \nหนุ่มที่เกิดและเติบโตในหมู่บ้านซิลเวอร์ลฟี แม้ว่าเขาจะมีพรสวรรค์ในการ ทำอาหารมาตั้งแต่เด็ก \nแต่สิ่งที่ทำให้เขาแตกต่างจากเชฟทั่วไปคือ \"สัมผัสแห่งวัตถุดบิ \"  พลังพิเศษที่ \nช่วยให้เขารับรู้คุณสมบัติของวัตถุดิบและดึงรสชาติที่แท้จริงของมั นออกมา  \nElder จึงมอบหมายให้ไลออนทำภารกิจตามหา \"เนื้ออารด์ ัส\" จากส่วนลึกของ ถ้ำเอเลเนีย ถ้ำแห่งนี้ \nเป็นหนึ่งในสถานที่ที่ได้รับผลกระทบจากพลังของอิกนาร์ทิส ทำให้มอนสเตอร์ภายในกลายพันธุ์และดุ ร้ายขึ้น \n**เส้นทางสู่เนื้ออาร์ดัส**: ดันเจี้ยนอันตรายและมินิบอสสุดโหด ถ้ำเอเลเนีย ไม่ใช่สถานที่ธรรมดา \nแต่เป็นดันเจี้ยนที่ถูกสร้างขึ้นจากพลังแห่งสมดุล และถูกแบ่ง ออกเป็น 4 ชั้นหลัก แต่ละชนั้ มี มินิบอส ทเี่ \nฝ้าประตูไว้ และไลออนต้องเอาชนะพวกมันให้ได้เพื่อ ปลดล็อกชั้นต่อไป\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 2) (จากหน้า 4)\n\nTheme and setting   \nDungeon Dungry เป็นเกมแนวแอ็คชัน RPG แบบผจญภัย ตั้งอยู่ในโลกแฟนตาซีมืดหลังวัน \nโลกาวินาศ ซึ่งธรรมชาติถูกคำสาปกระทำลาย ผู้เล่นสวมบท ไลออน เชฟหนุ่มผู้มีพลังพิเศษ ออกสำรวจ \nดันเจี้ยนใต้ดินขนาดใหญ่ แบง่ เป็นหลายชั้นธีมธาตุแตกต่างกัน พร้อมกับต่อสู้กับมอนสเตอร์กลายพันธุ์ \nรวบรวม วัตถุดิบล้ำค่า และปรุง “เมนูศักดิ์สิทธิ์” เพอื่ คืนสมดุลให้โลก สภาพแวดล้อมหลักคือ ถ้ำเอเลเนีย \nชั้นต่างๆ ได้แก่  \n<ul>\n<li>Silverleaf Village : หมูบ้านซิลเวอรล์  ีฟ  </li>\n<li>Stone Golem: ห้องผลึกธาตุหิ น  </li>\n<li>Blaze Zone: เขตลาวาและเพลิงร้อนแรง   </li>\n<li>Heart of the Alenia: ศูนย์กลางพลังมืดและที่อยู่ของบอส Rdus </li>\n</ul>\nเกมผสมผสานบรรยากาศโบราณร้างกับความหวังในการเยียวยาผ่านพลังของอาหาร \nให้ผู้เล่นได้สัมผัสทั้งความ ท้าทายและช่วงเวลาที่งดงามของโลกแฟนตาซีที่รอวันคืนชีพ  \nLearn more about the Locations, Story, and Characters of the game.\n\n\n---\n\n\n## Mechanics (ระบบการเล่น) (จากหน้า 5)\n\nProject scope  \nOur team Game Designer – Aniwat  \n<ol>\n<li>ชื่อ-นามสกลุ (Name)  </li>\n</ol>\n<ul>\n<li>นายอนิวรรต บุญคงมาก  </li>\n</ul>\n<ol>\n<li>ตำแหน่ง/บทบาท ( Role) Game Designer บทบาทหลัก: รับผิดชอบการออกแบบระบบการเล่น, </li>\n</ol>\nกฎของเกม, การวางแผนเนื้อหา, และการทำให้ ประสบการณ์ของผู้เล่นเป็นไปตามที่ตั้งใจไว้  \n<ol>\n<li>หน้าที่และความรับผิดชอบหลัก ( Responsibilities)  </li>\n</ol>\n<ul>\n<li>ออกแบบกลไกการเล่น ( Gameplay Mechanics) เช่น ระบบต่อสู้, การสำรวจ, การจัดการทรัพยากร </li>\n</ul>\nฯลฯ  \n<ul>\n<li>สร้างระบบความก้าวหน้าในเกม ( Progression Systems) เช่น เลเวล, ความสำเร็จ, ความสามารถที่ </li>\n</ul>\nปลดล็อก  \n<ul>\n<li>ออกแบบประสบการณ์ผู้เล่น ( Player Experience) ทั้งในด้านความสนุกและการสร้างอารมณ์ในการ </li>\n</ul>\nเล่น  \n<ul>\n<li>วางแผนการพัฒนาเนื้อหาหรือเนื้อเรื่องของเกม  </li>\n<li>สร้างระบบและสภาพแวดล้อมที่เกี่ยวข้องกับธีมและสไตลข์ องเกม  </li>\n<li>การทำเอกสาร GDD ที่เกี่ยวขอ้ งกับกลไก, ประสบการณ์ผู้เล่น, และการออกแบบโลกในเกม  </li>\n<li>สื่อสารและทำงานร่วมกับทีมเพื่อให้มั่นใจว่าการออกแบบเกมเป็นไปตามแนวทางที่ตั้งใจไว้  </li>\n</ul>\n<ol>\n<li>ทักษะ/ความชำนาญ ( Skills & Expertise)  </li>\n</ol>\n<ul>\n<li>เครื่องมือการออกแบบเกม: Unity, GDD Writing Tools / Nuclino  </li>\n<li>ความรู้ในระบบการออกแบบเกม: เช่น ระบบการต่อสู้, การพัฒนา AI, ระบบการจัดการทรัพยากร</li>\n</ul>\n\n\n---\n\n\n## Mechanics (ระบบการเล่น) (ต่อ 2) (จากหน้า 6)\n\n<ul>\n<li>ความเชี่ยวชาญในด้านการสร้างกลไกและระบบในเกม ( Gameplay Systems Design)  </li>\n<li>การวิเคราะห์และปรับปรุงสมดุลในเกม ( Game Balancing)  </li>\n<li>ทักษะในการเขียนเอกสารและสื่อสารไอเดีย ( GDD, Pitch Documents)  </li>\n<li>ความรู้พื้นฐานในการออกแบบ UI/UX  </li>\n<li>ประสบการณ์ในการทำงานร่วมกับทีมพัฒนา ( Cross-functional teams)  </li>\n</ul>\n<ol>\n<li>ช่องทางติดต่อ ( Contact Info)  </li>\n</ol>\n<ul>\n<li>อีเมล: s6530611018@phuket.psu.ac.th  </li>\n<li>เบอร์โทรศัพท์: 0826940174  </li>\n</ul>\n<ol>\n<li>เวลาที่พร้อมทำงาน ( Availability)  </li>\n</ol>\n<ul>\n<li>วัน-เวลาที่สะดวก จันทร์ –ศุกร์ 09:00–17:00  </li>\n<li>ประเมินชั่วโมงการทำงานต่อสัปดาห์ 20 -30 ชั่วโมง/สัปดาห์  </li>\n</ul>\n<ol>\n<li>ประสบการณ์ที่ผ่านมา ( Relevant Experience)  </li>\n</ol>\n<ul>\n<li>โปรเจกต์ที่ผ่านมาที่เกี่ยวข้อง:  </li>\n</ul>\n**o โปรเจกต์ **: -  \n<ul>\n<li>ผลงานที่เกี่ยวข้อง:  </li>\n</ul>\no มีส่วนร่วมในการออกแบบกลไกหรือระบบในเกมที่สำเร็จ  \no ประสบการณ์ในการทำงานร่วมกับทีมพัฒนาเกมในส่วนต่างๆ เช่น Art, Programming, \nSound, etc.  \n<ol>\n<li>ความรับผิดชอบต่อเป้าหมายหลัก ( Key Deliverables)  </li>\n</ol>\n<ul>\n<li>สร้างเอกสารการออกแบบระบบการเล่นทั้งหมด ( Game Systems Design Docs)  </li>\n<li>ออกแบบและพัฒนา Gameplay Mechanics สำหรับดันเจี้ยนและการต่อสู้</li>\n</ul>\n\n\n---\n\n\n## Mechanics (ระบบการเล่น) (ต่อ 3) (จากหน้า 7)\n\n<ul>\n<li>วางแผนและจัดการการทดสอบสมดุลของเกม ( Game Balancing)  </li>\n<li>สร้างและดูแล GDD สำหรับทมี พัฒนา 9. ความเชื่อมโยงกับหน้าที่อื่น ( Interdependencies)  </li>\n<li>ต้องประสานงานกับ:  </li>\n</ul>\n**o Programmer**: เพื่อพัฒนาและทดสอบระบบการเล่นที่ออกแบบ o Artist: เพื่อใหแ้ \nน่ใจว่าโลกและตัวละครสอดคล้องกับการออกแบบ o Sound Designer: เพื่อทำใหป้ \n**ระสบการณ์เสียงสอดคล้องกับธีม o QA Tester**: เพื่อทดสอบการทำงานของระบบต่างๆ \nในเกม  \n<ul>\n<li>Input/Output ที่ต้องแลกเปลี่ยน:  </li>\n</ul>\n**o Input**: ความต้องการและข้อเสนอแนะจากทีมเพื่อพัฒนาแนวทางการออกแบบ o Output: \nสร้างเอกสารการออกแบบและการประสานงานกับทีมในการพฒั นาต่อไป Game \nDevelopment – Tanapat  \n<ol>\n<li>ชื่อ-นามสกลุ (Name) </li>\n</ol>\nนายธนพัฒน์ บุญขำ 2. \nตำแหน่ง/บทบาท ( Role)  \n<ul>\n<li>Programmer  </li>\n</ul>\n<ol>\n<li>หน้าที่และความรับผิดชอบหลัก ( Responsibilities) สรุปงานที่รับผดิ ชอบโดยย่อ </li>\n</ol>\nเช่น  \n<ul>\n<li>เขียนเอกสารออกแบบระบบการต่อสู้  </li>\n<li>พัฒนาสคริปต์ AI  </li>\n<li>ทดสอบบั๊กและปรับบาลานซ์</li>\n</ul>\n\n\n---\n\n\n## Tech & Tools (จากหน้า 8)\n\n<ol>\n<li>เครื่องมือ  </li>\n</ol>\n<ul>\n<li>Unity  </li>\n<li>C#  </li>\n</ul>\n<ol>\n<li>ช่องทางติดต่อ ( Contact Info)  </li>\n</ol>\n<ul>\n<li>s6530611018@phuket.psu.ac.th  </li>\n<li>เบอร์โทรศัพท์  </li>\n</ul>\n<ol>\n<li>เวลาที่พร้อมทำงาน ( Availability)  </li>\n</ol>\n<ul>\n<li>วัน-เวลาที่สะดวก (เช่น จันทร์ –ศุกร์ 09:00–17:00)  </li>\n<li>ประเมินปริมาณงานต่อสัปดาห์ (ชั่วโมง)  </li>\n</ul>\n<ol>\n<li>ความรับผดิ ชอบต่อเป้าหมายหลัก ( Key Deliverables)  </li>\n</ol>\n<ul>\n<li>รายการชิ้นงานหรือมิลสโตนที่ต้องส่งมอบ  </li>\n<li>กำหนดเวลา (Deadline)  </li>\n</ul>\n<ol>\n<li>ความเชื่อมโยงกับหน้าที่อื่น ( Interdependencies)  </li>\n</ol>\n<ul>\n<li>ใครต้องประสานงานด้วย  </li>\n<li>Input/Output ที่ต้องแลกเปลี่ยนระหว่างทีม</li>\n</ul>\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 3) (จากหน้า 9)\n\nGame Artist – Pichayathida  \n<ol>\n<li>ชื่อ-นามสกลุ (Name) ระบุชื่อเต็มของ Game Artist เช่น  </li>\n</ol>\n<ul>\n<li>นาย/นางสาว [ชื่อเต็ม]  </li>\n</ul>\n<ol>\n<li>ตำแหน่ง/บทบาท ( Role) Game Artist  บทบาทหลัก: </li>\n</ol>\nรับผิดชอบในการออกแบบและสร้างงานศิลปะสำหรับเกม เช่น ตัวละคร, ฉาก, วัตถุ, เอฟเฟกต์ ภาพ, \nและการออกแบบ UI/UX เพื่อให้โลกของเกมดูมีชีวิตชีวาและสอดคล้องกับธีมและสไตล์ที่กำหนด  \n<ol>\n<li>หน้าที่และความรับผิดชอบหลัก ( Responsibilities)  </li>\n</ol>\n<ul>\n<li>สร้างและออกแบบตัวละคร, ศัตรู, ฉาก, และวัตถุภายในเกม  </li>\n<li>ออกแบบและสร้าง UI (User Interface) เช่น เมนู, ปุ่ม, และองค์ประกอบอื่นๆ ที่ผู้เล่นสามารถ </li>\n</ul>\nโต้ตอบ  \n<ul>\n<li>ออกแบบและสร้างเอฟเฟกต์ภาพ ( Visual Effects) เช่น การระเบิด, แสง, หรือเอฟเฟกต์ของท่าทาง </li>\n</ul>\nการต่อสู้  \n<ul>\n<li>ร่วมมือกับทีม Game Designer และ Programmer เพื่อให้แน่ใจว่าศิลปะในเกมมีความเข้ากันได้ดี </li>\n</ul>\nกับการเล่น  \n<ul>\n<li>ทำงานกับทีมเพื่อสร้างสไตล์กราฟิกของเกม (เช่น 2 D, 3D, สไตล์การวาด, หรือกราฟิกแบบพิกเซล)  </li>\n<li>ร่วมมือกับทีมพัฒนาเพื่อประสานการปรับปรุงและการทดลองศิลปะตามคำติชมจากทีม  </li>\n<li>ดูแลความถูกตอ้ งของแอสเซ็ตต่างๆ เช่น โมเดล 3 D, เท็กซ์เจอร์, ภาพพื้นหลัง ฯลฯ  </li>\n</ul>\n<ol>\n<li>ทักษะ/ความชำนาญ ( Skills & Expertise)  </li>\n</ol>\n<ul>\n<li>เครื่องมือการออกแบบกราฟิก:   </li>\n</ul>\no 2D Art Tools:  Adobe Photoshop , Illustrator, Clip Studio Paint , Krita\n\n\n---\n\n\n## Systems (ระบบ) (จากหน้า 10)\n\no 3D Art Tools:  Blender, Maya, 3ds Max, ZBrush o \n**Animation Tools**: Spine, Unity Animator , After Effects  o \n**UI Design Tools**: Figma, Sketch, Adobe XD  \n<ul>\n<li>ทักษะการสร้างคอนเซ็ปต์อาร์ต ( Concept Art)   </li>\n<li>การออกแบบและสรา้ งตัวละคร ( Character Design)   </li>\n<li>การสร้างสภาพแวดล้อม ( Environment Design)   </li>\n<li>การสร้างและแก้ไขโมเดล 3 D และเท็กซ์เจอร์ (3 D Modeling & Texturing)   </li>\n<li>การออกแบบและสรา้ งแอนเิ มชัน ( Animation)  </li>\n<li>การออกแบบ UI/UX และการทำงานกบั ระบบอินเตอร์เฟซ   </li>\n<li>การสร้างเอฟเฟกต์ภาพ ( VFX)  </li>\n</ul>\n<ol>\n<li>ช่องทางติดต่อ ( Contact Info)  </li>\n</ol>\n<ul>\n<li>อีเมล: [อีเมล]  </li>\n<li>เบอร์โทรศัพท:์  [เบอร์โทรศัพท์]  </li>\n<li>Slack/Discord ID:  [ID]  </li>\n</ul>\n<ol>\n<li>เวลาที่พร้อมทำงาน ( Availability)  </li>\n</ol>\n<ul>\n<li>วัน-เวลาที่สะดวก (เช่น จันทร์ –ศุกร์ 09:00–17:00)  </li>\n<li>ประเมินชั่วโมงการทำงานต่อสัปดาห์ (เช่น 20 -30 ชั่วโมง/สัปดาห์)  </li>\n</ul>\n<ol>\n<li>ประสบการณ์ที่ผา่ นมา ( Relevant Experience)  </li>\n</ol>\n<ul>\n<li>โปรเจกต์ทผี่ ่านมาที่เกี่ยวข้อง:   </li>\n</ul>\n**o โปรเจกต์ A**: [คำอธิบายสั้นๆ เกี่ยวกับบทบาทในโปรเจกต์] o \n**โปรเจกต์ B**: [คำอธิบายสั้นๆ เกี่ยวกับบทบาทในโปรเจกต์]\n\n\n---\n\n\n## Systems (ระบบ) (ต่อ 2) (จากหน้า 11)\n\n<ul>\n<li>ผลงานที่เกี่ยวข้อง:   </li>\n</ul>\no มีส่วนร่วมในการออกแบบศิลปะในเกมที่สำเร็จ o \nประสบการณ์ในการทำงานร่วมกับทีมพัฒนาเกมในด้านศิลปะ  \n<ol>\n<li>ความรับผดิ ชอบต่อเป้าหมายหลัก ( Key Deliverables)  </li>\n</ol>\n<ul>\n<li>สร้างและออกแบบตัวละคร, สภาพแวดล้อม, เอฟเฟกต์ภาพ, และ UI สำหรับเกม  </li>\n<li>ดูแลและปรับปรุงแอสเซ็ตกราฟิกตามข้อเสนอแนะจากทีมพัฒนา  </li>\n<li>พัฒนาและปรับแต่งโมเดล 3 D และแอนิเมชันที่จำเป็น  </li>\n<li>ออกแบบและปรับแต่ง UI ตามประสบการณ์ผู้เล่นที่ต้องการ  </li>\n</ul>\n<ol>\n<li>ความเชื่อมโยงกับหน้าที่อื่น ( Interdependencies)  </li>\n</ol>\n<ul>\n<li>ต้องประสานงานกับ:   </li>\n</ul>\n**o Game Designer**: เพื่อให้แน่ใจว่าองค์ประกอบกราฟิกทั้งหมดมีความสอดคล้องกับกลไก \n**และระบบของเกม  \no Programmer**: เพื่อให้การทำงานร่วมกันระหว่างกราฟิกและการเล่นของเกมเป็นไปได้อย่าง ราบรื่น  \n**o Sound Designer**: เพื่อให้แน่ใจว่าเอฟเฟกต์เสียงและภาพทำงานร่วมกันได้ดี o QA \n**Tester**: เพื่อทดสอบกราฟิกในบริบทต่างๆ ของเกม  \n<ul>\n<li>Input/Output ที่ต้องแลกเปลยี่ น:   </li>\n</ul>\n**o Input**: คำแนะนำจากทีมพัฒนาและการทดสอบของผู้เล่น o Output: \nแอสเซ็ตกราฟิกที่เสร็จสมบูรณ์และพร้อมใช้งานในเกม\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 4) (จากหน้า 12)\n\nGame Setting  \nstory  \nLocations Floor \n1 Silverleaf Village  \nหมู่บ้านเล็กๆ ที่ยังคงเหลือซงึ่ แสงแห่งความหวังในโลกที่ล่มสลาย ผู้คนที่นี่อาศัยอยู่ด้วยความพยายาม  \nและศรัทธาในการเยียวยาโลกอีกครั้ง ภายในหมู่บ้านมีร้านค้าสำหรับแลกเปลี่ยนวัตถุดิบ อัปเกรดอาวุธ และ \nศูนย์กลางข้อมูลการเดินทาง ผู้เฒ่าอารอน ซิลเวอร์ลีฟ ไดค้ ้นพบความลับของ “เมนูศักดิ์สิทธิ์” \nที่จะช่วยชำระพลังมืดจากโลก และ วัตถุดิบหลักคือ “เนื้ออาร์ดัส” ซึ่งอยู่ ลึกสุดในถ้ำเอเลเนีย  \nที่นี่เป็นจุดเริ่มต้นของไลออน เด็กหนุ่มผู้มีพรสวรรค์ในการทำอาหาร และกำลังจะเริ่มต้นภารกิจเปลี่ยนโลกด้วย \nพลังของ \"รสชาติ\"  \nLevel 1: Floor 1 Silverleaf Village  ตัวเอก ไลออน \nเป็นเด็กที่เกิดขึ้นมาหลังโลกล่มสลายเขาได้อาศัยอยู่ใน  หมู่บ้านซิลเวอรล์  ีฟ หมู่บ้าน เล็ก ๆ \nที่ยังคงปลอดภัยจากพลังมืดที่แพรก่ ระจายไปทั่วโลก ที่นั่น เขาได้พบกับ  ผู้เฒ่า Elder ผู้นำของหมู่บ้าน \nซึ่งเปิดเผยความจริงเกี่ยวกับพลังชั่วร้าย และมอบหมายภารกิจสำคัญให้ไลออน เพื่อฟื้นฟูสมดุลของโลก  \n\nFloor 2 Stone Golem  \n ดินแดนแห่งหินและแรงสั่นสะเทือน  \nเมื่อไลออนก้าวเข้าสู่ถ้ำเอเลเนีย สิ่งแรกที่เขาเผชิญคือชั้นที่ปกคลุมด้วยหินเก่าและแร่พลังงานแปลกประหลาด \nดินแดนนี้เต็มไปด้วยมอนสเตอร์ธาตุหินที่แข็งแกร่งและทนทาน เช่น Star (สตาร์) ทีมีความแข็งแกร่ง และ  \nNone (นัน) มอนสเตอร์ไม่มีธาตุที่อ่อนแอแต่มีเยอะจนน่ารำคาญ มินิบอส: \nMeteor (มิเทอร์)  \nโกเล็มยักษ์ที่เกดิ จากหินอุกกาบาตซึ่งดูดซับพลังเวทจากอดีตของอิกนาร์ทิส การโจมตีของมันช้าแต่รุนแรง \nและ สามารถสั่นสะเทือนพื้นดินจนทำให้ผู้บุกรุกเสียหลัก การเอาชนะมิเทอร์ต้องอาศัยไหวพริบ  \nLevel 2: Floor 2 Stone Golem\n\n\n---\n\n\n## Enemies & Bosses (ศัตรู & บอส) (จากหน้า 13)\n\nหลังได้รับภารกิจจาก ผู้เฒ่า Elder ไลออนต้องออกจากหมู่บ้านซิลเวอร์ลีฟเป็นครั้งแรก เขาเดินทางสู่ \nทางเข้าของ “ถ้ำเอเลเนีย” ดันเจี้ยนลึกลับที่ถูกพลังมืดกลืนกิน  \nชั้นแรกของถ้ำพาเขาเข้าสู่ \" Stone Golem \" พื้นที่ลึกใต้ภูเขาที่เต็มไปด้วยหินผลึก เรืองแสง และซากอารย \nธรรมโบราณที่ถูกหลงลืม  \nที่นี่ ไลออนต้องเผชิญหน้ากับ \" Star\" มอนสเตอร์ที่คอยขวาง และ \" Meteor\" มินิบอสยักษ์ที่ปกป้องทางลงสู่ชั้น \nถัดไป เพื่อเอาชีวิตรอด ไลออนต้องใช้ทักษะการต่อสู้ร่วมกับการปรุงอาหารจากสมุนไพรที่หาได้ในพื้นที่ เพื่อฟื้น \nพลังและเพิ่มสถานะ ก่อนจะท้าทายศัตรูสุดโหดของชั้ นนี้  \n\nFloor 3 Blaze Zone อาณาเขตแห่งไฟและความโกลาหล  \nแสงสีแดงส้มสะท้อนอยู่ตลอดผนังถ้ำ ลาวาและไอน้ำร้อนพวยพุ่งในทุกฝีก้าว ไฟไม่เพียงเผาไหม้ทุกสิ่ง แต่ยัง \nแทรกซึมเข้าไปในใจของสิ่งมชี ีวิต ทำให้พวกมันคลั่งเกินควบคุม มอนสเตอร์ในชั้นนี้ได้แก่ Light (ไลท์) \nมังกรไฟขนาดเล็กที่โจมตีด้วยเปลวเพลิง และ None (นัน) มอนสเตอร์ไม่ มีธาตุที่โดนไฟกลืนกินจนบ้าคลั่ง \n**มินิบอส**: Blazer (เบลสเซอร์)  \nสัตว์ร้ายครึ่งมนุษย์ครึ่งอัคคี ผู้ควบคุมเปลวเพลิงได้ตามใจนึก ไลออนต้องใช้พลังของสมุนไพรเย็นที่พบในชั้น \nก่อนหน้าเพื่อต้านทานความร้อนและเปิดโอกาสในการโจมตี Level 3: Floor 3 Blaze Zone   \nหลังเอาชนะมินิบอสแห่งชั้นหิน ไลออนดำดิ่งสู่ชั้นถัดไป ซึ่งต่างจากก่อนหน้าโดยสิ้นเชิง — Blaze \nZone คืออาณาเขตแห่งไฟและความโกลาหล  \nแสงแดงส้มสะท้อนตามผนังถ้ำ ลาวาเดือดพวยพุ่งในทุกฝีก้าว ไอร้อนแทรกซึมเข้าทั้งกายและจิตใจ ในพื้นที่นี้ \nไฟไม่ได้แค่เผาไหม ้ แต่ยังปลุกความบ้าคลั่งให้สงิ่ มีชีวิต  \n**มอนสเตอร์ประจำชั้น ได้แก่**: - Light – มังกรไฟขนาดเล็ก ปราดเปรียว โจมตีด้วยลมหายใจเพลิง  \n<ul>\n<li>None – สิ่งมชี ีวิตไร้ธาตุที่ถูกไฟกลืนกินจนไร้สติ มินิบอส: Blazer </li>\n</ul>\n(เบลสเซอร์)  \nอสูรร่างครึ่งคนครึ่งเปลวเพลิง ที่ควบคุมไฟได้ตามใจคิด  \nไลออนต้องใช้สมุนไพรเย็นจากชั้นก่อนหน้าในการปรุงอาหารเพื่อลดผลกระทบจากอุณหภูมิและสรา้ งโอกาส \nโจมตีสวนกลับ  \nการเอาชนะเบลสเซอร์ไม่ใช่แค่การชิงชัยด้วยกำลัง แต่ต้องใช้ความเข้าใจในวัตถุดิบและจังหวะอย่างแท้จริง\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 5) (จากหน้า 14)\n\nFloor 4 Heart of the Alenia ศูนย์กลางแห่งพลังมืดและบทสรุปของตำนาน  \nชั้นสุดท้ายของถ้ำ ลึกเกินกว่าจะวัดได้ ดินแดนนี้ถูกปกคลมุ ด้วยเงาแห่งอดีตและเสียงกระซิบจากวิญญาณที่ล้ม \nตาย ที่ใจกลางมีพลังเวทที่ยังคงหลงเหลือจากการทดลองของอัซมารอส ความจริงบางอย่างกำลังรอไลออนอยู่ \n**ที่นี่  \nบิ๊กบอส**: Rdus (อาร์ดัส) สัตว์ร้ายที่เกิดจากการทดลองที่ผิดพลาด มนั ไม่ใช่เพียงแค่สัตว์กลายพันธุ์ \nแต่คือ “เครื่องทดลองที่มีชีวิต” ร่าง ของอาร์ดัสเต็มไปด้วยพลังเวทไฟและแรห่ ินที่แปรปรวน มนั \nทั้งปกป้องและทุกข์ทรมานกบั พลังในตัวเอง ไลออ นต้องไม่เพียงแค่เอาชนะมั น แต่ต้อง “เข้าใจมัน” \nเพื่อดึงเนื้ออาร์ดัสบริสุทธิ์ออกมาสำหรับเมนูศักดิ์สิทธิ์ Level 4: Floor 4 Heart of the Alenia  \nศูนย์กลางแห่งพลังมืด และบทสรุปของตำนาน นี่คือชั้นสุดท้ายของถ้ำเอเลเนีย — \nลึกเกินกว่าจะมีแสงธรรมชาติส่องถึง  \nทุกก้าวที่เดิน ลมหายใจของอดีตและพลังแห่งคำสาปยังคงล่องลอยอยู่  \nเศษซากของเวทมนตร์ต้องห้ามยังคงรบกวนจิตใจ  \nเสียงกระซิบจากวิญญาณผลู้ ้มตายสะท้อนก้อง สื่อสารถึงความทรมานที่ไมม่ ีใครได้ยินนานนับศตวรรษ \nณ ใจกลางของความมืด Rdus (อาร์ดัส)  บิ๊กบอสสุดท้าย ปรากฏตัว  \nมันคือผลลัพธ์จากการทดลองที่ผิดพลาดของจอมเวทอัซมารอส ร่างของมันคือการรวมกันของเวทไฟและแร่หิน \nวิปลาส แข็งแกร่ง ดุดัน และเต็มไปด้วยความเจ็บปวด มันมิได้มีเพียงร่างกาย… แต่วิญญาณของมันยงั โหยหา \nการปลดปล่อย ไลออนไม่อาจเอาชนะอาร์ดัสได้ด้วยการฟาดฟันเพียงอย่างเดียว  เขาต้อง “เข้าใจ” \nธาตุแท้ของมัน  \nใช้สัมผัสแห่งวตั ถุดิบเพื่อหาจุดสมดุลระหว่างรสชาติแห่งชีวิตและความเจ็บปวด แล้วดึง “เนื้ออาร์ดัสบริสุทธิ์” \nออกมา วัตถุดิบสุดท้ายของเมนูศักดิ์สิทธิ์ เพื่อปรุงอาหารที่จะเปลี่ยนโลกนี้กลับไปสู่ความสมดุลอีกครงั้ \nBackstory  \nหลายร้อยปีก่อน โลกของ เอเลเนีย เคยรุ่งเรอื งและอุดมสมบูรณ์ด้วยพลังแห่งธรรมชาติ โดยเฉพาะ \nดินแดนศักดิ์สิทธิ์ที่ชื่อว่า “อิกนาร์ทิส” ซึ่งเป็นศูนย์กลางของพลังชีวิตและวัตถุดิบล้ำค่า ชนเผ่าและผู้คนจากทั่ว \nสารทิศต่างหลั่งไหลมาเพื่อนำวัตถุดิบเหล่านี้ไปใช้ในการปรุงยา รักษาโรค และเสริมพลังเวท \nแต่ทุกสิ่งกลับเปลี่ยนไปเมื่อชายผู้หนึ่งนามว่า “อัซมารอส” ปรากฏตัว เขาเคยเป็นนักปราชญ์ผู้เปี่ยมด้วย \nความรู้เวทมนตร์ แต่หลงใหลในแนวคิดสุดโต่งที่เชื่อว่า \"มนุษย์ควรเทียบเท่าทวยเทพ\" เพื่อบรรลุจุดนั้น เขาจึง \nทดลองเวทมนตร์ต้องห้ามเพื่ อตามหา “อาหารแห่งพระเจ้า” เมนใู นตำนานที่จะมอบพลังไร้ขีดจำกัดให้ผู้ที่กิน\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 6) (จากหน้า 15)\n\nมัน การทดลองครั้งนั้นใช้วัตถุดิบต้องคำสาปมากมาย และมันได้สร้างผลกระทบร้ายแรง \nพลังมืดที่ไม่อาจควบคุมได้ ได้แทรกซึมลงไปในผืนดิน นำ้ อากาศ และสิ่งมีชีวิต \nดินแดนอิกนาร์ทิสกลายเป็นแหลง่ พลังชั่วร้าย สัตว์พืช กลายพันธุ์ คนล้มตาย และธรรมชาติล่มสลาย \nแม้ว่าหลายประเ ทศจะร่วมมือกันผนึกตัวอัซมารอสได้ในที่สุด แต่ผลจากเวทต้องห้ามของเขายังคงแพร่กระจาย \nอย่างต่อเนื่อง ไม่มีใครหยุดยั้งมันได้ โลกเริ่มแหลกสลาย ผู้คนต้องอพยพลงใต้ดินเพื่อความอยู่รอด และนั่นคือ \nจุดเริ่มต้นของ หมู่บ้านซิลเวอร์ลีฟ  หนึ่งในที่หลบภัยสุดทา้ ยของมนุษย์ ห ลายชั่วอายุคนผ่านไป \nผู้เฒ่าแห่งหมู่บ้านซลิ เวอร์ลีฟได้ค้นพบเอกสารโบราณที่กล่าวถึง “เมนู ศักดิ์สิทธิ์”  \nซึ่งสามารถชำระล้างพลังมืดและฟื้นฟูสมดุลให้กับเอเลเนียได้ แต่ในการทำเมนูนั้น จำเป็นต้องใช้ \nวัตถุดิบพิเศษที่สุด “เนื้ออาร์ดัส” จากสัตว์กลายพันธุ์ระดับสูงในส่วนลึกของถ้ำเอเลเนีย จากตำนาน \nกลายเป็นภารกิจ  \nจากความหวังริบหรี่ กลายเปน็ โอกาสครั้งสุดท้าย นี่คือจุดเริ่มต้นของเรื่องราวของ ไลออน เดก็ \nหนุ่มเชฟผู้แบกรับชะตาของโลก ด้วยมีดทำครัวในมือ และหัวใจที่ เชื่อในพลังของอาหาร  \n\n\nKey plot elements  \nโลกที่ล่มสลาย  \nโลกเอเลเนียเคยอุดมสมบูรณ์ด้วยพลังธรรมชาติ แต่ปัจจุบันกลับถูกพลังมืดกัดกินอย่างช้าๆ  \nการทดลองเวทมนตร์ของ “อัซมารอส” ได้สร้างคำสาปที่แพร่กระจายไม่หยุด จอมเวทต้องสาป อัซมารอส  \nตัวการสำคัญทจี่ ุดชนวนภัยพิบัติของโลก ด้วยความทะเยอทะยานสร้าง “อาหารแห่งพระเจ้า”  \nแม้จะถูกผนึกแล้ว แต่พลังของเขายังหลงเหลือและเปลี่ยนแปลงธรรมชาติ  \nElder แห่งหมู่บู้านซิลเวอร์ลีฟ  \nผู้นำทางภูมิปัญญา ผู้ค้นพบตำนาน \"เมนูศักดิ์สิทธิ์\" ที่เป็นทางรอดสุดท้ายของโลก  \nเป็นคนที่มอบภารกิจให้ไลออนออกเดินทาง ไลออน   \nเด็กหนุ่มผู้มีพรสวรรค์ด้านการทำอาหาร และ“สัมผัสแห่งวัตถุดิบ” ที่ช่วยให้เขาเข้าใจคุณสมบัติ\nลึกซึ้งของวัตถุดิบเขาคือความหวังสุดท้ายในการปรุงเมนูที่จะชำระล้างโลก ถ้ำเอเลเนีย  \nดันเจี้ยนที่แบ่งออกเป็น 4 ชั้น แต่ละชั้นสะท ้อนพลังของธรรมชาติที่ผิดเพี้ยน\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 7) (จากหน้า 16)\n\n<ul>\n<li>มีมอนสเตอร์กลายพันธุ์, มินิบอส และสุดท ้ายคือ บอสใหญ่ Rdus </li>\n</ul>\nซึ่งเป็นวัตถุดิบหลักของเมนู เนื้ออาร์ดัสวัตถุดิบศักดิ์สิทธิ์ที่หาได้เพียงหนึ่งเดียว และต้องได้มาด้วยความ\nกล้าหาญและความเข ้าใจในธรรมชาติ  \n<ul>\n<li>ไม่ใช่เพียงแค่ “เอาชนะ” แต่ต้อง “เข้าถึงหัวใจ” ของอาร์ดัสเพื่อดึงเนื้อที่บริสุทธิ์ที่สุดออกมา  </li>\n</ul>\nเมนูศักดิ์สิทธิ์  \n<ul>\n<li>อาหารที่สามารถฟื้นฟูสมดุลของโลก และขจัดพลังมืดของอัซมารอสออกไปจากเอเลเนีย จะถูกปรุงขึ้นเ</li>\n</ul>\nมื่อไลออนกลับจากการเดินทาง พร้อมวัตถุดิบที่ได้จากทั้ง 4 ชั้น  \nการต่อสู้ + การปรุงอาหาร  \n<ul>\n<li>เกมเพลย์ผสมการต่อสู้กับมอนสเตอร์ในสไตล์ Action RPG กับการรวบรวมวัตถุดิบเพื่อใช้ในการ </li>\n</ul>\nคราฟต์เมนูพิเศษ  \n<ul>\n<li>การทำอาหารไม่ใช่แค่เรื่องรสชาติ แต่คือการเยียวยาโลก</li>\n</ul>\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 8) (จากหน้า 17)\n\nCharacters  \nMain Characters Lion – Backstory  \nไลออนเกิดและเติบโตในหมู่บ้านซิลเวอร์ลฟี หนึ่งในสถานที่ปลอดภัยไม่กี่แห่งที่เหลืออยู่หลังจากโลก  \nถูกพลังมืดกลืนกิน เขาเติบโตมาในครอบครัวของช่างทำอาหารพื้นบ้าน และเรียนรู้การใช้วัตถุดิบจากธรรมชาติ \nอย่างลึกซึ้ง ตั้งแต่ยังเด็ก เขาแสดงความสามารถแปลกประหลาดที่ทำให้เขาสามารถรับรู้พลังและสภาวะของ \nวัตถุดิบได้ เอลเดอร์ของหมู่บ้านจึงเชื่อว่าเขาเป็น \"ผู้ถูกเลอื ก\" ที่จะคืนสมดุลให้กับโลก \nการเดินทางของไลออนเริ่มต้นขึ้นเมื่อเอลเดอร์มอบหมายภารกิจสำคัญให้เขาออกเดินทางไปยังถ้ำเอเล เนีย \nเพื่อนำเนื้ออาร์ดัสมาใช้ในการปรุง เมนูศักดิ์สิทธิ์ เมนูเดียวที่จะขจัดพลังมืดและฟื้นฟูเอเลเนียได้อีกครั้ง \nPersonality  \n<ol>\n<li>อ่อนโยนและเห็นใจ: ไลออนมักมองเห็นคุณค่าในสิ่งเล็กๆ แม้กระทั่งวัตถุดิบที่คนอื่นมองข้าม  </li>\n<li>มุ่งมั่นแต่ถ่อมตวั: เขาไม่คิดว่าตัวเองเป็น “ผู้กอบกู้” แต่พรอ้ มจะทำหน้าที่ของตนให้ดีที่สุด  </li>\n<li>ช่างสังเกตและมีจิตใจละเอียดอ่อน: เขาเข้าใจรสชาติ ความรู้สึก และพลงั ของสิ่งต่างๆ ได้ลึกซึ้ง  </li>\n<li>เชื่อมั่นในพลังของอาหาร: เขาเชื่อว่าอาหารไม่เพียงเติมเต็มท้อง แต่ยังเติมเต็มใจและโลกได้  </li>\n</ol>\n**Appearance เพศ**: ชาย อายุ: 17–18 ปี รูปร่าง: สูงเพรียว กระฉับกระเฉง ผม: สีน้ำตาลไหม้ \nปลายยุ่งเลก็ น้อยเหมือนเชฟที่เพิ่งออกจากครัว ตา: สีน้ำตาลประกายทอง \n**สื่อถึงสัมผัสวัตถดุ ิบ ชุดประจำตัว**: เสื้อคลุมแบบผสมผสานกับชุดนักผจญภัย \nมีซองเก็บมีดทำครัวอยู่ข้างเอว สัญลักษณ์เฉพาะตัว : ผ้าผูกหัวที่ได้รับจากแม่ \nและมีดทำครัวสืบทอดจากพ่อ  \nSpecial abilities 1. สัมผัสแห่งวัตถุดิบ ( Ingredient Sense)  \n<ul>\n<li>รับรู้ความบริสุทธิ์ พลังเวท และเงื่อนไขการใช้วัตถุดิบให้เกิดประสิทธิภาพสูงสุด  </li>\n<li>ตรวจจับวัตถุดิบลับที่ผู้เล่นทั่วไปหาไม่เจอ</li>\n</ul>\n\n\n---\n\n\n## 2. Alchemy Cook ( ปรุงเพื่อเสริมพลัง) (จากหน้า 18)\n\n<ol>\n<li>Alchemy Cook ( ปรุงเพื่อเสริมพลัง)  </li>\n</ol>\n<ul>\n<li>ปรุงอาหารระหว่างการผจญภัย เพื่อบัฟค่าต่อสู้ ฟื้นพลัง หรือสร้างสถานะพิเศษ  </li>\n<li>อาหารบางชนิดสามารถใช้ “ปลุกความทรงจำ” ของมอนสเตอร์ ทำให้เกิดทางเลือกใหม่ เช่น การ </li>\n</ul>\nเจรจา แทนการต่อสู้  \n<ol>\n<li>Culinary Combat ( การต่อสู้ด้วยศาสตร์การทำอาหาร)  </li>\n</ol>\n<ul>\n<li>ใช้อุปกรณ์ทำอาหารเป็นอาวุธ เช่น มีดทำครวั แบบสั้น -เร็ว, กระทะไฟร้อนแรง, ขวดปรุงรสสร้างม่าน </li>\n</ul>\nหมอก  \n<ul>\n<li>สกิลพิเศษคือ “ Cooking Combo” ซึ่งผสมการฟันและการปรุงชั่วขณะเพื่อสร้างความเสียหายเวท </li>\n</ul>\nผสมสถานะ  \n\nNPCs  \nGeorge Blacksmith ( จอรจ์ แบล็คสมิธ) - พ่อค้าแลกเปลี่ยนสมนุ ไพรและวัตถุดิบธรรมชาติ บทบาท:  \n<ul>\n<li>ตั้งร้านอยู่ที่หมู่บ้านซิลเวอร์ลฟี  </li>\n<li>แลกเปลี่ยนสมุนไพร, เห็ด, วัตถุดิบจากมอนสเตอร์ หรือพืชกลายพันธุ์  </li>\n<li>ให้ข้อมูลเชิงลกึ เกี่ยวกับการใช้วัตถุดิบเพื่อรักษา หรือปรุงอาหารบางประเภท  </li>\n<li>มีเควสย่อยให้ไลออนออกหา \"พืชพิเศษ\" ตามฤดูกาลหรือสภาพดันเจี้ยน บุคลิก:  </li>\n<li>ใจดี อารมณ์ขนั ขี้แซว แต่เกง่ เรื่องสมุนไพรขั้นเทพ  </li>\n<li>เคยเป็นนักเดินทางมาก่อน แต่ตอนนี้เปิดร้านเพราะขาเจ็บจากการต่อสู้กับมอนสเตอร์ </li>\n</ul>\n**คำพูดประจำตัว**: “ของขมหน่อย แต่รักษาได้แม้แต่ใจที่เหนื่อยล้า!”\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 9) (จากหน้า 19)\n\nJack Whitesmith ( แจ็ค ไวท์สมิธ) – พ่อค้าอัปเกรดอาวุธ บทบาท:  \n<ul>\n<li>ช่วยอัปเกรดอาวุธของไลออน เช่น มีดทำครัว กระทะไฟ เครื่องปรุงเวท  </li>\n<li>เพิ่มค่าสถานะพิเศษ หรือเปิดท่าโจมตีใหม่  </li>\n<li>ใช้วัตถุดิบจากมอนสเตอร์ + แร่พิเศษที่ได้จากดันเจี้ยนแต่ละชั้น  </li>\n<li>ให้ไอเท็มคราฟต์ระดับสูงสำหรับสายต่อสู้ บุคลิก:  </li>\n<li>ขรึม พูดน้อย ตรงไปตรงมา  </li>\n<li>เป็นอดีตทหารหลวงที่ผันตัวมาเป็นช่างเหล็กเพื่อหลีกหนีสงคราม  </li>\n<li>แอบห่วงไลออนเหมือนน้องชาย คำพูดประจำตัว:  </li>\n</ul>\n“คมของมีดไม่สำคัญเท่ามือท ี่ถือมัน... แต่ขัดไว้ก็ไม่เสียหาย”  \n\nElder (แอลเดอร์) - ผู้นำแห่งหมู่บ้านซิลเวอร์ลีฟ และผู้มอบภารกิจหลัก บทบาท:  \n<ul>\n<li>ผู้เปิดเผยความจริงเบื้องหลังคำสาปและ “เมนูศักดิ์สิทธิ์”  </li>\n<li>เป็นคนส่งไลออนออกผจญภัย และคอยแนะนำเมื่อกลับจากดันเจี้ยน  </li>\n<li>อัปเดตเรื่องราวหลัก ( Main Quest Progress)  </li>\n<li>มีบทพูดที่ชี้แนะเชิงปรัชญาและจรรยาบรรณของเชฟผู้เยียวยา บุคลิก:  </li>\n<li>ฉลาด ลึกซึ้ง นมุ่ นวล  </li>\n<li>เปรียบเสมือนพ่อคนที่สองของไลออน  </li>\n<li>มีอดีตลึกลับกับอัซมารอส และเคยเห็นโลกในยุคก่อนล่มสลาย คำพูดประจำตัว:  </li>\n</ul>\n“อาหารที่แท้จริง... คือสิ่งที่หล่อเลี้ยงทั้งร่างกายและจิตวิญญาณ”\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 10) (จากหน้า 20)\n\nMonsters None \nนัน  \n<ul>\n<li>ประเภท: ไม่มีธาตุ  </li>\n<li>ต้นกำเนิด: เคยเป็นสัตว์ป่าหรือสิ่งมีชีวิตทั่วไปที่อาศัยในโลกธรรมชาติ  </li>\n<li>ผลกระทบจากพลังมืด:  โดน “กลืนกิน” จนสูญเสียสัญชาตญาณพื้นฐาน กลายเป็นสิ่งมีชีวิตที่ไม่มี </li>\n</ul>\nจุดมุ่งหมาย นอกจากการทำลายทุกสิ่งที่เคลื่อนไหว  \n<ul>\n<li>รูปลักษณ:์ เปน็ สัตว์ 4 ขา   </li>\n<li>ลักษณะการโจมตี:  ดุร้าย รวดเร็ว คาดเดาไม่ได้ พฤติกรรมเหมือนสิ่งมีชวี ิตที่กำลังเจ็บปวดอยู่ </li>\n</ul>\nตลอดเวลา  \n<ul>\n<li>จุดเด่น:  </li>\n</ul>\no แรงโจมตีสูงแต่ไร้แบบแผน o \nยิ่งอยู่ใกล้พลังมืดมาก ยิ่งแข็งแกร่งและบ้าคลั่ง บทบาทในเกม:  \n<ul>\n<li>ความท้าทาย: ผู้เล่นต้องปรับกลยุทธ์ ในการต่อสู้  </li>\n<li>เชิงเนื้อเรื่อง: สื่อถึงผลของการทดลองที่ล้มเหลวและธรรมชาติที่ถูกบิดเบือนโดยเวทต้องสาป  </li>\n<li>แนวคิด: \"None\" แสดงถึงสงิ่ มีชีวิตที่สูญเสียทุกสิ่ง —แม้แต่ตัวตน  </li>\n</ul>\n4 Action หลักของมอนสเตอร์  \n<ol>\n<li>Idle (ยืนนิ่ง):  </li>\n</ol>\no ยืนในตำแหน่งเดิม เคลื่อนไหวน้อยมาก o สลับท่าทาง เช่น \nขยับหัว หายใจแรง ดูรอบๆ อย่างระแวง\n\n\n---\n\n\n## Mechanics (ระบบการเล่น) (ต่อ 4) (จากหน้า 21)\n\n<ol>\n<li>Walk (เดิน):  </li>\n</ol>\no เดินช้า ๆ มุ่งหน้าเข้าหาผู้เล่นเมื่ออยู่ในระยะตรวจจับ  \n<ol>\n<li>Hit (โจมตี):  </li>\n</ol>\no ใช้ท่าต่อยหรือกัดแบบรวดเร็วเมื่อเข้าใกล้ผู้เล่น o \nมีเสียงคำรามตอนโจมตีเพื่อเพิ่มแรงกดดัน  \n<ol>\n<li>Dead (ตาย):  </li>\n</ol>\no ทรุดตัวลงอย่างรุนแรง สลายร่างด้วยเงามืด o \nอาจปล่อยของดรอป (เช่น สมุนไพรเน่า, \nชิ้นส่วนเวทตกค้าง)  \n**รูปแบบการเคลื่อนที่**: Chase Player  \n<ul>\n<li>AI เคลื่อนที่โดยมีพฤติกรรมดงั นี้: o ตรวจจับผู้เลน่ :  </li>\n</ul>\nเมื่อผู้เล่นเข้าใกล้ในระยะตรวจจับ o วิ่งไล่: \n**เดินตรงเข้าหาผู้เล่น o เข้าโจมตี**: หากอยู่ในระยะประชิด จะเปลี่ยนเป็นโหมด Hit o \n**หยุดไล่**: หากผู้เล่นวิ่งหนีเกินระยะจะยืน Idle ต่อ  \nMechanic ของมอนสเตอร์  \n<ul>\n<li>ประเภทการโจมตี:  Melee Attack o โจมตีด้วยการ ตอ่ </li>\n</ul>\nย หรอื กัด o มีคูลดาวน์เล็กน้อยระหว่างการโจมตี\n\n\n---\n\n\n## AI & Encounters (จากหน้า 22)\n\nStar สตาร์  \n<ul>\n<li>ประเภท: มอนสเตอร์ธาตุหิน  </li>\n<li>แหล่งที่พบ: ชนั้ ที่ 2 – Stone Golem Domain  </li>\n<li>ต้นกำเนิด: หนิ ศักดิ์สิทธิ์จากภูเขาแห่งความสมดุลที่ถูกพลังมืดของอิกนาร์ทิสแทรกซึม  </li>\n<li>รูปลักษณ:์ o ร่างกายเป็นก้อนหินกลมใหญ่คล้ายดาวเคราะห์ขนาดเล็ก o </li>\n</ul>\nพื้นผิวแตกเป็นลายเรืองแสงคล้ายเส้นพลังเวท  \n<ul>\n<li>ลักษณะพิเศษ:  o มีเยอะจนน่าหงุดหงิด  </li>\n<li>จุดอ่อน:  </li>\n</ul>\no มีการโจมตีที่ช้า o \n**มีความเชื่องช้า บทบาทในเกม**: - การต่อสู้: ผู้เล่นต้องหลบโจมตี  \n<ul>\n<li>กลยุทธ์:  </li>\n</ul>\nใช้สมุนไพรที่เพิ่มเลือดเพื่อเอาตัวรอด  \n<ul>\n<li>เชิงสัญลักษณ:์   </li>\n</ul>\nStar แสดงถึง \"พลังธรรมชาติที่ถูกควบคุม\" และสิ่งศักดิ์สิทธิ์ที่ถูกบิดเบือนโดยเวทมนตร์ต้องสาป  \n4 Action หลักของมอนสเตอร์  \n<ol>\n<li>Idle (ยืนนิ่ง):  </li>\n</ol>\no ยืนในตำแหน่งเดิม เคลื่อนไหวน้อยมาก  \no สลับท่าทาง เช่น ขยับหัว หายใจแรง ดูรอบๆ อย่างระแวง  \n<ol>\n<li>Walk (เดิน):</li>\n</ol>\n\n\n---\n\n\n## Mechanics (ระบบการเล่น) (ต่อ 5) (จากหน้า 23)\n\no เดินช้า ๆ มุ่งหน้าเข้าหาผู้เล่นเมื่ออยู่ในระยะตรวจจับ o \nเคลื่อนไหวแบบเซ ๆ บ่งบอกถึงสภาพร่างกายที่ไม่สมบูรณ์  \n<ol>\n<li>Hit (โจมตี):  </li>\n</ol>\no ใช้ท่าต่อยหรือกัดแบบรวดเร็วเมื่อเข้าใกล้ผู้เล่น o \nมีเสียงคำรามตอนโจมตีเพื่อเพิ่มแรงกดดัน  \n<ol>\n<li>Dead (ตาย):  </li>\n</ol>\no ทรุดตัวลงอย่างรุนแรง สลายร่างด้วยเงามืด o \nอาจปล่อยของดรอป (เช่น สมุนไพรเน่า, \nชิ้นส่วนเวทตกค้าง)  \n**รูปแบบการเคลื่อนที่**: Chase Player  \n<ul>\n<li>AI เคลื่อนที่โดยมีพฤติกรรมดงั นี้: o ตรวจจับผู้เลน่ :  เมื่อผู้เล่นเข้าใกล้ในระยะตรวจจับ o </li>\n</ul>\n**วิ่งไล่**: เดินตรงเข้าหาผู้เล่น o เข้าโจมตี: หากอยู่ในระยะประชิด จะเปลี่ยนเป็นโหมด Hit o หยุดไล่: \nหากผู้เล่นวิ่งหนีเกินระยะจะยืน Idle ต่อ  \nMechanic ของมอนสเตอร์  \n<ul>\n<li>ประเภทการโจมตี:  Melee Attack o โจมตีด้วยการ ตอ่ ย หรอื กัด o </li>\n</ul>\nมีคูลดาวน์เล็กน้อยระหว่างการโจมตี Meteor มิเทอร์  \n“หินฟ้าที่ตกลงมาเพื่อนำทาง…หรือทำลาย?”  \n<ul>\n<li>ประเภท: มินิบอส / ธาตุหิน  </li>\n<li>ชั้นที่พบ: ชั้นที่ 2 – Stone Golem  </li>\n<li>บทบาท: ผู้พิทกั ษ์ประตูทางลงสู่ชั้นที่ 3 ลักษณะภายนอก:</li>\n</ul>\n\n\n---\n\n\n## Mechanics (ระบบการเล่น) (ต่อ 6) (จากหน้า 24)\n\n<ul>\n<li>ร่างกายใหญ่โตมหึมา รูปร่างคล้ายยักษ์หิน  </li>\n<li>พื้นผิวเป็นหินดำผสมแร่เรืองแสงสีแดงคล้ายอุกกาบาต  </li>\n<li>ดวงตาเดียวตรงกลางหัวเปล่งแสงสีส้มราวกับลาวาที่กำลังเดือด ความสามารถพิเศษ:  </li>\n<li>Meteor Slam: กระโดดทบุ พื้นจนเกิดแรงสั่นสะเทือน  </li>\n<li>มีการโจมตีที่รนุ แรง  </li>\n<li>มีการป้องกันที่สูง กลยุทธ์การต่อสู้:  </li>\n<li>การโจมตีและการเคลื่อนไหวช้า บทบาทเชิงเนื้อเรื่อง:  </li>\n<li>Meteor ถูกสร้างขึ้นโดยพลังเวทของอัซมารอสจากอุกกาบาตจริงที่ตกสู่ดินแดนอิกนาร์ทิส  </li>\n<li>มันไม่ใช่เพียงเครื่องป้องกันดันเจี้ยน แต่เป็นตัวแทนของ </li>\n</ul>\n“การทดสอบความแข็งแกร่งของจิตใจ”  \n<ul>\n<li>ไลออนต้องใช้มากกว่ากำลัง — ต้องอาศัยความอดทนในการเอาชนะมัน Attack Mechanic  </li>\n<li>Melee Attack – โจมตีระยะประชิดด้วยหมัดหนัก  </li>\n<li>AoE Attack – กระแทกพื้น ทำให้เกิดแรงสนั่ สะเทือนเป็นวงกว้าง 5 Action  </li>\n<li>Idle – ยืนนิ่งพร้อมขยับเล็กน้อย  </li>\n<li>Walk – เดินเข้าหาผู้เล่น  </li>\n<li>Run – วิ่งเมื่อเข้าใกล้  </li>\n<li>Hit – ใช้การโจมตี Melee หรือ AoE  </li>\n<li>Dead – ล้มลงและระเบิดพลังเวทสุดท้าย  </li>\n</ul>\n**Movement Type**: Chase Player  \n<ul>\n<li>ตรวจจับผู้เล่นในระยะ → เดิน/วิ่งเข้าใกล้  </li>\n<li>เมื่ออยู่ในระยะประชิด → สุ่มใช้ Melee หรือ AoE  </li>\n<li>หากผู้เล่นถอยออกนอกระยะ → บอสหยุดไล่</li>\n</ul>\n\n\n---\n\n\n## ส่วนที่ 25 (จากหน้า 25)\n\n\n\n\n---\n\n\n## Blazer เบลสเซอร์ (จากหน้า 26)\n\nBlazer เบลสเซอร์\n\n\n---\n\n\n## Rdus (อาร์ดสั ) (จากหน้า 27)\n\nRdus (อาร์ดสั )\n\n\n---\n\n\n## Mechanics (ระบบการเล่น) (ต่อ 7) (จากหน้า 28)\n\nGameplay & mechanics  \nGameplay  \nCore gameplay loop  \n\n\n\n\n\nGame progression  \n<ol>\n<li>เริ่มต้นในหมู่บา้ นซิลเวอร์ลีฟ  เรียนรู้พื้นฐานการต่อสู้ ทำอาหาร และระบบอัปเกรด</li>\n</ol>\n\n\n---\n\n\n## Mechanics (ระบบการเล่น) (ต่อ 8) (จากหน้า 29)\n\n<ol>\n<li>สำรวจถ้ำเอเลเนีย (4 ชนั้ )  ตอ่ </li>\n</ol>\nสู้กับมอนสเตอร์กลายพันธุ์และมินิบอสเก็บวัตถุดิบระดับสูงในแต่ละชั้น  \n<ol>\n<li>พัฒนาไลออน & อาวุธ  ปลดล็อกชั้นดันเจี้ยน, และอาวุธขั้นสูง  </li>\n<li>ปลดล็อกเนื้อเรื่อง & ดันเจี้ยนใหม่  ความลับของอัซมารอสและอดีตของโลกจะค่อย ๆ เปิดเผย  </li>\n<li>ศึกสุดท้ายกับ “อาร์ดัส”  เอาชนะบิ๊กบอสเพื่อได้วัตถุดิบศักดิ์สิทธิ์ นำไปปรุงเมนูที่ช่วยชำระพลังมืด </li>\n</ol>\nและฟื้นฟูอิกนาร์ทิส  \nObjectives  \n<ol>\n<li>สำรวจ โลกหลังหายนะและดันเจี้ยนลึกลับ  </li>\n<li>ต่อสู้ กับมอนสเตอร์กลายพันธุ์และบอสสุดโหด  </li>\n<li>ปรุงอาหาร ดว้ ยวัตถุดิบวิเศษเพื่อเพิ่มพลังและฟื้นฟูธรรมชาติ  </li>\n<li>รวบรวมวัตถุดิบ  หายากเพื่ออัปเกรดอาวุธครัวเวท  </li>\n<li>ดำเนนิ เนื้อเรื่อง  เพื่อค้นหาความลับของ “อาหารแห่งพระเจ้า”  </li>\n<li>กอบกู้โลก โดยสร้างเมนูศักดิ์สิทธิ์จาก “เนอื้ อาร์ดัส”  </li>\n</ol>\n\n\nMechanics  \nPhysics  วัตถุในโลกมีแรงดึงดูดและการชนกัน เช่น \nมอนสเตอร์ที่โจมตีผู้เล่น  \n**Movement  \nCharacter Movement**: การเคลื่อนที่ในทิศทางต่างๆ ด้วยการใช้ปุ่ม W, A, S, D ผู้เล่นสามารถวิ่ง, \nกระโดด, และหลบหลีกจากการโจมตี\n\n\n---\n\n\n## Systems (ระบบ) (ต่อ 3) (จากหน้า 30)\n\n**Dodge Roll**: สามารถใช้การหมุนหลบการโจมตีหรือหลีกเลี่ยงอันตรายจากมอนสเตอร์  \nObjects  \nCollecting & Inventory Management:   \nเก็บวัตถุดิบจากมอนสเตอร์หรือธรรมชาติไว้ในช่องเก็บของ \nผู้เล่นสามารถจัดระเบียบหรือเลือกใช้สิ่งของในสต็อก Crafting \n& Upgrading:   \nอัปเกรดอาวุธครัวและอุปกรณ์ต่างๆ โดยใช้วัตถุดิบที่เก็บได้จากการสำรวจ  \n**Actions  \nCombo Attacks**: การโจมตีแบบคอมโบเพื่อเพิ่มความเสียหาย  \n**interacting with objects  \nCooking **: ใชว้ ัตถุดิบที่เก็บได้มาทำอาหาร  \n**Talking  \nDialogue System**: เลือกบทสนทนาเพื่อเพิ่มความสัมพันธ์กับ NPC และปลดล็อกเควสใหม่  \n**Reading  \nBooks **: การอ่านจะช่วยให้ผู้เล่นเข้าใจเนอื้ เรื่องและพัฒนาตัวละคร\n\n\n---\n\n\n## Overview (ภาพรวม) (ต่อ 2) (จากหน้า 31)\n\nUI ( User Interface )  \nMain menu  \nOverview  \n\nMockup\n\n\n---\n\n\n## Loading screens (จากหน้า 32)\n\nLoading screens\n\n\n---\n\n\n## Controls & Camera (การควบคุม & กล้อง) (จากหน้า 33)\n\nLevels  \nLevel 1: Floor 1 Silverleaf Village  \nSynopsis ไลออนตื่นขึ้นในหมู่บ้านซิลเวอร์ลีฟในยามรงุ่ อรุณ \nแอลเดอร์อธิบายถึงการเสื่อมสภาพของโลกและมอบหมาย ภารกิจแรกให้เขา: \nไปหามีดเนื้ออาร์ดัสจากถ้ำเอเลเนีย ในระดับนี้จะเป็นการแนะนำการควบคุมเกม การเล่า เรื่อง \nและการตั้งเป้าหมายของเกม Objectives  \n<ol>\n<li>พบกับแอลเดอร์ที่เตาผิงกลางหมู่บ้าน  </li>\n<li>เรียนรู้การเคลอื่ นไหวพื้นฐาน: เดิน, วิ่ง, กระโดด, และหลบหลีก  </li>\n<li>ทำภารกิจสอนทำอาหารของแอลเดอร์ (เตรยี มสตูว์บำรุงร่างกายง่ายๆ)  </li>\n<li>ออกจากหมู่บ้านและเข้าสู่ประตูถ้ำ Locations  </li>\n<li>หมู่บ้านซิลเวอร์ลีฟ  o กระท่อมของแอลเดอร์, </li>\n</ol>\nสถานีทำอาหาร, พ่อค้า NPC  \n<ol>\n<li>ขอบหมู่บ้าน o พื้นที่ฝึกทักษะที่มีหุ่นไม้และมอนสเตอร์ </li>\n</ol>\n\"None\" ระดับต่ำ  \n<ol>\n<li>ประตูถ้ำเอเลเนีย  o ประตูที่มีคบเพลิงและทางเข้าถ้ำ</li>\n</ol>\n\n\n---\n\n\n## Controls & Camera (การควบคุม & กล้อง) (ต่อ 2) (จากหน้า 34)\n\nการฝึกฝน – เตาผิงหมู่บ้าน  \n<ul>\n<li>แอลเดอร์อธิบายการควบคุมเกม  </li>\n<li>\"เดินไปที่เตาผิง\" → ฝึกการเดินและวิ่ง  </li>\n<li>\"หลบการระเบดิ ของเปลวไฟ\" → ฝึกการหมุนหลบ การฝึกทำอาหาร – </li>\n</ul>\nห้องครัวหมู่บ้าน  \n<ul>\n<li>เก็บวัตถุดิบจากถัง  </li>\n<li>ทำตามคำแนะนำบนหน้าจอเพื่อทำอาหารง่ายๆ  </li>\n<li>ทานอาหารเพื่อฟื้นฟูพลังชีวิต (สอนการใชอ้ ินเวนทอรี่และไอเท็ม) การฝึกการต่อสู้ – </li>\n</ul>\nพื้นทฝี่ ึกขอบหมู่บ้าน  \n<ul>\n<li>ต่อสู้กับมอนสเตอร์ \" None\" 2 ตัว  </li>\n<li>ฝึกการโจมตีเบา/หนักและการป้องกัน  </li>\n<li>รางวัล: 50 XP, การอัปเกรดเคลฟเวอร์พื้นฐานที่ร้านของแจ็ค การส่งตัวของแอลเดอร์ – </li>\n</ul>\nประตูหมู่บ้าน  \n<ul>\n<li>กลับไปพบแอลเดอร์: เขามอบคบไฟและเครื่องหมายภารกิจ  </li>\n<li>แอลเดอร์เตือนเกี่ยวกับมอนสเตอร์หินที่อยู่ข้างหน้า เข้าสู่ประตูถ้ำ  </li>\n<li>เข้าไปที่ทางเข้าที่ส่องแสง  </li>\n<li>การโหลดหน้าจอระดับถัดไปและแสดงแผนที่สำหรับระดับที่ 2</li>\n</ul>\n\n\n---\n\n\n## Enemies & Bosses (ศัตรู & บอส) (ต่อ 2) (จากหน้า 35)\n\nLevel walkthrough  \nLevel 2: Floor 2 Stone Golem  \nSynopsis  \nไลออนเดินทางลึกเข้าไปในถ้ำเอเลเนียที่มีมอนสเตอร์หิน ท่ามกลางพื้นที่ที่มืด เขาต้องเก็บแร่หายากเพื่ออัป \nเกรดเครื่องครัวของเขาก่อนที่จะเผชิญหน้ากับมินิบอส \"มิเทอร์\" เพื่อเปิดทางไปยังระดับถัดไป \nObjectives  \n<ol>\n<li>เก็บสมุนไพร 10 ชิ้น  </li>\n<li>เอาชนะมอนสเตอร์ \" None\" หนิ 5 ตัว  </li>\n<li>อัปเกรดอาวุธที่ร้านของแจ็คโดยใช้แร่  </li>\n<li>ทำอาหารเพื่อใช้ฟื้นฟูเลือด  </li>\n<li>เอาชนะมอนสเตอร์ \"สตาร์\" หิน 5 ตัว  </li>\n<li>ค้นหามินิบอส \"มิเทอร\"์ และเอาชนะเพื่อเปิดประตูไปยัง Blaze Zone Locations  </li>\n<li>อารีน่าของมิเทอร์ o มินิบอส \"มิเทอร์\" โผล่ออกมาจากมุมมืด  </li>\n<li>เขาวงกต  </li>\n</ol>\no เขาวงกตที่ทำให้ผู้เล่นได้งงงวยเพื่อเพิ่มความผจญภัย  \n<ol>\n<li>แท่นหลอมในหมู่บ้าน o ร้านตีเหล็กของแจ็คในที่ชั้น 1  </li>\n<li>บริเวณชั้นนอกพื้นที่บอส o มอนสเตอร์ 10 </li>\n</ol>\nตัวคอยขัดขวางผู้เล่นและปอ้ งกันมินิบอส \"มิเทอร์\" เขาวงกต  \n<ul>\n<li>เขาวงกตที่ทำให้ผู้เล่นได้สับสนงงงวยเพื่อเพิ่มความผจญภยั </li>\n</ul>\nและสามารถฟาร์มเก็บของแรร์ได้ บริเวณชั้นนอกพื้นที่บอส\n\n\n---\n\n\n## Enemies & Bosses (ศัตรู & บอส) (ต่อ 3) (จากหน้า 36)\n\n<ul>\n<li>เดินตามทางเดินที่มีคบเพลิง: เก็บสมุนไพร 10 ชิ้น (การโต้ตอบ “เก็บ”)  </li>\n<li>เจอมอนสเตอร์ \"นัน\" หิน 5 ตัว ฝึกการต่อสู้และท่าโจมตพี ื้นฐาน  </li>\n<li>เจอมอนสเตอร์ \"สตาร\"์ หิน 5 ตัว ฝึกการตอ่ สู้และท่าโจมตีพื้นฐาน </li>\n</ul>\nแท่นหลอมในหมู่บ้าน  \n<ul>\n<li>ผู้เล่นสามารถกลับไปยังหมู่บ้านได้เมื่อเก็บของอัปเกรดได้แล้ว </li>\n</ul>\nการเผชิญหน้ากับมิเทอร์ในอารีน่า  \n<ul>\n<li>ก้าวเข้าไปในพื้นที่; มิเทอร์ปรากฏตัวพร้อมกับการสั่นสะเทอื น </li>\n</ul>\n(ฝึกการหลบหลีกและการใช้คอมโบ)  \n<ul>\n<li>หลีกเลี่ยงการโจมตีจากมิเทอร์  </li>\n<li>ชนะแล้วเปิดประตูหินขนาดใหญ่ไปยังระดับถัดไป  </li>\n</ul>\n\n\nLevel 3: Floor 3 Blaze Zone  \nSynopsis หลังจากเอาชนะมินิบอสหิน มิเทอร์ ไลออนเดินทางเข้าสู่ “ Blaze Zone” \nพื้นทที่ ี่เต็มไปด้วยลาวา และพลัง แห่งธาตุไฟ เขาต้องเผชิญหน้ากับมินิบอส “เบลสเซอร์” \nผู้ควบคุมเปลวเพลิงอันเกรี้ยวกราด พร้อมตามหา “พริกศักดิ์สิทธิ์” ส่วนผสมลบั ของเมนูศักดิ์สิทธิ์ \nและฝึกควบคุมพ ลังความร้อนระหว่างต่อสู้ Objectives  \n<ol>\n<li>เก็บสมุนไพร 10 ชิ้น  </li>\n<li>เอาชนะมอนสเตอร์ \" None\" ไฟ 5 ตัว  </li>\n<li>อัปเกรดอาวุธที่ร้านของแจ็คโดยใช้แร่  </li>\n<li>ทำอาหารเพื่อใช้ฟื้นฟูเลือด</li>\n</ol>\n\n\n---\n\n\n## Enemies & Bosses (ศัตรู & บอส) (ต่อ 4) (จากหน้า 37)\n\nLevel walkthrough  \n<ol>\n<li>เอาชนะมอนสเตอร์ \"ไลท์\" หนิ 5 ตัว  </li>\n<li>ค้นหามินิบอส \"เบลสเซอร์\" และเอาชนะเพื่อเปิดประตูไปยังชั้นสุดท้าย Locations  </li>\n<li>อารีน่าของเบลสเซอร์  o มินิบอส \"เบลสเซอร์\" </li>\n</ol>\nโผล่ออกมาจากลาวา  \n<ol>\n<li>เขาวงกต  </li>\n</ol>\no เส้นทางแคบ มีลาวาไหลและพุ่มไม้พริกศักดิ์สิทธิ์  \n<ol>\n<li>แท่นหลอมในหมู่บ้าน  o ร้านตีเหล็กของแจ็คในที่ชั้น 1  </li>\n<li>บริเวณชั้นนอกพื้นที่บอส  o มอนสเตอร์ 10 </li>\n</ol>\nตัวคอยขัดขวางผู้เล่นและปอ้ งกันมินิบอส \"เบลสเซอร์\" เขาวงกต  \n<ul>\n<li>เขาวงกตที่ทำให้ผู้เล่นได้สับสนงงงวยเพื่อเพิ่มความผจญภยั </li>\n</ul>\nและสามารถฟาร์มเก็บของแรร์ได้ บริเวณชั้นนอกพื้นที่บอส   \n<ul>\n<li>เดินตามทางเดินที่มีคบเพลิง: เก็บสมุนไพร 10 ชิ้น (การโต้ตอบ “เก็บ”)  </li>\n<li>เจอมอนสเตอร์ \"นัน\" ไฟ 5 ตัว ฝึกการต่อสู้และท่าโจมตพี ื้นฐาน  </li>\n<li>เจอมอนสเตอร์ \"ไลท์\" ไฟ 5 ตัว ฝึกการต่อสู้และท่าโจมตพี ื้นฐาน แท่นหลอมในหมู่บ้าน   </li>\n<li>ผู้เล่นสามารถกลับไปยังหมู่บ้านได้เมื่อเก็บของอัปเกรดได้แล้ว การเผชิญหนา้ </li>\n</ul>\nกับมิเทอร์ในอารีน่า   \n<ul>\n<li>ก้าวเข้าไปในพื้นที่; เบลสเซอร์ปรากฏตัว (ฝึกการหลบหลกี และการใช้คอมโบ)  </li>\n<li>หลีกเลี่ยงการโจมตีจากเบลสเซอร์  </li>\n<li>ชนะแล้วเปิดประตูหินขนาดใหญ่ไปยังระดับสุดท้าย</li>\n</ul>\n\n\n---\n\n\n## Enemies & Bosses (ศัตรู & บอส) (ต่อ 5) (จากหน้า 38)\n\nLevel 4: Floor 4 Heart of the Alenia  \nSynopsis หลังจากฝ่าฟันดันเจี้ยนทั้งสองชั้น ไลออนมาถึงใจกลางของถ้ำเอเลเนีย สถานที่ที่พลังมดื \nของอัซมารอสยังคง สถิตอยู่ และเป็นที่อาศัยของมอนสเตอร์กลายพันธุ์ขั้นสุดยอด: อาร์ดัส ( Rdus) \nผู้ปกป้องหัวใจของพลัง ธรรมชาติ เขาต้องต่อสู้กับมันและเลือกว่าจะกำจัดหรือสงบมัน เพื่ อนำ \n“เนื้ออาร์ดัส” กลับไปยังหมู่บ้านเพื่อ ปรุงเมนูศักดิ์สิทธิ์  \nObjectives  \n<ol>\n<li>เก็บสมุนไพร 5 ชิ้น  </li>\n<li>อัปเกรดอาวุธที่ร้านของแจ็คโดยใช้แร่  </li>\n<li>ทำอาหารเพื่อใช้ฟื้นฟูเลือด  </li>\n<li>ค้นหาบอส \"อาร์ดัส\" และเอาชนะและจบเรื่องราว  </li>\n</ol>\nLocations ลานกว้างที่อยอู่ \nาศัยของ อาร์ดัส  \n<ul>\n<li>มินิบอส \"อารด์ ัส\" โผล่ออกมา แท่นหลอมในหมู่บ้าน  </li>\n<li>ร้านตีเหล็กของแจ็คในที่ชั้น 1 บริเวณชั้นนอกพื้นที่บอส  </li>\n<li>เดินตามทางเดินที่มีคบเพลิง: เก็บสมุนไพร 5 ชิ้น Level walkthrough </li>\n</ul>\nบริเวณชั้นนอกพื้นที่บอส  \n<ul>\n<li>เดินตามทางเดินที่มีคบเพลิง: เก็บสมุนไพร 10 ชิ้น (การโต้ตอบ “เก็บ”) </li>\n</ul>\nแท่นหลอมในหมู่บ้าน\n\n\n---\n\n\n## • ผู้เล่นสามารถกลับไปยังหมู่บ้านได้เมื่อเก็บของอัปเกรดได้ (จากหน้า 39)\n\n<ul>\n<li>ผู้เล่นสามารถกลับไปยังหมู่บ้านได้เมื่อเก็บของอัปเกรดได้</li>\n</ul>\nแล้ว การเผชิญหนา้ กับมิเทอร์ในอารีน่า  \n<ul>\n<li>ก้าวเข้าไปในพื้นที่; อาร์ดัส ปรากฏตัว </li>\n</ul>\n(ฝึกการหลบหลีกและการใช้คอมโบ)  \n<ul>\n<li>หลีกเลี่ยงการโจมตีจาก อาร์ดัส  </li>\n<li>ชนะแล้วเปิดประตูหิเพื่อกลับไปยังหมู่บ้านและทำอาหาร</li>\n</ul>\nศักดิ์สิทธิ์\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 11) (จากหน้า 40)\n\nฉากเนื้อเรื่อง/อาหาร ( Cutscene ) โครงสร้างหน้าต่างๆของเกม ( Game \nWireframe )  \n<ul>\n<li>icon  64×64px ถึง 128×128px Game Dev :  </li>\n<li>on click เข้าไปยังตัวเกม  </li>\n<li>ชื่อเกม Dungeon Dungry</li>\n</ul>\n\n\n---\n\n\n## ส่วนที่ 41 (จากหน้า 41)\n\n\n\n\n---\n\n\n## Loading Page (จากหน้า 42)\n\n<ol>\n<li></li>\n</ol>\n**Loading Page  \n\n\nGame Art **: - ออกแบบภาพ Background  \n<ul>\n<li>Loading Icon  </li>\n<li>Process Bar  </li>\n<li>เล่น Background Music หรือ Sound Effect เบาๆ Game Dev :  </li>\n<li>นำ Asset มาใช้  </li>\n<li>ทำให้โหลดฉากแบบ Async และเพิ่ม Animation หรือ Effect</li>\n</ul>\n\n\n---\n\n\n## AI & Encounters (ต่อ 2) (จากหน้า 43)\n\n<ol>\n<li></li>\n</ol>\n<ul>\n<li>ใส่ Tip หรือ Fun Fact ที่เปลี่ยนไปเรื่อยๆ  </li>\n</ul>\n\n**Start Page  \n\n\nGame Art **: - ทำ Background , Logo , Button และ Sound effect / BG  \n<ul>\n<li>การจัดวาง Layout ต่างๆ  </li>\n<li>เล่น Background Music หรือ Sound Effect เบาๆ Game Dev :  </li>\n<li>ลิ้งค์ปุ่มต่าง คือ ปุ่ม Start ไปยัง Main PLay / ปุ่ม Setting หน้าการตั้งค่า / หรือปุ่ม </li>\n</ul>\nExit เพื่อออกไปยัง หน้า Icon Page\n\n\n---\n\n\n## Characters (ตัวละคร) (จากหน้า 44)\n\n<ol>\n<li></li>\n</ol>\n<ul>\n<li>hold button เมื่อชี้ปุ่ม  </li>\n</ul>\n\n**Main Play  \n\n\nGame Art **: - ลักษณะหลอดเลือด / พลังงาน  \n<ul>\n<li>layout หน้า Main Play  </li>\n<li>Assets ต่างๆภายในพื้นที่  </li>\n<li>Icon อาวุธ อาหาร ยา และ ฟันเฟือง Game Dev :  </li>\n<li>กดปุ่มเพื่อไปยังหน้าอื่น เช่น กด I เพื่อเข้าหน้า Inventory หรือ การกด left click </li>\n</ul>\nเพื่อโจมตี  \n<ul>\n<li>การตั้งค่าการโจมต  </li>\n<li>ท่าทางต่างๆของตัวละคร</li>\n</ul>\n\n\n---\n\n\n## Characters (ตัวละคร) (ต่อ 2) (จากหน้า 45)\n\n<ol>\n<li></li>\n</ol>\n**Game Art  \n\nGame Art **: - Icon สำหรับ เมนูใน Inventory  \n<ul>\n<li>การจัดวาง Layout ใน Inventory  </li>\n<li>ตัวละคร Game Dev :  </li>\n<li>การลิ้งค์ Icon ข้อมูล ค่าสถานะ ของวัตถุดิบ  </li>\n<li>กด icon paper เพื่อไปหน้า book page  </li>\n<li>การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน</li>\n</ul>\n\n\n---\n\n\n## Book Page (จากหน้า 46)\n\n<ol>\n<li></li>\n</ol>\n**Book Page  \n\n\nGame Art **: - ทำข้อมูลในกระดาษ  \n<ul>\n<li>ลักษณธของกระดาษ  </li>\n<li>Layout ของหน้ากระดาษ  Game Dev :  </li>\n<li>การกด Book 1 เพื่ออ่านข้อมูลในกระดาษ  </li>\n<li>กด icon person เพื่อไปหน้า Stat  </li>\n<li>การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน</li>\n</ul>\n\n\n---\n\n\n## Characters (ตัวละคร) (ต่อ 3) (จากหน้า 47)\n\n<ol>\n<li></li>\n</ol>\n\n**Stat Page  \n\nGame Art **: - ทำหลอดสถานะต่างๆ  \n<ul>\n<li>การจัดวางของส่วนต่างๆ Game Dev :  </li>\n<li>การลิ้งค์ Icon ข้อมูล ค่าสถานะ ของตัวละคร  </li>\n<li>กด icon food เพื่อไปหน้า craft page  </li>\n<li>การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน  </li>\n</ul>\n\n\nCraft Page\n\n\n---\n\n\n## Characters (ตัวละคร) (ต่อ 4) (จากหน้า 48)\n\n<ol>\n<li></li>\n</ol>\n\n\n**Game Art **: - ทำ Icon สำหรับ เมนูใน craft page  \n<ul>\n<li>การจัดวาง Layout ใน Craft page  </li>\n<li>ตัวละคร Game Dev :  </li>\n<li>กด craft เพื่อไปยัง Cutscene ของอาหารแต่ละเมนู  </li>\n<li>การผสมวัตถุดิบ  </li>\n<li>การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน</li>\n</ul>\n\n\n---\n\n\n## Setting Page (จากหน้า 49)\n\n<ol>\n<li></li>\n</ol>\n**Setting Page  \n\n\nGame Art **: - ทำ Icon สำหรับ setting เช่น valume music และ Exit  \n<ul>\n<li>การจัดวาง Layout ใน Setting Page Game Dev :  </li>\n<li>ปรับการตั้งค่า ลด - เพิ่มเสียง เกมและเพลง  </li>\n<li>ลิ้งค์ปุ่ม Exit ( on click ) ให้ออกไปยังหน้า Start  </li>\n<li>การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC หรือปุ่ม BACK </li>\n</ul>\nเพื่อออกจากหน้าปัจจุบัน\n\n\n---\n\n\n## Trading Page (จากหน้า 50)\n\n<ol>\n<li></li>\n</ol>\n\n**Trading Page  \n\nGame Art **: - ทำ Icon สำหรับ Trading วตั ถดุ บิ แร่  \n<ul>\n<li>การจัดวาง Layout ใน Trading page Game Dev :  </li>\n<li>วางวัถุดิบให้ตรงกับความต้องการของพ่อค้าเพื่อจะแลกเปลี่ยน  </li>\n<li>การเพิ่ม – ลดวัตถุดิบที่แลกเปลี่ยนแล้ว  </li>\n<li>การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC หรือปุ่ม BACK </li>\n</ul>\nเพื่อออกจากหน้าปัจจุบัน\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 12) (จากหน้า 51)\n\n<ol>\n<li></li>\n</ol>\n\n**Cutscene  \n\nGame Art **: - ออกแบบ Motion Graphic ให้เล่าเนื้อเรื่อง Game Dev :  \n<ul>\n<li>การลิ้งค์กับส่วนต่างๆที่ต้องมี Cutscene  </li>\n<li>การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม Space Bar เพื่อข้าม  </li>\n</ul>\n\n\nTeleport Page\n\n\n---\n\n\n## Game Art : (จากหน้า 52)\n\n<ol>\n<li></li>\n</ol>\n\n**Game Art **: - การจัดวาง Layout ใน Teleport Game Dev :  \n<ul>\n<li>on click เพื่อไปยังจุดเทเลพอร์ต  </li>\n<li>เชื่อมต่อหน้าเทเลพอร์ตกับจุดเทเลพอร์ต  </li>\n<li>การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน  </li>\n</ul>\n\n\nRead Paper Page\n\n\n---\n\n\n## Game Art : (ต่อ 2) (จากหน้า 53)\n\n<ol>\n<li></li>\n</ol>\n\n**Game Art **: - การจัดวาง Layout ข้อความ ชื่อเรื่อง Game Dev :  \n<ul>\n<li>นำกระดาษเข้ามาในกระเป๋าหลังจากเจอแผ่นกระดาษแล้ว  </li>\n<li>เชื่อมต่อกับหน้า Inventory  </li>\n<li>การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน  </li>\n</ul>\n\nWin/Lost page\n\n\n---\n\n\n## Game Art : (ต่อ 3) (จากหน้า 54)\n\n<ol>\n<li></li>\n</ol>\n\n\n**Game Art **: - การจัดวาง Layout ข้อความที่ปรากฎ Game Dev :  \n<ul>\n<li>สร้างเงื่อนไขการชนะและแพ้ เพื่อให้ข้อความขึ้น</li>\n</ul>\n\n\n---\n\n\n## Controls & Camera (การควบคุม & กล้อง) (ต่อ 3) (จากหน้า 55)\n\n)  \nกลไกการเล่นเกม ( Gameplay Mechanics  \nPlayer Controls & Actions  \n<ul>\n<li>Idle, Walk, Run, Hit, Dash, Dead  </li>\n<li>สำรวจพื้นที่ ค้นหาทางลับ และไขปริศนา  </li>\n<li>ต่อสู้กับมอนสเตอร์เพื่อเก็บวัตถุดิบ  </li>\n<li>ทำอาหารจากวัตถุดิบที่หาได้  </li>\n<li>อัปเกรดอาวุธและเกราะ  </li>\n<li>แลกเปลี่ยนไอเทมกับ NPC  </li>\n</ul>\n     Combat System  \n<ul>\n<li>ระบบต่อสู้แบบ Hack & Slash  </li>\n<li>ศัตรูมีพฤติกรรม AI แบบ Chase Player  </li>\n<li>Mini Boss (หิน/ไฟ) มีการโจมตี Melee  </li>\n</ul>\n     Crafting & Cooking  \n<ul>\n<li>เก็บวัตถุดิบจากธรรมชาติและมอนสเตอร์  </li>\n<li>ใช้ระบบทำอาหารเพื่อเพิ่ม Buff ให้ตัวละคร  </li>\n<li>ระบบอัปเกรดอาวุธและเกราะ </li>\n</ul>\nกระบวนการออกแบบ ( Level Design )  \nDungeon Structure  \n<ul>\n<li>ดันเจี้ยนแบ่งเป็น 4 ชั้น  </li>\n<li>แต่ละชั้นมีมอนสเตอร์และวัตถุดิบที่แตกต่างกัน</li>\n</ul>\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 13) (จากหน้า 56)\n\n)  \n<ul>\n<li>มี Mini Boss ในแต่ละชั้น และ Big Boss </li>\n</ul>\nที่ชั้นสุดท้าย  \nEnvironmental Design  \n<ul>\n<li>ทางเดินบางจุดแคบและมืดและบางจุดเป็นถ้ำกว้</li>\n</ul>\nางขนาดใหญ่  \n<ul>\n<li>ธีมของแต่ละชั้นแตกต่างกัน เช่น หิน, ไฟ, </li>\n</ul>\nธรรมชาติ   \nผู้เล่น และ ศตั รู ( Characters & Enemies  \nMain Character  \n<ul>\n<li>Lion (ไลออน) – </li>\n</ul>\nนักทำอาหารที่ต้องผจญภัยเพื่อช่วยทุกคน  \nBosses  \n<ul>\n<li>Big Boss - ศัตรูสุดท้ายในดันเจี้ยน  </li>\n<li>Mini Bosses - หิน & ไฟ  </li>\n</ul>\nMonster / Enemies  \n<ul>\n<li>มอนสเตอร์หิน ( x5)  </li>\n<li>มอนสเตอร์ไฟ ( x5)  </li>\n<li>มอนสเตอร์ทั่วไป ( x10) ไอเทม และ </li>\n</ul>\nกระเปา๋ ( Items & Inventory )  \n<ul>\n<li>Weapons: มีด 3 ระดับ  </li>\n<li>Armors: เกราะ 3 ระดับ  </li>\n<li>Potions: ฟื้นฟู HP และ Stamina</li>\n</ul>\n\n\n---\n\n\n## Systems (ระบบ) (ต่อ 4) (จากหน้า 57)\n\n)  \n<ul>\n<li>Cooking Ingredients: สมุนไพร, เนื้อ, แร่  </li>\n<li>Key Items: แผ่นบันทึก เงื่อนไขการชนะ ( Game </li>\n</ul>\nProgression & Win Condition )  \n<ul>\n<li>ผู้เล่นต้องผ่าน 4 ชั้นของดันเจี้ยน  </li>\n<li>เอาชนะ Mini Boss และ Big Boss  </li>\n<li>ค้นหาวัตถุดิบเพื่อทำอาหารศักดิ์สิทธิ์  </li>\n<li>ชนะเกมเมื่อสร้างอาหารสำเร็จและฟื้นฟูสมดุลขอ</li>\n</ul>\nงโลก  \n\n\nการออกแบบหน้าตาเกม ( UI & UX Design  \n<ul>\n<li>โครงสร้างเมนูหลัก  </li>\n<li>HUD (Heads-up Display) เช่น แถบพลังชีวิต, </li>\n</ul>\nMini-map  \n<ul>\n<li>ระบบแจ้งเตือน (เช่น Low HP Warning, Buff </li>\n</ul>\nStatus) งานภาพและงานเสียง ( Art & Sound )  \n<ul>\n<li>Art Style: Stylized 3D and Stylized </li>\n</ul>\nFantasy  \n<ul>\n<li>Environment Reference : Genshin Impact  </li>\n<li>UI Design Reference : Dark Souls 3</li>\n</ul>\n\n\n---\n\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 14) (จากหน้า 58)\n\n)  \n<ul>\n<li>Sound Design : Background Music + SFX </li>\n</ul>\n(No Voice Over) เครื่องมือการทำงาน ( Development \nTools )  \n<ul>\n<li>Engine: Unity (C#)  </li>\n<li>3D Modeling: Blender  </li>\n<li>2D Assets: Adobe Illustrator  </li>\n<li>Animation: Adobe After Effects  </li>\n<li>Sound Editing: Adobe Audition </li>\n</ul>\nสมาชิกทีมพัฒนา ( Team Responsibilities )  \n<ol>\n<li>ธนพัฒน์ บุญขำ ( Game Development ) - </li>\n</ol>\nProgramming, UI, Level Design  \n<ol>\n<li>พิชญธิดา สุวรรณธาดา ( Game Artist )  </li>\n</ol>\n<ul>\n<li>Art, Effects, Character Design  </li>\n</ul>\n<ol>\n<li>อนิวรรต บุญคงมาก ( Game Design )  </li>\n</ol>\n<ul>\n<li>Story, UI, Scene Design</li>\n</ul>\n\n\n---\n\n\n## Mechanics (ระบบการเล่น) (ต่อ 9) (จากหน้า 59)\n\nขอบเขตระยะเวลาการทำงานโปรเจกต์ ( Milestone & Development Timeline )  \nSemester 2/67  \n<ul>\n<li>Game Design 100%  </li>\n<li>Art 40%  </li>\n<li>Development (Core Mechanics 40%) Semester 3/67  </li>\n<li>Art 60%  </li>\n<li>Core Mechanics 60% Semester 1/68  </li>\n<li>Full Game Development 100%  </li>\n<li>Playtest (30 Testers)  </li>\n<li>Documentation</li>\n</ul>"
    },
    {
      "id": "dungeon-dungry-full",
      "title": "Dungeon Dungry — GDD ฉบับเต็ม (หัวข้ออัตโนมัติ)",
      "date": "2025-08-20",
      "tags": [
        "GDD",
        "Dungeon Dungry",
        "full",
        "PDF",
        "auto-title"
      ],
      "summary": "ฉบับเต็มจาก PDF โดยเปลี่ยนหัวข้อเป็นชื่อส่วนของแต่ละหน้า (ตรวจจับอัตโนมัติ)",
      "content_md": "# Dungeon Dungry — GDD ฉบับเต็ม (หัวข้ออัตโนมัติ)\n\n> ปรับหัวข้อจาก \"หน้า N\" เป็นหัวข้อของแต่ละส่วน · อัปเดต: 2025-08-20\n\n---\n\n## Game Design Document \"Dungeon Dungry \" (จากหน้า 1)\n\nGame Design Document \"Dungeon Dungry \"     จัดทำโดย  นายธนพัฒน์ บุญขำ รหัสนักศึกษา: 6530611012   นางสาวพิชญธิดา  สุวรรณธาดา   รหัสนักศึกษา: 6530611016   นายอนิวรรต  บุญคงมาก   รหัสนักศึกษา: 6530611018     อาจารย์ที่ปรึกษา   ดร.วรวิกา วัฒนสุนทร      ข้อเสนอโครงการฉบับนี้เปน็ ส่วนหนงึ่ ของวิชา 968 -391 Project in  Computing มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตภูเก็ต  ภาคการศึกษาที่ 2/2567 - 1/2568\n---\n\n## Overview (ภาพรวม) (จากหน้า 2)\n\nDungeon Drugry ผจญภัยในโลกดันเจี้ยน     ภาพรวมเกม ( Game Overview )   Title game : Dungeon Drugry ผจญภัยในโลกดันเจี้ยน    Elevator pitch : Dungeon Dungry เปน็ เกมสำรวจดันเจี้ยนแบบ 3 D ที่ผู้เล่นจะได้รับบทเป็น \"ไลออน\"  (Lion) นักทำอาหารที่ต้องเดินทางเข้าสู่ถ้ำ \" Elenia\" เพื่อตามหา \"เนื้ออาร์ดัส\" ทสี่ ามารถฟื้นฟูสมดุลของ  ธรรมชาติ เกมจะมีการค้นหาวัตถุดิบจากแผนที่และมอนสเตอร์ พร้อมระบบทำอาหารและการต่อสู้      Concept   Overview   • Genre: Adventure / Explore   • Target audience:   o Age: 15-30 o Gender: Male/Female   • Monetization: Freemium   • Platforms & system requirements:    o Windows PC   ไอเดียหลัก ( Game Concept )   Dungeon Dungry เป็นเกมสำรวจดันเจี้ยนแบบ 3 D ที่ผู้เล่นจะได้รับบทเป็น \"ไลออน\" (Lion) นกั  ทำอาหารที่ต้องเดินทางเข้าสู่ถ้ำ \" Elenia\" เพื่อตามหา \"เนื้ออาร์ดัส\" ที่สามารถฟื้นฟูสมดุลของธรรมชาติ เกมจะ  มีการค้นหาวัตถุดิบจากแผนที่และมอนสเตอร์ พร้อมระบบทำอาหารและการต่อสู้\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (จากหน้า 3)\n\nเรื่องราวและสถานที่ เรื่องราวของเกม ( Game Story )     เมื่อหลายร้อยปีก่อน ดินแดน “อิกนาร์ทิส” เคยเป็นศูนย์กลางของพลังแห่งธรรมชาติและ  เป็นแหล่งวัตถุดิบล้ำค่าที่สุดในโลกเอเลเนีย แต่การปรากฏตัวของ \"จอมเวทต้องสาป อัซมารอส\"  ได้  นำมาซึ่งหายนะครั้งใญ่ เขาทดลองเวทมนตร์ต้องห้ามเพื่อสร้าง \"อาหารแห่งพระเจ้า\" ที่สามารถให้พลัง  เหนือขีดจำกัดแก่มนุษย์ แต่กลับนำมาซึ่งคำสาปที่แทรกซมึ เข้าไปในธรรมชาติ พลังลึกลับได้  แพร่กระจายจากส่วนลึกของอิกนาร์ทิส ทำให้สิ่งมีชีวิตทุกชนิดเริ่มกลายพันธุ์ พื ชพันธุ์เน่าเปื่อย และ  ดินแดนทั้งหมดถูกปกคลุมดว้ ยพลังมืด   แม้ว่าจอมเวทอัซมารอสจะถกู ผนึกไ ปแล้ว  แต่พลังของเขายังคงส่งผลกระทบต่อโลก และไม่มี ใครสามารถหยุดยั้งมันได้ จนกระทั่ง Elder ผู้เฒา่  แห่งหมู่บ้านซิลเวอรล์ ีฟ  พบว่ามีเพยี งอาหาร ศักดิ์สิทธิ์บางอย่างเท่านั้นที่สามารถฟื้นฟูสมดุลได้  และวัตถุดิบที่ขาดไม่ได้คือ “เนื้ออาร์ดัส” ซึ่งเป็น หัวใจสำคัญของเมนูนี้   ไลออน เป็นเดก็  หนุ่มที่เกิดและเติบโตในหมู่บ้านซิลเวอร์ลฟี แม้ว่าเขาจะมีพรสวรรค์ในการ ทำอาหารมาตั้งแต่เด็ก  แต่สิ่งที่ทำให้เขาแตกต่างจากเชฟทั่วไปคือ \"สัมผัสแห่งวัตถุดบิ \"  พลังพิเศษที่  ช่วยให้เขารับรู้คุณสมบัติของวัตถุดิบและดึงรสชาติที่แท้จริงของมั นออกมา   Elder จึงมอบหมายให้ไลออนทำภารกิจตามหา \"เนื้ออารด์ ัส\" จากส่วนลึกของ ถ้ำเอเลเนีย ถ้ำแห่งนี้  เป็นหนึ่งในสถานที่ที่ได้รับผลกระทบจากพลังของอิกนาร์ทิส ทำให้มอนสเตอร์ภายในกลายพันธุ์และดุ ร้ายขึ้น  เส้นทางสู่เนื้ออาร์ดัส: ดันเจี้ยนอันตรายและมินิบอสสุดโหด ถ้ำเอเลเนีย ไม่ใช่สถานที่ธรรมดา  แต่เป็นดันเจี้ยนที่ถูกสร้างขึ้นจากพลังแห่งสมดุล และถูกแบ่ง ออกเป็น 4 ชั้นหลัก แต่ละชนั้ มี มินิบอส ทเี่  ฝ้าประตูไว้ และไลออนต้องเอาชนะพวกมันให้ได้เพื่อ ปลดล็อกชั้นต่อไป\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 2) (จากหน้า 4)\n\nTheme and setting    Dungeon Dungry เป็นเกมแนวแอ็คชัน RPG แบบผจญภัย ตั้งอยู่ในโลกแฟนตาซีมืดหลังวัน  โลกาวินาศ ซึ่งธรรมชาติถูกคำสาปกระทำลาย ผู้เล่นสวมบท ไลออน เชฟหนุ่มผู้มีพลังพิเศษ ออกสำรวจ  ดันเจี้ยนใต้ดินขนาดใหญ่ แบง่ เป็นหลายชั้นธีมธาตุแตกต่างกัน พร้อมกับต่อสู้กับมอนสเตอร์กลายพันธุ์  รวบรวม วัตถุดิบล้ำค่า และปรุง “เมนูศักดิ์สิทธิ์” เพอื่ คืนสมดุลให้โลก สภาพแวดล้อมหลักคือ ถ้ำเอเลเนีย  ชั้นต่างๆ ได้แก่   • Silverleaf Village : หมูบ้านซิลเวอรล์  ีฟ   • Stone Golem: ห้องผลึกธาตุหิ น   • Blaze Zone: เขตลาวาและเพลิงร้อนแรง    • Heart of the Alenia: ศูนย์กลางพลังมืดและที่อยู่ของบอส Rdus  เกมผสมผสานบรรยากาศโบราณร้างกับความหวังในการเยียวยาผ่านพลังของอาหาร  ให้ผู้เล่นได้สัมผัสทั้งความ ท้าทายและช่วงเวลาที่งดงามของโลกแฟนตาซีที่รอวันคืนชีพ   Learn more about the Locations, Story, and Characters of the game.\n---\n\n## Mechanics (ระบบการเล่น) (จากหน้า 5)\n\nProject scope   Our team Game Designer – Aniwat   1. ชื่อ-นามสกลุ (Name)   • นายอนิวรรต บุญคงมาก   2. ตำแหน่ง/บทบาท ( Role) Game Designer บทบาทหลัก: รับผิดชอบการออกแบบระบบการเล่น,  กฎของเกม, การวางแผนเนื้อหา, และการทำให้ ประสบการณ์ของผู้เล่นเป็นไปตามที่ตั้งใจไว้   3. หน้าที่และความรับผิดชอบหลัก ( Responsibilities)   • ออกแบบกลไกการเล่น ( Gameplay Mechanics) เช่น ระบบต่อสู้, การสำรวจ, การจัดการทรัพยากร  ฯลฯ   • สร้างระบบความก้าวหน้าในเกม ( Progression Systems) เช่น เลเวล, ความสำเร็จ, ความสามารถที่  ปลดล็อก   • ออกแบบประสบการณ์ผู้เล่น ( Player Experience) ทั้งในด้านความสนุกและการสร้างอารมณ์ในการ  เล่น   • วางแผนการพัฒนาเนื้อหาหรือเนื้อเรื่องของเกม   • สร้างระบบและสภาพแวดล้อมที่เกี่ยวข้องกับธีมและสไตลข์ องเกม   • การทำเอกสาร GDD ที่เกี่ยวขอ้ งกับกลไก, ประสบการณ์ผู้เล่น, และการออกแบบโลกในเกม   • สื่อสารและทำงานร่วมกับทีมเพื่อให้มั่นใจว่าการออกแบบเกมเป็นไปตามแนวทางที่ตั้งใจไว้   4. ทักษะ/ความชำนาญ ( Skills & Expertise)   • เครื่องมือการออกแบบเกม: Unity, GDD Writing Tools / Nuclino   • ความรู้ในระบบการออกแบบเกม: เช่น ระบบการต่อสู้, การพัฒนา AI, ระบบการจัดการทรัพยากร\n---\n\n## Mechanics (ระบบการเล่น) (ต่อ 2) (จากหน้า 6)\n\n• ความเชี่ยวชาญในด้านการสร้างกลไกและระบบในเกม ( Gameplay Systems Design)   • การวิเคราะห์และปรับปรุงสมดุลในเกม ( Game Balancing)   • ทักษะในการเขียนเอกสารและสื่อสารไอเดีย ( GDD, Pitch Documents)   • ความรู้พื้นฐานในการออกแบบ UI/UX   • ประสบการณ์ในการทำงานร่วมกับทีมพัฒนา ( Cross-functional teams)   5. ช่องทางติดต่อ ( Contact Info)   • อีเมล: s6530611018@phuket.psu.ac.th   • เบอร์โทรศัพท์: 0826940174   6. เวลาที่พร้อมทำงาน ( Availability)   • วัน-เวลาที่สะดวก จันทร์ –ศุกร์ 09:00–17:00   • ประเมินชั่วโมงการทำงานต่อสัปดาห์ 20 -30 ชั่วโมง/สัปดาห์   7. ประสบการณ์ที่ผ่านมา ( Relevant Experience)   • โปรเจกต์ที่ผ่านมาที่เกี่ยวข้อง:   o โปรเจกต์ : -   • ผลงานที่เกี่ยวข้อง:   o มีส่วนร่วมในการออกแบบกลไกหรือระบบในเกมที่สำเร็จ   o ประสบการณ์ในการทำงานร่วมกับทีมพัฒนาเกมในส่วนต่างๆ เช่น Art, Programming,  Sound, etc.   8. ความรับผิดชอบต่อเป้าหมายหลัก ( Key Deliverables)   • สร้างเอกสารการออกแบบระบบการเล่นทั้งหมด ( Game Systems Design Docs)   • ออกแบบและพัฒนา Gameplay Mechanics สำหรับดันเจี้ยนและการต่อสู้\n---\n\n## Mechanics (ระบบการเล่น) (ต่อ 3) (จากหน้า 7)\n\n• วางแผนและจัดการการทดสอบสมดุลของเกม ( Game Balancing)   • สร้างและดูแล GDD สำหรับทมี พัฒนา 9. ความเชื่อมโยงกับหน้าที่อื่น ( Interdependencies)   • ต้องประสานงานกับ:   o Programmer: เพื่อพัฒนาและทดสอบระบบการเล่นที่ออกแบบ o Artist: เพื่อใหแ้  น่ใจว่าโลกและตัวละครสอดคล้องกับการออกแบบ o Sound Designer: เพื่อทำใหป้  ระสบการณ์เสียงสอดคล้องกับธีม o QA Tester: เพื่อทดสอบการทำงานของระบบต่างๆ  ในเกม   • Input/Output ที่ต้องแลกเปลี่ยน:   o Input: ความต้องการและข้อเสนอแนะจากทีมเพื่อพัฒนาแนวทางการออกแบบ o Output:  สร้างเอกสารการออกแบบและการประสานงานกับทีมในการพฒั นาต่อไป Game  Development – Tanapat   1. ชื่อ-นามสกลุ (Name)  นายธนพัฒน์ บุญขำ 2.  ตำแหน่ง/บทบาท ( Role)    •  Programmer   3. หน้าที่และความรับผิดชอบหลัก ( Responsibilities) สรุปงานที่รับผดิ ชอบโดยย่อ  เช่น   • เขียนเอกสารออกแบบระบบการต่อสู้   • พัฒนาสคริปต์ AI   • ทดสอบบั๊กและปรับบาลานซ์\n---\n\n## Tech & Tools (จากหน้า 8)\n\n4. เครื่องมือ   • Unity   • C#   5. ช่องทางติดต่อ ( Contact Info)   • s6530611018@phuket.psu.ac.th   • เบอร์โทรศัพท์   6. เวลาที่พร้อมทำงาน ( Availability)   • วัน-เวลาที่สะดวก (เช่น จันทร์ –ศุกร์ 09:00–17:00)   • ประเมินปริมาณงานต่อสัปดาห์ (ชั่วโมง)   7. ความรับผดิ ชอบต่อเป้าหมายหลัก ( Key Deliverables)   • รายการชิ้นงานหรือมิลสโตนที่ต้องส่งมอบ   • กำหนดเวลา (Deadline)   8. ความเชื่อมโยงกับหน้าที่อื่น ( Interdependencies)   • ใครต้องประสานงานด้วย   • Input/Output ที่ต้องแลกเปลี่ยนระหว่างทีม\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 3) (จากหน้า 9)\n\nGame Artist – Pichayathida   1. ชื่อ-นามสกลุ (Name) ระบุชื่อเต็มของ Game Artist เช่น   • นาย/นางสาว [ชื่อเต็ม]   2. ตำแหน่ง/บทบาท ( Role) Game Artist  บทบาทหลัก:  รับผิดชอบในการออกแบบและสร้างงานศิลปะสำหรับเกม เช่น ตัวละคร, ฉาก, วัตถุ, เอฟเฟกต์ ภาพ,  และการออกแบบ UI/UX เพื่อให้โลกของเกมดูมีชีวิตชีวาและสอดคล้องกับธีมและสไตล์ที่กำหนด   3. หน้าที่และความรับผิดชอบหลัก ( Responsibilities)   • สร้างและออกแบบตัวละคร, ศัตรู, ฉาก, และวัตถุภายในเกม   • ออกแบบและสร้าง UI (User Interface) เช่น เมนู, ปุ่ม, และองค์ประกอบอื่นๆ ที่ผู้เล่นสามารถ  โต้ตอบ   • ออกแบบและสร้างเอฟเฟกต์ภาพ ( Visual Effects) เช่น การระเบิด, แสง, หรือเอฟเฟกต์ของท่าทาง  การต่อสู้   • ร่วมมือกับทีม Game Designer และ Programmer เพื่อให้แน่ใจว่าศิลปะในเกมมีความเข้ากันได้ดี  กับการเล่น   • ทำงานกับทีมเพื่อสร้างสไตล์กราฟิกของเกม (เช่น 2 D, 3D, สไตล์การวาด, หรือกราฟิกแบบพิกเซล)   • ร่วมมือกับทีมพัฒนาเพื่อประสานการปรับปรุงและการทดลองศิลปะตามคำติชมจากทีม   • ดูแลความถูกตอ้ งของแอสเซ็ตต่างๆ เช่น โมเดล 3 D, เท็กซ์เจอร์, ภาพพื้นหลัง ฯลฯ   4. ทักษะ/ความชำนาญ ( Skills & Expertise)   • เครื่องมือการออกแบบกราฟิก:    o 2D Art Tools:  Adobe Photoshop , Illustrator, Clip Studio Paint , Krita\n---\n\n## Systems (ระบบ) (จากหน้า 10)\n\no 3D Art Tools:  Blender, Maya, 3ds Max, ZBrush o  Animation Tools:  Spine, Unity Animator , After Effects  o  UI Design Tools:  Figma, Sketch, Adobe XD   • ทักษะการสร้างคอนเซ็ปต์อาร์ต ( Concept Art)    • การออกแบบและสรา้ งตัวละคร ( Character Design)    • การสร้างสภาพแวดล้อม ( Environment Design)    • การสร้างและแก้ไขโมเดล 3 D และเท็กซ์เจอร์ (3 D Modeling & Texturing)    • การออกแบบและสรา้ งแอนเิ มชัน ( Animation)   • การออกแบบ UI/UX และการทำงานกบั ระบบอินเตอร์เฟซ    • การสร้างเอฟเฟกต์ภาพ ( VFX)   5. ช่องทางติดต่อ ( Contact Info)   • อีเมล: [อีเมล]   • เบอร์โทรศัพท:์  [เบอร์โทรศัพท์]   • Slack/Discord ID:  [ID]   6. เวลาที่พร้อมทำงาน ( Availability)   • วัน-เวลาที่สะดวก (เช่น จันทร์ –ศุกร์ 09:00–17:00)   • ประเมินชั่วโมงการทำงานต่อสัปดาห์ (เช่น 20 -30 ชั่วโมง/สัปดาห์)   7. ประสบการณ์ที่ผา่ นมา ( Relevant Experience)   • โปรเจกต์ทผี่ ่านมาที่เกี่ยวข้อง:    o โปรเจกต์ A: [คำอธิบายสั้นๆ เกี่ยวกับบทบาทในโปรเจกต์] o  โปรเจกต์ B: [คำอธิบายสั้นๆ เกี่ยวกับบทบาทในโปรเจกต์]\n---\n\n## Systems (ระบบ) (ต่อ 2) (จากหน้า 11)\n\n• ผลงานที่เกี่ยวข้อง:    o มีส่วนร่วมในการออกแบบศิลปะในเกมที่สำเร็จ o  ประสบการณ์ในการทำงานร่วมกับทีมพัฒนาเกมในด้านศิลปะ   8. ความรับผดิ ชอบต่อเป้าหมายหลัก ( Key Deliverables)   • สร้างและออกแบบตัวละคร, สภาพแวดล้อม, เอฟเฟกต์ภาพ, และ UI สำหรับเกม   • ดูแลและปรับปรุงแอสเซ็ตกราฟิกตามข้อเสนอแนะจากทีมพัฒนา   • พัฒนาและปรับแต่งโมเดล 3 D และแอนิเมชันที่จำเป็น   • ออกแบบและปรับแต่ง UI ตามประสบการณ์ผู้เล่นที่ต้องการ   9. ความเชื่อมโยงกับหน้าที่อื่น ( Interdependencies)   • ต้องประสานงานกับ:    o Game Designer:   เพื่อให้แน่ใจว่าองค์ประกอบกราฟิกทั้งหมดมีความสอดคล้องกับกลไก  และระบบของเกม   o Programmer:   เพื่อให้การทำงานร่วมกันระหว่างกราฟิกและการเล่นของเกมเป็นไปได้อย่าง ราบรื่น   o Sound Designer:  เพื่อให้แน่ใจว่าเอฟเฟกต์เสียงและภาพทำงานร่วมกันได้ดี o QA  Tester: เพื่อทดสอบกราฟิกในบริบทต่างๆ ของเกม   • Input/Output ที่ต้องแลกเปลยี่ น:    o Input: คำแนะนำจากทีมพัฒนาและการทดสอบของผู้เล่น o Output:  แอสเซ็ตกราฟิกที่เสร็จสมบูรณ์และพร้อมใช้งานในเกม\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 4) (จากหน้า 12)\n\nGame Setting   story   Locations Floor  1 Silverleaf Village   หมู่บ้านเล็กๆ ที่ยังคงเหลือซงึ่ แสงแห่งความหวังในโลกที่ล่มสลาย ผู้คนที่นี่อาศัยอยู่ด้วยความพยายาม   และศรัทธาในการเยียวยาโลกอีกครั้ง ภายในหมู่บ้านมีร้านค้าสำหรับแลกเปลี่ยนวัตถุดิบ อัปเกรดอาวุธ และ  ศูนย์กลางข้อมูลการเดินทาง ผู้เฒ่าอารอน ซิลเวอร์ลีฟ ไดค้ ้นพบความลับของ “เมนูศักดิ์สิทธิ์”  ที่จะช่วยชำระพลังมืดจากโลก และ วัตถุดิบหลักคือ “เนื้ออาร์ดัส” ซึ่งอยู่ ลึกสุดในถ้ำเอเลเนีย   ที่นี่เป็นจุดเริ่มต้นของไลออน เด็กหนุ่มผู้มีพรสวรรค์ในการทำอาหาร และกำลังจะเริ่มต้นภารกิจเปลี่ยนโลกด้วย  พลังของ \"รสชาติ\"   Level 1: Floor 1 Silverleaf Village  ตัวเอก ไลออน  เป็นเด็กที่เกิดขึ้นมาหลังโลกล่มสลายเขาได้อาศัยอยู่ใน  หมู่บ้านซิลเวอรล์  ีฟ หมู่บ้าน เล็ก ๆ  ที่ยังคงปลอดภัยจากพลังมืดที่แพรก่ ระจายไปทั่วโลก ที่นั่น เขาได้พบกับ  ผู้เฒ่า Elder ผู้นำของหมู่บ้าน  ซึ่งเปิดเผยความจริงเกี่ยวกับพลังชั่วร้าย และมอบหมายภารกิจสำคัญให้ไลออน เพื่อฟื้นฟูสมดุลของโลก      Floor 2 Stone Golem    ดินแดนแห่งหินและแรงสั่นสะเทือน   เมื่อไลออนก้าวเข้าสู่ถ้ำเอเลเนีย สิ่งแรกที่เขาเผชิญคือชั้นที่ปกคลุมด้วยหินเก่าและแร่พลังงานแปลกประหลาด  ดินแดนนี้เต็มไปด้วยมอนสเตอร์ธาตุหินที่แข็งแกร่งและทนทาน เช่น Star (สตาร์) ทีมีความแข็งแกร่ง และ   None (นัน) มอนสเตอร์ไม่มีธาตุที่อ่อนแอแต่มีเยอะจนน่ารำคาญ มินิบอส:  Meteor (มิเทอร์)   โกเล็มยักษ์ที่เกดิ จากหินอุกกาบาตซึ่งดูดซับพลังเวทจากอดีตของอิกนาร์ทิส การโจมตีของมันช้าแต่รุนแรง  และ สามารถสั่นสะเทือนพื้นดินจนทำให้ผู้บุกรุกเสียหลัก การเอาชนะมิเทอร์ต้องอาศัยไหวพริบ   Level 2: Floor 2 Stone Golem\n---\n\n## Enemies & Bosses (ศัตรู & บอส) (จากหน้า 13)\n\nหลังได้รับภารกิจจาก ผู้เฒ่า Elder ไลออนต้องออกจากหมู่บ้านซิลเวอร์ลีฟเป็นครั้งแรก เขาเดินทางสู่  ทางเข้าของ “ถ้ำเอเลเนีย” ดันเจี้ยนลึกลับที่ถูกพลังมืดกลืนกิน   ชั้นแรกของถ้ำพาเขาเข้าสู่ \" Stone Golem \" พื้นที่ลึกใต้ภูเขาที่เต็มไปด้วยหินผลึก เรืองแสง และซากอารย  ธรรมโบราณที่ถูกหลงลืม   ที่นี่ ไลออนต้องเผชิญหน้ากับ \" Star\" มอนสเตอร์ที่คอยขวาง และ \" Meteor\" มินิบอสยักษ์ที่ปกป้องทางลงสู่ชั้น  ถัดไป เพื่อเอาชีวิตรอด ไลออนต้องใช้ทักษะการต่อสู้ร่วมกับการปรุงอาหารจากสมุนไพรที่หาได้ในพื้นที่ เพื่อฟื้น  พลังและเพิ่มสถานะ ก่อนจะท้าทายศัตรูสุดโหดของชั้ นนี้      Floor 3 Blaze Zone อาณาเขตแห่งไฟและความโกลาหล   แสงสีแดงส้มสะท้อนอยู่ตลอดผนังถ้ำ ลาวาและไอน้ำร้อนพวยพุ่งในทุกฝีก้าว ไฟไม่เพียงเผาไหม้ทุกสิ่ง แต่ยัง  แทรกซึมเข้าไปในใจของสิ่งมชี ีวิต ทำให้พวกมันคลั่งเกินควบคุม มอนสเตอร์ในชั้นนี้ได้แก่ Light (ไลท์)  มังกรไฟขนาดเล็กที่โจมตีด้วยเปลวเพลิง และ None (นัน) มอนสเตอร์ไม่ มีธาตุที่โดนไฟกลืนกินจนบ้าคลั่ง  มินิบอส: Blazer (เบลสเซอร์)   สัตว์ร้ายครึ่งมนุษย์ครึ่งอัคคี ผู้ควบคุมเปลวเพลิงได้ตามใจนึก ไลออนต้องใช้พลังของสมุนไพรเย็นที่พบในชั้น  ก่อนหน้าเพื่อต้านทานความร้อนและเปิดโอกาสในการโจมตี Level 3: Floor 3 Blaze Zone    หลังเอาชนะมินิบอสแห่งชั้นหิน ไลออนดำดิ่งสู่ชั้นถัดไป ซึ่งต่างจากก่อนหน้าโดยสิ้นเชิง — Blaze  Zone คืออาณาเขตแห่งไฟและความโกลาหล   แสงแดงส้มสะท้อนตามผนังถ้ำ ลาวาเดือดพวยพุ่งในทุกฝีก้าว ไอร้อนแทรกซึมเข้าทั้งกายและจิตใจ ในพื้นที่นี้  ไฟไม่ได้แค่เผาไหม ้ แต่ยังปลุกความบ้าคลั่งให้สงิ่ มีชีวิต   มอนสเตอร์ประจำชั้น ได้แก่:   • Light – มังกรไฟขนาดเล็ก ปราดเปรียว โจมตีด้วยลมหายใจเพลิง   • None – สิ่งมชี ีวิตไร้ธาตุที่ถูกไฟกลืนกินจนไร้สติ มินิบอส: Blazer  (เบลสเซอร์)   อสูรร่างครึ่งคนครึ่งเปลวเพลิง ที่ควบคุมไฟได้ตามใจคิด   ไลออนต้องใช้สมุนไพรเย็นจากชั้นก่อนหน้าในการปรุงอาหารเพื่อลดผลกระทบจากอุณหภูมิและสรา้ งโอกาส  โจมตีสวนกลับ   การเอาชนะเบลสเซอร์ไม่ใช่แค่การชิงชัยด้วยกำลัง แต่ต้องใช้ความเข้าใจในวัตถุดิบและจังหวะอย่างแท้จริง\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 5) (จากหน้า 14)\n\nFloor 4 Heart of the Alenia ศูนย์กลางแห่งพลังมืดและบทสรุปของตำนาน   ชั้นสุดท้ายของถ้ำ ลึกเกินกว่าจะวัดได้ ดินแดนนี้ถูกปกคลมุ ด้วยเงาแห่งอดีตและเสียงกระซิบจากวิญญาณที่ล้ม  ตาย ที่ใจกลางมีพลังเวทที่ยังคงหลงเหลือจากการทดลองของอัซมารอส ความจริงบางอย่างกำลังรอไลออนอยู่  ที่นี่   บิ๊กบอส: Rdus (อาร์ดัส) สัตว์ร้ายที่เกิดจากการทดลองที่ผิดพลาด มนั ไม่ใช่เพียงแค่สัตว์กลายพันธุ์  แต่คือ “เครื่องทดลองที่มีชีวิต” ร่าง ของอาร์ดัสเต็มไปด้วยพลังเวทไฟและแรห่ ินที่แปรปรวน มนั  ทั้งปกป้องและทุกข์ทรมานกบั พลังในตัวเอง ไลออ นต้องไม่เพียงแค่เอาชนะมั น แต่ต้อง “เข้าใจมัน”  เพื่อดึงเนื้ออาร์ดัสบริสุทธิ์ออกมาสำหรับเมนูศักดิ์สิทธิ์ Level 4: Floor 4 Heart of the Alenia   ศูนย์กลางแห่งพลังมืด และบทสรุปของตำนาน นี่คือชั้นสุดท้ายของถ้ำเอเลเนีย —  ลึกเกินกว่าจะมีแสงธรรมชาติส่องถึง   ทุกก้าวที่เดิน ลมหายใจของอดีตและพลังแห่งคำสาปยังคงล่องลอยอยู่   เศษซากของเวทมนตร์ต้องห้ามยังคงรบกวนจิตใจ   เสียงกระซิบจากวิญญาณผลู้ ้มตายสะท้อนก้อง สื่อสารถึงความทรมานที่ไมม่ ีใครได้ยินนานนับศตวรรษ  ณ ใจกลางของความมืด Rdus (อาร์ดัส)  บิ๊กบอสสุดท้าย ปรากฏตัว   มันคือผลลัพธ์จากการทดลองที่ผิดพลาดของจอมเวทอัซมารอส ร่างของมันคือการรวมกันของเวทไฟและแร่หิน  วิปลาส แข็งแกร่ง ดุดัน และเต็มไปด้วยความเจ็บปวด มันมิได้มีเพียงร่างกาย… แต่วิญญาณของมันยงั โหยหา  การปลดปล่อย ไลออนไม่อาจเอาชนะอาร์ดัสได้ด้วยการฟาดฟันเพียงอย่างเดียว  เขาต้อง “เข้าใจ”  ธาตุแท้ของมัน   ใช้สัมผัสแห่งวตั ถุดิบเพื่อหาจุดสมดุลระหว่างรสชาติแห่งชีวิตและความเจ็บปวด แล้วดึง “เนื้ออาร์ดัสบริสุทธิ์”  ออกมา วัตถุดิบสุดท้ายของเมนูศักดิ์สิทธิ์ เพื่อปรุงอาหารที่จะเปลี่ยนโลกนี้กลับไปสู่ความสมดุลอีกครงั้  Backstory   หลายร้อยปีก่อน โลกของ เอเลเนีย เคยรุ่งเรอื งและอุดมสมบูรณ์ด้วยพลังแห่งธรรมชาติ โดยเฉพาะ  ดินแดนศักดิ์สิทธิ์ที่ชื่อว่า “อิกนาร์ทิส” ซึ่งเป็นศูนย์กลางของพลังชีวิตและวัตถุดิบล้ำค่า ชนเผ่าและผู้คนจากทั่ว  สารทิศต่างหลั่งไหลมาเพื่อนำวัตถุดิบเหล่านี้ไปใช้ในการปรุงยา รักษาโรค และเสริมพลังเวท  แต่ทุกสิ่งกลับเปลี่ยนไปเมื่อชายผู้หนึ่งนามว่า “อัซมารอส” ปรากฏตัว เขาเคยเป็นนักปราชญ์ผู้เปี่ยมด้วย  ความรู้เวทมนตร์ แต่หลงใหลในแนวคิดสุดโต่งที่เชื่อว่า \"มนุษย์ควรเทียบเท่าทวยเทพ\" เพื่อบรรลุจุดนั้น เขาจึง  ทดลองเวทมนตร์ต้องห้ามเพื่ อตามหา “อาหารแห่งพระเจ้า” เมนใู นตำนานที่จะมอบพลังไร้ขีดจำกัดให้ผู้ที่กิน\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 6) (จากหน้า 15)\n\nมัน การทดลองครั้งนั้นใช้วัตถุดิบต้องคำสาปมากมาย และมันได้สร้างผลกระทบร้ายแรง  พลังมืดที่ไม่อาจควบคุมได้ ได้แทรกซึมลงไปในผืนดิน นำ้ อากาศ และสิ่งมีชีวิต  ดินแดนอิกนาร์ทิสกลายเป็นแหลง่ พลังชั่วร้าย สัตว์พืช กลายพันธุ์ คนล้มตาย และธรรมชาติล่มสลาย  แม้ว่าหลายประเ ทศจะร่วมมือกันผนึกตัวอัซมารอสได้ในที่สุด แต่ผลจากเวทต้องห้ามของเขายังคงแพร่กระจาย  อย่างต่อเนื่อง ไม่มีใครหยุดยั้งมันได้ โลกเริ่มแหลกสลาย ผู้คนต้องอพยพลงใต้ดินเพื่อความอยู่รอด และนั่นคือ  จุดเริ่มต้นของ หมู่บ้านซิลเวอร์ลีฟ  หนึ่งในที่หลบภัยสุดทา้ ยของมนุษย์ ห ลายชั่วอายุคนผ่านไป  ผู้เฒ่าแห่งหมู่บ้านซลิ เวอร์ลีฟได้ค้นพบเอกสารโบราณที่กล่าวถึง “เมนู ศักดิ์สิทธิ์”   ซึ่งสามารถชำระล้างพลังมืดและฟื้นฟูสมดุลให้กับเอเลเนียได้ แต่ในการทำเมนูนั้น จำเป็นต้องใช้  วัตถุดิบพิเศษที่สุด “เนื้ออาร์ดัส” จากสัตว์กลายพันธุ์ระดับสูงในส่วนลึกของถ้ำเอเลเนีย จากตำนาน  กลายเป็นภารกิจ   จากความหวังริบหรี่ กลายเปน็ โอกาสครั้งสุดท้าย นี่คือจุดเริ่มต้นของเรื่องราวของ ไลออน เดก็  หนุ่มเชฟผู้แบกรับชะตาของโลก ด้วยมีดทำครัวในมือ และหัวใจที่ เชื่อในพลังของอาหาร           Key plot elements   โลกที่ล่มสลาย   โลกเอเลเนียเคยอุดมสมบูรณ์ด้วยพลังธรรมชาติ แต่ปัจจุบันกลับถูกพลังมืดกัดกินอย่างช้าๆ   การทดลองเวทมนตร์ของ “อัซมารอส” ได้สร้างคำสาปที่แพร่กระจายไม่หยุด จอมเวทต้องสาป อัซมารอส   ตัวการสำคัญทจี่ ุดชนวนภัยพิบัติของโลก ด้วยความทะเยอทะยานสร้าง “อาหารแห่งพระเจ้า”   แม้จะถูกผนึกแล้ว แต่พลังของเขายังหลงเหลือและเปลี่ยนแปลงธรรมชาติ   Elder แห่งหมู่บู้านซิลเวอร์ลีฟ   ผู้นำทางภูมิปัญญา ผู้ค้นพบตำนาน \"เมนูศักดิ์สิทธิ์\" ที่เป็นทางรอดสุดท้ายของโลก   เป็นคนที่มอบภารกิจให้ไลออนออกเดินทาง ไลออน    เด็กหนุ่มผู้มีพรสวรรค์ด้านการทำอาหาร และ“สัมผัสแห่งวัตถุดิบ” ที่ช่วยให้เขาเข้าใจคุณสมบัติ ลึกซึ้งของวัตถุดิบเขาคือความหวังสุดท้ายในการปรุงเมนูที่จะชำระล้างโลก ถ้ำเอเลเนีย   ดันเจี้ยนที่แบ่งออกเป็น 4 ชั้น แต่ละชั้นสะท ้อนพลังของธรรมชาติที่ผิดเพี้ยน\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 7) (จากหน้า 16)\n\n• มีมอนสเตอร์กลายพันธุ์, มินิบอส และสุดท ้ายคือ บอสใหญ่ Rdus  ซึ่งเป็นวัตถุดิบหลักของเมนู เนื้ออาร์ดัสวัตถุดิบศักดิ์สิทธิ์ที่หาได้เพียงหนึ่งเดียว และต้องได้มาด้วยความ กล้าหาญและความเข ้าใจในธรรมชาติ   • ไม่ใช่เพียงแค่ “เอาชนะ” แต่ต้อง “เข้าถึงหัวใจ” ของอาร์ดัสเพื่อดึงเนื้อที่บริสุทธิ์ที่สุดออกมา   เมนูศักดิ์สิทธิ์   • อาหารที่สามารถฟื้นฟูสมดุลของโลก และขจัดพลังมืดของอัซมารอสออกไปจากเอเลเนีย จะถูกปรุงขึ้นเ มื่อไลออนกลับจากการเดินทาง พร้อมวัตถุดิบที่ได้จากทั้ง 4 ชั้น   การต่อสู้ + การปรุงอาหาร   • เกมเพลย์ผสมการต่อสู้กับมอนสเตอร์ในสไตล์ Action RPG กับการรวบรวมวัตถุดิบเพื่อใช้ในการ  คราฟต์เมนูพิเศษ   • การทำอาหารไม่ใช่แค่เรื่องรสชาติ แต่คือการเยียวยาโลก\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 8) (จากหน้า 17)\n\nCharacters   Main Characters Lion – Backstory   ไลออนเกิดและเติบโตในหมู่บ้านซิลเวอร์ลฟี หนึ่งในสถานที่ปลอดภัยไม่กี่แห่งที่เหลืออยู่หลังจากโลก   ถูกพลังมืดกลืนกิน เขาเติบโตมาในครอบครัวของช่างทำอาหารพื้นบ้าน และเรียนรู้การใช้วัตถุดิบจากธรรมชาติ  อย่างลึกซึ้ง ตั้งแต่ยังเด็ก เขาแสดงความสามารถแปลกประหลาดที่ทำให้เขาสามารถรับรู้พลังและสภาวะของ  วัตถุดิบได้ เอลเดอร์ของหมู่บ้านจึงเชื่อว่าเขาเป็น \"ผู้ถูกเลอื ก\" ที่จะคืนสมดุลให้กับโลก  การเดินทางของไลออนเริ่มต้นขึ้นเมื่อเอลเดอร์มอบหมายภารกิจสำคัญให้เขาออกเดินทางไปยังถ้ำเอเล เนีย  เพื่อนำเนื้ออาร์ดัสมาใช้ในการปรุง เมนูศักดิ์สิทธิ์ เมนูเดียวที่จะขจัดพลังมืดและฟื้นฟูเอเลเนียได้อีกครั้ง  Personality   1. อ่อนโยนและเห็นใจ: ไลออนมักมองเห็นคุณค่าในสิ่งเล็กๆ แม้กระทั่งวัตถุดิบที่คนอื่นมองข้าม   2. มุ่งมั่นแต่ถ่อมตวั: เขาไม่คิดว่าตัวเองเป็น “ผู้กอบกู้” แต่พรอ้ มจะทำหน้าที่ของตนให้ดีที่สุด   3. ช่างสังเกตและมีจิตใจละเอียดอ่อน: เขาเข้าใจรสชาติ ความรู้สึก และพลงั ของสิ่งต่างๆ ได้ลึกซึ้ง   4. เชื่อมั่นในพลังของอาหาร: เขาเชื่อว่าอาหารไม่เพียงเติมเต็มท้อง แต่ยังเติมเต็มใจและโลกได้   Appearance เพศ: ชาย อายุ: 17–18 ปี รูปร่าง: สูงเพรียว กระฉับกระเฉง ผม: สีน้ำตาลไหม้  ปลายยุ่งเลก็ น้อยเหมือนเชฟที่เพิ่งออกจากครัว ตา: สีน้ำตาลประกายทอง  สื่อถึงสัมผัสวัตถดุ ิบ ชุดประจำตัว: เสื้อคลุมแบบผสมผสานกับชุดนักผจญภัย  มีซองเก็บมีดทำครัวอยู่ข้างเอว สัญลักษณ์เฉพาะตัว : ผ้าผูกหัวที่ได้รับจากแม่  และมีดทำครัวสืบทอดจากพ่อ   Special abilities 1. สัมผัสแห่งวัตถุดิบ ( Ingredient Sense)   • รับรู้ความบริสุทธิ์ พลังเวท และเงื่อนไขการใช้วัตถุดิบให้เกิดประสิทธิภาพสูงสุด   • ตรวจจับวัตถุดิบลับที่ผู้เล่นทั่วไปหาไม่เจอ\n---\n\n## 2. Alchemy Cook ( ปรุงเพื่อเสริมพลัง) (จากหน้า 18)\n\n2. Alchemy Cook ( ปรุงเพื่อเสริมพลัง)   • ปรุงอาหารระหว่างการผจญภัย เพื่อบัฟค่าต่อสู้ ฟื้นพลัง หรือสร้างสถานะพิเศษ   • อาหารบางชนิดสามารถใช้ “ปลุกความทรงจำ” ของมอนสเตอร์ ทำให้เกิดทางเลือกใหม่ เช่น การ  เจรจา แทนการต่อสู้   3. Culinary Combat ( การต่อสู้ด้วยศาสตร์การทำอาหาร)   • ใช้อุปกรณ์ทำอาหารเป็นอาวุธ เช่น มีดทำครวั แบบสั้น -เร็ว, กระทะไฟร้อนแรง, ขวดปรุงรสสร้างม่าน  หมอก   • สกิลพิเศษคือ “ Cooking Combo” ซึ่งผสมการฟันและการปรุงชั่วขณะเพื่อสร้างความเสียหายเวท  ผสมสถานะ        NPCs   George Blacksmith ( จอรจ์ แบล็คสมิธ) - พ่อค้าแลกเปลี่ยนสมนุ ไพรและวัตถุดิบธรรมชาติ บทบาท:   • ตั้งร้านอยู่ที่หมู่บ้านซิลเวอร์ลฟี   • แลกเปลี่ยนสมุนไพร, เห็ด, วัตถุดิบจากมอนสเตอร์ หรือพืชกลายพันธุ์   • ให้ข้อมูลเชิงลกึ เกี่ยวกับการใช้วัตถุดิบเพื่อรักษา หรือปรุงอาหารบางประเภท   • มีเควสย่อยให้ไลออนออกหา \"พืชพิเศษ\" ตามฤดูกาลหรือสภาพดันเจี้ยน บุคลิก:   • ใจดี อารมณ์ขนั ขี้แซว แต่เกง่ เรื่องสมุนไพรขั้นเทพ   • เคยเป็นนักเดินทางมาก่อน แต่ตอนนี้เปิดร้านเพราะขาเจ็บจากการต่อสู้กับมอนสเตอร์  คำพูดประจำตัว:   “ของขมหน่อย แต่รักษาได้แม้แต่ใจที่เหนื่อยล้า!”\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 9) (จากหน้า 19)\n\nJack Whitesmith ( แจ็ค ไวท์สมิธ) – พ่อค้าอัปเกรดอาวุธ บทบาท:   • ช่วยอัปเกรดอาวุธของไลออน เช่น มีดทำครัว กระทะไฟ เครื่องปรุงเวท   • เพิ่มค่าสถานะพิเศษ หรือเปิดท่าโจมตีใหม่   • ใช้วัตถุดิบจากมอนสเตอร์ + แร่พิเศษที่ได้จากดันเจี้ยนแต่ละชั้น   • ให้ไอเท็มคราฟต์ระดับสูงสำหรับสายต่อสู้ บุคลิก:   • ขรึม พูดน้อย ตรงไปตรงมา   • เป็นอดีตทหารหลวงที่ผันตัวมาเป็นช่างเหล็กเพื่อหลีกหนีสงคราม   • แอบห่วงไลออนเหมือนน้องชาย คำพูดประจำตัว:   “คมของมีดไม่สำคัญเท่ามือท ี่ถือมัน... แต่ขัดไว้ก็ไม่เสียหาย”      Elder (แอลเดอร์) - ผู้นำแห่งหมู่บ้านซิลเวอร์ลีฟ และผู้มอบภารกิจหลัก บทบาท:   • ผู้เปิดเผยความจริงเบื้องหลังคำสาปและ “เมนูศักดิ์สิทธิ์”   • เป็นคนส่งไลออนออกผจญภัย และคอยแนะนำเมื่อกลับจากดันเจี้ยน   • อัปเดตเรื่องราวหลัก ( Main Quest Progress)   • มีบทพูดที่ชี้แนะเชิงปรัชญาและจรรยาบรรณของเชฟผู้เยียวยา บุคลิก:   • ฉลาด ลึกซึ้ง นมุ่ นวล   • เปรียบเสมือนพ่อคนที่สองของไลออน   • มีอดีตลึกลับกับอัซมารอส และเคยเห็นโลกในยุคก่อนล่มสลาย คำพูดประจำตัว:   “อาหารที่แท้จริง... คือสิ่งที่หล่อเลี้ยงทั้งร่างกายและจิตวิญญาณ”\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 10) (จากหน้า 20)\n\nMonsters None  นัน   • ประเภท: ไม่มีธาตุ   • ต้นกำเนิด: เคยเป็นสัตว์ป่าหรือสิ่งมีชีวิตทั่วไปที่อาศัยในโลกธรรมชาติ   • ผลกระทบจากพลังมืด:  โดน “กลืนกิน” จนสูญเสียสัญชาตญาณพื้นฐาน กลายเป็นสิ่งมีชีวิตที่ไม่มี  จุดมุ่งหมาย นอกจากการทำลายทุกสิ่งที่เคลื่อนไหว   • รูปลักษณ:์ เปน็ สัตว์ 4 ขา    • ลักษณะการโจมตี:  ดุร้าย รวดเร็ว คาดเดาไม่ได้ พฤติกรรมเหมือนสิ่งมีชวี ิตที่กำลังเจ็บปวดอยู่  ตลอดเวลา   • จุดเด่น:   o แรงโจมตีสูงแต่ไร้แบบแผน o  ยิ่งอยู่ใกล้พลังมืดมาก ยิ่งแข็งแกร่งและบ้าคลั่ง บทบาทในเกม:   • ความท้าทาย: ผู้เล่นต้องปรับกลยุทธ์ ในการต่อสู้   • เชิงเนื้อเรื่อง: สื่อถึงผลของการทดลองที่ล้มเหลวและธรรมชาติที่ถูกบิดเบือนโดยเวทต้องสาป   • แนวคิด: \"None\" แสดงถึงสงิ่ มีชีวิตที่สูญเสียทุกสิ่ง —แม้แต่ตัวตน   4 Action หลักของมอนสเตอร์   1. Idle (ยืนนิ่ง):   o ยืนในตำแหน่งเดิม เคลื่อนไหวน้อยมาก o สลับท่าทาง เช่น  ขยับหัว หายใจแรง ดูรอบๆ อย่างระแวง\n---\n\n## Mechanics (ระบบการเล่น) (ต่อ 4) (จากหน้า 21)\n\n2. Walk (เดิน):   o เดินช้า ๆ มุ่งหน้าเข้าหาผู้เล่นเมื่ออยู่ในระยะตรวจจับ   3. Hit (โจมตี):   o ใช้ท่าต่อยหรือกัดแบบรวดเร็วเมื่อเข้าใกล้ผู้เล่น o  มีเสียงคำรามตอนโจมตีเพื่อเพิ่มแรงกดดัน   4. Dead (ตาย):   o ทรุดตัวลงอย่างรุนแรง สลายร่างด้วยเงามืด o  อาจปล่อยของดรอป (เช่น สมุนไพรเน่า,  ชิ้นส่วนเวทตกค้าง)   รูปแบบการเคลื่อนที่: Chase Player   • AI เคลื่อนที่โดยมีพฤติกรรมดงั นี้: o ตรวจจับผู้เลน่ :   เมื่อผู้เล่นเข้าใกล้ในระยะตรวจจับ o วิ่งไล่:  เดินตรงเข้าหาผู้เล่น o เข้าโจมตี:  หากอยู่ในระยะประชิด จะเปลี่ยนเป็นโหมด Hit o  หยุดไล่: หากผู้เล่นวิ่งหนีเกินระยะจะยืน Idle ต่อ   Mechanic ของมอนสเตอร์   • ประเภทการโจมตี:  Melee Attack o โจมตีด้วยการ ตอ่  ย หรอื กัด o มีคูลดาวน์เล็กน้อยระหว่างการโจมตี\n---\n\n## AI & Encounters (จากหน้า 22)\n\nStar สตาร์   • ประเภท: มอนสเตอร์ธาตุหิน   • แหล่งที่พบ: ชนั้ ที่ 2 – Stone Golem Domain   • ต้นกำเนิด: หนิ ศักดิ์สิทธิ์จากภูเขาแห่งความสมดุลที่ถูกพลังมืดของอิกนาร์ทิสแทรกซึม   • รูปลักษณ:์ o ร่างกายเป็นก้อนหินกลมใหญ่คล้ายดาวเคราะห์ขนาดเล็ก o  พื้นผิวแตกเป็นลายเรืองแสงคล้ายเส้นพลังเวท   • ลักษณะพิเศษ:  o มีเยอะจนน่าหงุดหงิด   • จุดอ่อน:   o มีการโจมตีที่ช้า o  มีความเชื่องช้า บทบาทในเกม:   • การต่อสู้: ผู้เล่นต้องหลบโจมตี   • กลยุทธ์:   ใช้สมุนไพรที่เพิ่มเลือดเพื่อเอาตัวรอด   • เชิงสัญลักษณ:์    Star แสดงถึง \"พลังธรรมชาติที่ถูกควบคุม\" และสิ่งศักดิ์สิทธิ์ที่ถูกบิดเบือนโดยเวทมนตร์ต้องสาป   4 Action หลักของมอนสเตอร์   1. Idle (ยืนนิ่ง):   o ยืนในตำแหน่งเดิม เคลื่อนไหวน้อยมาก   o สลับท่าทาง เช่น ขยับหัว หายใจแรง ดูรอบๆ อย่างระแวง   2. Walk (เดิน):\n---\n\n## Mechanics (ระบบการเล่น) (ต่อ 5) (จากหน้า 23)\n\no เดินช้า ๆ มุ่งหน้าเข้าหาผู้เล่นเมื่ออยู่ในระยะตรวจจับ o  เคลื่อนไหวแบบเซ ๆ บ่งบอกถึงสภาพร่างกายที่ไม่สมบูรณ์   3. Hit (โจมตี):   o ใช้ท่าต่อยหรือกัดแบบรวดเร็วเมื่อเข้าใกล้ผู้เล่น o  มีเสียงคำรามตอนโจมตีเพื่อเพิ่มแรงกดดัน   4. Dead (ตาย):   o ทรุดตัวลงอย่างรุนแรง สลายร่างด้วยเงามืด o  อาจปล่อยของดรอป (เช่น สมุนไพรเน่า,  ชิ้นส่วนเวทตกค้าง)   รูปแบบการเคลื่อนที่: Chase Player   • AI เคลื่อนที่โดยมีพฤติกรรมดงั นี้: o ตรวจจับผู้เลน่ :  เมื่อผู้เล่นเข้าใกล้ในระยะตรวจจับ o  วิ่งไล่: เดินตรงเข้าหาผู้เล่น o เข้าโจมตี: หากอยู่ในระยะประชิด จะเปลี่ยนเป็นโหมด Hit o หยุดไล่:  หากผู้เล่นวิ่งหนีเกินระยะจะยืน Idle ต่อ   Mechanic ของมอนสเตอร์   • ประเภทการโจมตี:  Melee Attack o โจมตีด้วยการ ตอ่ ย หรอื กัด o  มีคูลดาวน์เล็กน้อยระหว่างการโจมตี Meteor มิเทอร์   “หินฟ้าที่ตกลงมาเพื่อนำทาง…หรือทำลาย?”   • ประเภท: มินิบอส / ธาตุหิน   • ชั้นที่พบ: ชั้นที่ 2 – Stone Golem   • บทบาท: ผู้พิทกั ษ์ประตูทางลงสู่ชั้นที่ 3 ลักษณะภายนอก:\n---\n\n## Mechanics (ระบบการเล่น) (ต่อ 6) (จากหน้า 24)\n\n• ร่างกายใหญ่โตมหึมา รูปร่างคล้ายยักษ์หิน   • พื้นผิวเป็นหินดำผสมแร่เรืองแสงสีแดงคล้ายอุกกาบาต   • ดวงตาเดียวตรงกลางหัวเปล่งแสงสีส้มราวกับลาวาที่กำลังเดือด ความสามารถพิเศษ:   • Meteor Slam: กระโดดทบุ พื้นจนเกิดแรงสั่นสะเทือน   • มีการโจมตีที่รนุ แรง   • มีการป้องกันที่สูง กลยุทธ์การต่อสู้:   • การโจมตีและการเคลื่อนไหวช้า บทบาทเชิงเนื้อเรื่อง:   • Meteor ถูกสร้างขึ้นโดยพลังเวทของอัซมารอสจากอุกกาบาตจริงที่ตกสู่ดินแดนอิกนาร์ทิส   • มันไม่ใช่เพียงเครื่องป้องกันดันเจี้ยน แต่เป็นตัวแทนของ  “การทดสอบความแข็งแกร่งของจิตใจ”   • ไลออนต้องใช้มากกว่ากำลัง — ต้องอาศัยความอดทนในการเอาชนะมัน Attack Mechanic   • Melee Attack – โจมตีระยะประชิดด้วยหมัดหนัก   • AoE Attack – กระแทกพื้น ทำให้เกิดแรงสนั่ สะเทือนเป็นวงกว้าง 5 Action   • Idle – ยืนนิ่งพร้อมขยับเล็กน้อย   • Walk – เดินเข้าหาผู้เล่น   • Run – วิ่งเมื่อเข้าใกล้   • Hit – ใช้การโจมตี Melee หรือ AoE   • Dead – ล้มลงและระเบิดพลังเวทสุดท้าย   Movement Type: Chase Player   • ตรวจจับผู้เล่นในระยะ → เดิน/วิ่งเข้าใกล้   • เมื่ออยู่ในระยะประชิด → สุ่มใช้ Melee หรือ AoE   • หากผู้เล่นถอยออกนอกระยะ → บอสหยุดไล่\n---\n\n## ส่วนที่ 25 (จากหน้า 25)\n\n\n---\n\n## Blazer เบลสเซอร์ (จากหน้า 26)\n\nBlazer เบลสเซอร์\n---\n\n## Rdus (อาร์ดสั ) (จากหน้า 27)\n\nRdus (อาร์ดสั )\n---\n\n## Mechanics (ระบบการเล่น) (ต่อ 7) (จากหน้า 28)\n\nGameplay & mechanics   Gameplay   Core gameplay loop                   Game progression   1. เริ่มต้นในหมู่บา้ นซิลเวอร์ลีฟ  เรียนรู้พื้นฐานการต่อสู้ ทำอาหาร และระบบอัปเกรด\n---\n\n## Mechanics (ระบบการเล่น) (ต่อ 8) (จากหน้า 29)\n\n2. สำรวจถ้ำเอเลเนีย (4 ชนั้ )  ตอ่  สู้กับมอนสเตอร์กลายพันธุ์และมินิบอสเก็บวัตถุดิบระดับสูงในแต่ละชั้น   3. พัฒนาไลออน & อาวุธ  ปลดล็อกชั้นดันเจี้ยน, และอาวุธขั้นสูง   4. ปลดล็อกเนื้อเรื่อง & ดันเจี้ยนใหม่  ความลับของอัซมารอสและอดีตของโลกจะค่อย ๆ เปิดเผย   5. ศึกสุดท้ายกับ “อาร์ดัส”  เอาชนะบิ๊กบอสเพื่อได้วัตถุดิบศักดิ์สิทธิ์ นำไปปรุงเมนูที่ช่วยชำระพลังมืด  และฟื้นฟูอิกนาร์ทิส   Objectives   1. สำรวจ โลกหลังหายนะและดันเจี้ยนลึกลับ   2. ต่อสู้ กับมอนสเตอร์กลายพันธุ์และบอสสุดโหด   3. ปรุงอาหาร ดว้ ยวัตถุดิบวิเศษเพื่อเพิ่มพลังและฟื้นฟูธรรมชาติ   4. รวบรวมวัตถุดิบ  หายากเพื่ออัปเกรดอาวุธครัวเวท   5. ดำเนนิ เนื้อเรื่อง  เพื่อค้นหาความลับของ “อาหารแห่งพระเจ้า”   6. กอบกู้โลก โดยสร้างเมนูศักดิ์สิทธิ์จาก “เนอื้ อาร์ดัส”           Mechanics   Physics  วัตถุในโลกมีแรงดึงดูดและการชนกัน เช่น  มอนสเตอร์ที่โจมตีผู้เล่น   Movement   Character Movement:  การเคลื่อนที่ในทิศทางต่างๆ ด้วยการใช้ปุ่ม W, A, S, D ผู้เล่นสามารถวิ่ง,  กระโดด, และหลบหลีกจากการโจมตี\n---\n\n## Systems (ระบบ) (ต่อ 3) (จากหน้า 30)\n\nDodge Roll: สามารถใช้การหมุนหลบการโจมตีหรือหลีกเลี่ยงอันตรายจากมอนสเตอร์   Objects   Collecting & Inventory Management:    เก็บวัตถุดิบจากมอนสเตอร์หรือธรรมชาติไว้ในช่องเก็บของ  ผู้เล่นสามารถจัดระเบียบหรือเลือกใช้สิ่งของในสต็อก Crafting  & Upgrading:    อัปเกรดอาวุธครัวและอุปกรณ์ต่างๆ โดยใช้วัตถุดิบที่เก็บได้จากการสำรวจ   Actions   Combo Attacks:    การโจมตีแบบคอมโบเพื่อเพิ่มความเสียหาย   interacting with objects   Cooking : ใชว้ ัตถุดิบที่เก็บได้มาทำอาหาร   Talking   Dialogue System:  เลือกบทสนทนาเพื่อเพิ่มความสัมพันธ์กับ NPC และปลดล็อกเควสใหม่   Reading   Books : การอ่านจะช่วยให้ผู้เล่นเข้าใจเนอื้ เรื่องและพัฒนาตัวละคร\n---\n\n## Overview (ภาพรวม) (ต่อ 2) (จากหน้า 31)\n\nUI ( User Interface )   Main menu   Overview      Mockup\n---\n\n## Loading screens (จากหน้า 32)\n\nLoading screens\n---\n\n## Controls & Camera (การควบคุม & กล้อง) (จากหน้า 33)\n\nLevels   Level 1: Floor 1 Silverleaf Village   Synopsis ไลออนตื่นขึ้นในหมู่บ้านซิลเวอร์ลีฟในยามรงุ่ อรุณ  แอลเดอร์อธิบายถึงการเสื่อมสภาพของโลกและมอบหมาย ภารกิจแรกให้เขา:  ไปหามีดเนื้ออาร์ดัสจากถ้ำเอเลเนีย ในระดับนี้จะเป็นการแนะนำการควบคุมเกม การเล่า เรื่อง  และการตั้งเป้าหมายของเกม Objectives   1. พบกับแอลเดอร์ที่เตาผิงกลางหมู่บ้าน   2. เรียนรู้การเคลอื่ นไหวพื้นฐาน: เดิน, วิ่ง, กระโดด, และหลบหลีก   3. ทำภารกิจสอนทำอาหารของแอลเดอร์ (เตรยี มสตูว์บำรุงร่างกายง่ายๆ)   4. ออกจากหมู่บ้านและเข้าสู่ประตูถ้ำ Locations   1. หมู่บ้านซิลเวอร์ลีฟ  o กระท่อมของแอลเดอร์,  สถานีทำอาหาร, พ่อค้า NPC   2. ขอบหมู่บ้าน o พื้นที่ฝึกทักษะที่มีหุ่นไม้และมอนสเตอร์  \"None\" ระดับต่ำ   3. ประตูถ้ำเอเลเนีย  o ประตูที่มีคบเพลิงและทางเข้าถ้ำ\n---\n\n## Controls & Camera (การควบคุม & กล้อง) (ต่อ 2) (จากหน้า 34)\n\nการฝึกฝน – เตาผิงหมู่บ้าน   • แอลเดอร์อธิบายการควบคุมเกม   • \"เดินไปที่เตาผิง\" → ฝึกการเดินและวิ่ง   • \"หลบการระเบดิ ของเปลวไฟ\" → ฝึกการหมุนหลบ การฝึกทำอาหาร –  ห้องครัวหมู่บ้าน   • เก็บวัตถุดิบจากถัง   • ทำตามคำแนะนำบนหน้าจอเพื่อทำอาหารง่ายๆ   • ทานอาหารเพื่อฟื้นฟูพลังชีวิต (สอนการใชอ้ ินเวนทอรี่และไอเท็ม) การฝึกการต่อสู้ –  พื้นทฝี่ ึกขอบหมู่บ้าน   • ต่อสู้กับมอนสเตอร์ \" None\" 2 ตัว   • ฝึกการโจมตีเบา/หนักและการป้องกัน   • รางวัล: 50 XP, การอัปเกรดเคลฟเวอร์พื้นฐานที่ร้านของแจ็ค การส่งตัวของแอลเดอร์ –  ประตูหมู่บ้าน   • กลับไปพบแอลเดอร์: เขามอบคบไฟและเครื่องหมายภารกิจ   • แอลเดอร์เตือนเกี่ยวกับมอนสเตอร์หินที่อยู่ข้างหน้า เข้าสู่ประตูถ้ำ   • เข้าไปที่ทางเข้าที่ส่องแสง   • การโหลดหน้าจอระดับถัดไปและแสดงแผนที่สำหรับระดับที่ 2\n---\n\n## Enemies & Bosses (ศัตรู & บอส) (ต่อ 2) (จากหน้า 35)\n\nLevel walkthrough   Level 2: Floor 2 Stone Golem   Synopsis   ไลออนเดินทางลึกเข้าไปในถ้ำเอเลเนียที่มีมอนสเตอร์หิน ท่ามกลางพื้นที่ที่มืด เขาต้องเก็บแร่หายากเพื่ออัป  เกรดเครื่องครัวของเขาก่อนที่จะเผชิญหน้ากับมินิบอส \"มิเทอร์\" เพื่อเปิดทางไปยังระดับถัดไป  Objectives   1. เก็บสมุนไพร 10 ชิ้น   2. เอาชนะมอนสเตอร์ \" None\" หนิ 5 ตัว   3. อัปเกรดอาวุธที่ร้านของแจ็คโดยใช้แร่   4. ทำอาหารเพื่อใช้ฟื้นฟูเลือด   5. เอาชนะมอนสเตอร์ \"สตาร์\" หิน 5 ตัว   6. ค้นหามินิบอส \"มิเทอร\"์ และเอาชนะเพื่อเปิดประตูไปยัง Blaze Zone Locations   1. อารีน่าของมิเทอร์ o มินิบอส \"มิเทอร์\" โผล่ออกมาจากมุมมืด   2. เขาวงกต   o เขาวงกตที่ทำให้ผู้เล่นได้งงงวยเพื่อเพิ่มความผจญภัย   3. แท่นหลอมในหมู่บ้าน o ร้านตีเหล็กของแจ็คในที่ชั้น 1   4. บริเวณชั้นนอกพื้นที่บอส o มอนสเตอร์ 10  ตัวคอยขัดขวางผู้เล่นและปอ้ งกันมินิบอส \"มิเทอร์\" เขาวงกต   • เขาวงกตที่ทำให้ผู้เล่นได้สับสนงงงวยเพื่อเพิ่มความผจญภยั  และสามารถฟาร์มเก็บของแรร์ได้ บริเวณชั้นนอกพื้นที่บอส\n---\n\n## Enemies & Bosses (ศัตรู & บอส) (ต่อ 3) (จากหน้า 36)\n\n• เดินตามทางเดินที่มีคบเพลิง: เก็บสมุนไพร 10 ชิ้น (การโต้ตอบ “เก็บ”)   • เจอมอนสเตอร์ \"นัน\" หิน 5 ตัว ฝึกการต่อสู้และท่าโจมตพี ื้นฐาน   • เจอมอนสเตอร์ \"สตาร\"์ หิน 5 ตัว ฝึกการตอ่ สู้และท่าโจมตีพื้นฐาน  แท่นหลอมในหมู่บ้าน   • ผู้เล่นสามารถกลับไปยังหมู่บ้านได้เมื่อเก็บของอัปเกรดได้แล้ว  การเผชิญหน้ากับมิเทอร์ในอารีน่า   • ก้าวเข้าไปในพื้นที่; มิเทอร์ปรากฏตัวพร้อมกับการสั่นสะเทอื น  (ฝึกการหลบหลีกและการใช้คอมโบ)   • หลีกเลี่ยงการโจมตีจากมิเทอร์   • ชนะแล้วเปิดประตูหินขนาดใหญ่ไปยังระดับถัดไป           Level 3: Floor 3 Blaze Zone   Synopsis หลังจากเอาชนะมินิบอสหิน มิเทอร์ ไลออนเดินทางเข้าสู่ “ Blaze Zone”  พื้นทที่ ี่เต็มไปด้วยลาวา และพลัง แห่งธาตุไฟ เขาต้องเผชิญหน้ากับมินิบอส “เบลสเซอร์”  ผู้ควบคุมเปลวเพลิงอันเกรี้ยวกราด พร้อมตามหา “พริกศักดิ์สิทธิ์” ส่วนผสมลบั ของเมนูศักดิ์สิทธิ์  และฝึกควบคุมพ ลังความร้อนระหว่างต่อสู้ Objectives   1. เก็บสมุนไพร 10 ชิ้น   2. เอาชนะมอนสเตอร์ \" None\" ไฟ 5 ตัว   3. อัปเกรดอาวุธที่ร้านของแจ็คโดยใช้แร่   4. ทำอาหารเพื่อใช้ฟื้นฟูเลือด\n---\n\n## Enemies & Bosses (ศัตรู & บอส) (ต่อ 4) (จากหน้า 37)\n\nLevel walkthrough   5. เอาชนะมอนสเตอร์ \"ไลท์\" หนิ 5 ตัว   6. ค้นหามินิบอส \"เบลสเซอร์\" และเอาชนะเพื่อเปิดประตูไปยังชั้นสุดท้าย Locations   1. อารีน่าของเบลสเซอร์  o มินิบอส \"เบลสเซอร์\"  โผล่ออกมาจากลาวา   2. เขาวงกต   o เส้นทางแคบ มีลาวาไหลและพุ่มไม้พริกศักดิ์สิทธิ์   3. แท่นหลอมในหมู่บ้าน  o ร้านตีเหล็กของแจ็คในที่ชั้น 1   4. บริเวณชั้นนอกพื้นที่บอส  o มอนสเตอร์ 10  ตัวคอยขัดขวางผู้เล่นและปอ้ งกันมินิบอส \"เบลสเซอร์\" เขาวงกต   • เขาวงกตที่ทำให้ผู้เล่นได้สับสนงงงวยเพื่อเพิ่มความผจญภยั  และสามารถฟาร์มเก็บของแรร์ได้ บริเวณชั้นนอกพื้นที่บอส    • เดินตามทางเดินที่มีคบเพลิง: เก็บสมุนไพร 10 ชิ้น (การโต้ตอบ “เก็บ”)   • เจอมอนสเตอร์ \"นัน\" ไฟ 5 ตัว ฝึกการต่อสู้และท่าโจมตพี ื้นฐาน   • เจอมอนสเตอร์ \"ไลท์\" ไฟ 5 ตัว ฝึกการต่อสู้และท่าโจมตพี ื้นฐาน แท่นหลอมในหมู่บ้าน    • ผู้เล่นสามารถกลับไปยังหมู่บ้านได้เมื่อเก็บของอัปเกรดได้แล้ว การเผชิญหนา้  กับมิเทอร์ในอารีน่า    • ก้าวเข้าไปในพื้นที่; เบลสเซอร์ปรากฏตัว (ฝึกการหลบหลกี และการใช้คอมโบ)   • หลีกเลี่ยงการโจมตีจากเบลสเซอร์   • ชนะแล้วเปิดประตูหินขนาดใหญ่ไปยังระดับสุดท้าย\n---\n\n## Enemies & Bosses (ศัตรู & บอส) (ต่อ 5) (จากหน้า 38)\n\nLevel 4: Floor 4 Heart of the Alenia   Synopsis หลังจากฝ่าฟันดันเจี้ยนทั้งสองชั้น ไลออนมาถึงใจกลางของถ้ำเอเลเนีย สถานที่ที่พลังมดื  ของอัซมารอสยังคง สถิตอยู่ และเป็นที่อาศัยของมอนสเตอร์กลายพันธุ์ขั้นสุดยอด: อาร์ดัส ( Rdus)  ผู้ปกป้องหัวใจของพลัง ธรรมชาติ เขาต้องต่อสู้กับมันและเลือกว่าจะกำจัดหรือสงบมัน เพื่ อนำ  “เนื้ออาร์ดัส” กลับไปยังหมู่บ้านเพื่อ ปรุงเมนูศักดิ์สิทธิ์   Objectives   1. เก็บสมุนไพร 5 ชิ้น   2. อัปเกรดอาวุธที่ร้านของแจ็คโดยใช้แร่   3. ทำอาหารเพื่อใช้ฟื้นฟูเลือด   4. ค้นหาบอส \"อาร์ดัส\" และเอาชนะและจบเรื่องราว   Locations ลานกว้างที่อยอู่  าศัยของ อาร์ดัส   • มินิบอส \"อารด์ ัส\" โผล่ออกมา แท่นหลอมในหมู่บ้าน   • ร้านตีเหล็กของแจ็คในที่ชั้น 1 บริเวณชั้นนอกพื้นที่บอส   • เดินตามทางเดินที่มีคบเพลิง: เก็บสมุนไพร 5 ชิ้น Level walkthrough  บริเวณชั้นนอกพื้นที่บอส   • เดินตามทางเดินที่มีคบเพลิง: เก็บสมุนไพร 10 ชิ้น (การโต้ตอบ “เก็บ”)  แท่นหลอมในหมู่บ้าน\n---\n\n## • ผู้เล่นสามารถกลับไปยังหมู่บ้านได้เมื่อเก็บของอัปเกรดได้ (จากหน้า 39)\n\n• ผู้เล่นสามารถกลับไปยังหมู่บ้านได้เมื่อเก็บของอัปเกรดได้ แล้ว การเผชิญหนา้ กับมิเทอร์ในอารีน่า   • ก้าวเข้าไปในพื้นที่; อาร์ดัส ปรากฏตัว  (ฝึกการหลบหลีกและการใช้คอมโบ)   • หลีกเลี่ยงการโจมตีจาก อาร์ดัส   • ชนะแล้วเปิดประตูหิเพื่อกลับไปยังหมู่บ้านและทำอาหาร ศักดิ์สิทธิ์\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 11) (จากหน้า 40)\n\nฉากเนื้อเรื่อง/อาหาร ( Cutscene ) โครงสร้างหน้าต่างๆของเกม ( Game  Wireframe )     • icon  64×64px ถึง 128×128px Game Dev :   • on click เข้าไปยังตัวเกม   • ชื่อเกม Dungeon Dungry\n---\n\n## ส่วนที่ 41 (จากหน้า 41)\n\n\n---\n\n## Loading Page (จากหน้า 42)\n\n2.   Loading Page         Game Art :   • ออกแบบภาพ Background   • Loading Icon   • Process Bar   • เล่น Background Music หรือ Sound Effect เบาๆ Game Dev :   • นำ Asset มาใช้   • ทำให้โหลดฉากแบบ Async และเพิ่ม Animation หรือ Effect\n---\n\n## AI & Encounters (ต่อ 2) (จากหน้า 43)\n\n3.     • ใส่ Tip หรือ Fun Fact ที่เปลี่ยนไปเรื่อยๆ        Start Page         Game Art :   • ทำ Background , Logo , Button และ Sound effect / BG   • การจัดวาง Layout ต่างๆ   • เล่น Background Music หรือ Sound Effect เบาๆ Game Dev :   • ลิ้งค์ปุ่มต่าง คือ ปุ่ม Start ไปยัง Main PLay / ปุ่ม Setting หน้าการตั้งค่า / หรือปุ่ม  Exit เพื่อออกไปยัง หน้า Icon Page\n---\n\n## Characters (ตัวละคร) (จากหน้า 44)\n\n4.     • hold button เมื่อชี้ปุ่ม        Main Play           Game Art :   • ลักษณะหลอดเลือด / พลังงาน   • layout หน้า Main Play   • Assets ต่างๆภายในพื้นที่   • Icon อาวุธ อาหาร ยา และ ฟันเฟือง Game Dev :   • กดปุ่มเพื่อไปยังหน้าอื่น เช่น กด I เพื่อเข้าหน้า Inventory หรือ การกด left click  เพื่อโจมตี   • การตั้งค่าการโจมต   • ท่าทางต่างๆของตัวละคร\n---\n\n## Characters (ตัวละคร) (ต่อ 2) (จากหน้า 45)\n\n5.     Game Art      Game Art :   • Icon สำหรับ เมนูใน Inventory   • การจัดวาง Layout ใน Inventory   • ตัวละคร Game Dev :   • การลิ้งค์ Icon ข้อมูล ค่าสถานะ ของวัตถุดิบ   • กด icon paper เพื่อไปหน้า book page   • การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน\n---\n\n## Book Page (จากหน้า 46)\n\n6.     Book Page         Game Art :   • ทำข้อมูลในกระดาษ   • ลักษณธของกระดาษ   • Layout ของหน้ากระดาษ  Game Dev :   • การกด Book 1 เพื่ออ่านข้อมูลในกระดาษ   • กด icon person เพื่อไปหน้า Stat   • การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน\n---\n\n## Characters (ตัวละคร) (ต่อ 3) (จากหน้า 47)\n\n7.          Stat Page      Game Art :   • ทำหลอดสถานะต่างๆ   • การจัดวางของส่วนต่างๆ Game Dev :   • การลิ้งค์ Icon ข้อมูล ค่าสถานะ ของตัวละคร   • กด icon food เพื่อไปหน้า craft page   • การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน           Craft Page\n---\n\n## Characters (ตัวละคร) (ต่อ 4) (จากหน้า 48)\n\n8.             Game Art :   • ทำ Icon สำหรับ เมนูใน craft page   • การจัดวาง Layout ใน Craft page   • ตัวละคร Game Dev :   • กด craft เพื่อไปยัง Cutscene ของอาหารแต่ละเมนู   • การผสมวัตถุดิบ   • การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน\n---\n\n## Setting Page (จากหน้า 49)\n\n9.     Setting Page         Game Art :   • ทำ Icon สำหรับ setting เช่น valume music และ Exit   • การจัดวาง Layout ใน Setting Page Game Dev :   • ปรับการตั้งค่า ลด - เพิ่มเสียง เกมและเพลง   • ลิ้งค์ปุ่ม Exit ( on click ) ให้ออกไปยังหน้า Start   • การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC หรือปุ่ม BACK  เพื่อออกจากหน้าปัจจุบัน\n---\n\n## Trading Page (จากหน้า 50)\n\n10.          Trading Page      Game Art :   • ทำ Icon สำหรับ Trading วตั ถดุ บิ แร่   • การจัดวาง Layout ใน Trading page Game Dev :   • วางวัถุดิบให้ตรงกับความต้องการของพ่อค้าเพื่อจะแลกเปลี่ยน   • การเพิ่ม – ลดวัตถุดิบที่แลกเปลี่ยนแล้ว   • การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC หรือปุ่ม BACK  เพื่อออกจากหน้าปัจจุบัน\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 12) (จากหน้า 51)\n\n11.          Cutscene      Game Art :   • ออกแบบ Motion Graphic ให้เล่าเนื้อเรื่อง Game Dev :   • การลิ้งค์กับส่วนต่างๆที่ต้องมี Cutscene   • การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม Space Bar เพื่อข้าม           Teleport Page\n---\n\n## Game Art : (จากหน้า 52)\n\n12.        Game Art :   • การจัดวาง Layout ใน Teleport Game Dev :   • on click เพื่อไปยังจุดเทเลพอร์ต   • เชื่อมต่อหน้าเทเลพอร์ตกับจุดเทเลพอร์ต   • การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน           Read Paper Page\n---\n\n## Game Art : (ต่อ 2) (จากหน้า 53)\n\n13.        Game Art :   • การจัดวาง Layout ข้อความ ชื่อเรื่อง Game Dev :   • นำกระดาษเข้ามาในกระเป๋าหลังจากเจอแผ่นกระดาษแล้ว   • เชื่อมต่อกับหน้า Inventory   • การกดปุ่มเพื่อไปยัง Action ต่างๆ เช่น ปุ่ม ESC เพื่อออกจากหน้าปัจจุบัน      Win/Lost page\n---\n\n## Game Art : (ต่อ 3) (จากหน้า 54)\n\n14.           Game Art :   • การจัดวาง Layout ข้อความที่ปรากฎ Game Dev :   • สร้างเงื่อนไขการชนะและแพ้ เพื่อให้ข้อความขึ้น\n---\n\n## Controls & Camera (การควบคุม & กล้อง) (ต่อ 3) (จากหน้า 55)\n\n)   กลไกการเล่นเกม ( Gameplay Mechanics   Player Controls & Actions   • Idle, Walk, Run, Hit, Dash, Dead   • สำรวจพื้นที่ ค้นหาทางลับ และไขปริศนา   • ต่อสู้กับมอนสเตอร์เพื่อเก็บวัตถุดิบ   • ทำอาหารจากวัตถุดิบที่หาได้   • อัปเกรดอาวุธและเกราะ   • แลกเปลี่ยนไอเทมกับ NPC        Combat System   • ระบบต่อสู้แบบ Hack & Slash   • ศัตรูมีพฤติกรรม AI แบบ Chase Player   • Mini Boss (หิน/ไฟ) มีการโจมตี Melee        Crafting & Cooking   • เก็บวัตถุดิบจากธรรมชาติและมอนสเตอร์   • ใช้ระบบทำอาหารเพื่อเพิ่ม Buff ให้ตัวละคร   • ระบบอัปเกรดอาวุธและเกราะ  กระบวนการออกแบบ ( Level Design )   Dungeon Structure   • ดันเจี้ยนแบ่งเป็น 4 ชั้น   • แต่ละชั้นมีมอนสเตอร์และวัตถุดิบที่แตกต่างกัน\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 13) (จากหน้า 56)\n\n)   • มี Mini Boss ในแต่ละชั้น และ Big Boss  ที่ชั้นสุดท้าย   Environmental Design   • ทางเดินบางจุดแคบและมืดและบางจุดเป็นถ้ำกว้ างขนาดใหญ่   • ธีมของแต่ละชั้นแตกต่างกัน เช่น หิน, ไฟ,  ธรรมชาติ    ผู้เล่น และ ศตั รู ( Characters & Enemies   Main Character   • Lion (ไลออน) –  นักทำอาหารที่ต้องผจญภัยเพื่อช่วยทุกคน   Bosses   • Big Boss - ศัตรูสุดท้ายในดันเจี้ยน   • Mini Bosses - หิน & ไฟ   Monster / Enemies   • มอนสเตอร์หิน ( x5)   • มอนสเตอร์ไฟ ( x5)   •  มอนสเตอร์ทั่วไป ( x10) ไอเทม และ  กระเปา๋ ( Items & Inventory )   • Weapons: มีด 3 ระดับ   • Armors: เกราะ 3 ระดับ   • Potions: ฟื้นฟู HP และ Stamina\n---\n\n## Systems (ระบบ) (ต่อ 4) (จากหน้า 57)\n\n)   • Cooking Ingredients: สมุนไพร, เนื้อ, แร่   • Key Items: แผ่นบันทึก เงื่อนไขการชนะ ( Game  Progression & Win Condition )   • ผู้เล่นต้องผ่าน 4 ชั้นของดันเจี้ยน   • เอาชนะ Mini Boss และ Big Boss   • ค้นหาวัตถุดิบเพื่อทำอาหารศักดิ์สิทธิ์   • ชนะเกมเมื่อสร้างอาหารสำเร็จและฟื้นฟูสมดุลขอ งโลก           การออกแบบหน้าตาเกม ( UI & UX Design   • โครงสร้างเมนูหลัก   • HUD (Heads-up Display) เช่น แถบพลังชีวิต,  Mini-map   • ระบบแจ้งเตือน (เช่น Low HP Warning, Buff  Status) งานภาพและงานเสียง ( Art & Sound )   • Art Style: Stylized 3D and Stylized  Fantasy   • Environment Reference : Genshin Impact   • UI Design Reference : Dark Souls 3\n---\n\n## World & Story (โลก & เนื้อเรื่อง) (ต่อ 14) (จากหน้า 58)\n\n)   • Sound Design : Background Music + SFX  (No Voice Over) เครื่องมือการทำงาน ( Development  Tools )   • Engine: Unity (C#)   • 3D Modeling: Blender   • 2D Assets: Adobe Illustrator   • Animation: Adobe After Effects   • Sound Editing: Adobe Audition  สมาชิกทีมพัฒนา ( Team Responsibilities )   1. ธนพัฒน์ บุญขำ ( Game Development ) -  Programming, UI, Level Design   2. พิชญธิดา สุวรรณธาดา ( Game Artist )   - Art, Effects, Character Design   3. อนิวรรต บุญคงมาก ( Game Design )   - Story, UI, Scene Design\n---\n\n## Mechanics (ระบบการเล่น) (ต่อ 9) (จากหน้า 59)\n\nขอบเขตระยะเวลาการทำงานโปรเจกต์ ( Milestone & Development Timeline )   Semester 2/67   • Game Design 100%   • Art 40%   • Development (Core Mechanics 40%) Semester 3/67   • Art 60%   • Core Mechanics 60% Semester 1/68   • Full Game Development 100%   • Playtest (30 Testers)   • Documentation"
    },
    {
      "id": "dungeon-dungry-gdd",
      "title": "Dungeon Dungry — GDD (สรุปจาก PDF)",
      "date": "2025-08-20",
      "tags": [
        "GDD",
        "Dungeon Dungry",
        "story",
        "levels",
        "mechanics"
      ],
      "summary": "สรุป GDD โปรเจกต์ Dungeon Dungry จากเอกสารฉบับเต็ม: เรื่องราว/โลก ระบบหลัก เลเวล มอนสเตอร์ และเป้าหมายการเล่น",
      "content_md": "# Dungeon Dungry — Game Design Document (GDD)\n\n> เอกสารถอดความจาก PDF ต้นฉบับของโปรเจกต์ “Dungeon Dungry” (เลือกเฉพาะสาระสำคัญ พร้อมเรียบเรียงใหม่ให้อ่านสั้น กระชับ)\n\n## 1) Overview\n- **Game Title**: Dungeon Dungry\n- **Genre**: Adventure / Explore (Action RPG)\n- **Platforms**: Windows PC\n- **Target Audience**: อายุ 15–30 ปี ทุกเพศ\n- **Monetization**: Freemium\n- **Elevator Pitch**: เกมสำรวจดันเจี้ยน 3D ที่ผู้เล่นสวมบท “ไลออน (Lion)” เชฟหนุ่มผู้มี “สัมผัสแห่งวัตถุดิบ” ออกเดินทางสู่ถ้ำ “Elenia” เพื่อตามหา “เนื้ออาร์ดัส” วัตถุดิบศักดิ์สิทธิ์ที่สามารถฟื้นฟูสมดุลของธรรมชาติกลับคืนมา\n\n## 2) World, Story & Theme\nโลกแฟนตาซีมืดหลังวันล่มสลาย พลังมืดจากการทดลองต้องห้ามของ “จอมเวทอัซมารอส” แทรกซึมทำลายธรรมชาติและสิ่งมีชีวิต “Elder” แห่งหมู่บ้าน **Silverleaf Village** เชื่อว่าอาหารศักดิ์สิทธิ์หนึ่งเดียวจะชำระล้างคำสาปได้ แต่ต้องใช้ “เนื้ออาร์ดัส” จากส่วนลึกของถ้ำ **Elenia**\n\n**ธีมและสถานที่หลัก**\n- Silverleaf Village — จุดเริ่ม เรื่อง/ร้านค้า/อัปเกรด/ภารกิจ\n- Floor 2: **Stone Golem** — เขตหินและผลึก มีมินิบอส **Meteor**\n- Floor 3: **Blaze Zone** — เขตลาวา/ไฟ มีมินิบอส **Blazer**\n- Floor 4: **Heart of the Alenia** — ใจกลางพลังมืด บอสใหญ่ **Rdus (อาร์ดัส)**\n\n## 3) Core Gameplay\n**Core Loop**: ต่อสู้ → เก็บวัตถุดิบ/แร่ → ปรุงอาหาร/อัปเกรด → ปลดล็อกชั้น/เนื้อเรื่อง → เผชิญหน้าบอส  \n**ระบบเด่น**\n- **Culinary Combat**: ใช้อุปกรณ์ครัวเป็นอาวุธ (มีด/กระทะ/ขวดปรุงรส)\n- **Alchemy Cook**: ปรุงอาหารระหว่างผจญภัยเพื่อ Buff, Heal, สถานะพิเศษ\n- **Ingredient Sense**: ตรวจจับ/ตีความคุณสมบัติวัตถุดิบ (รวมแบบลับ)\n\n## 4) Characters (ย่อ)\n- **Lion (ไลออน)** — เชฟหนุ่ม ผู้มี “สัมผัสแห่งวัตถุดิบ” อ่อนโยน ช่างสังเกต เชื่อในพลังการเยียวยาของอาหาร\n- **Elder** — ผู้นำหมู่บ้าน ผู้ชี้ทาง/อัปเดตเควสต์หลัก\n- **George Blacksmith** — พ่อค้าสมุนไพร/วัตถุดิบธรรมชาติ มีเควสย่อยตามฤดูกาล\n- **Jack Whitesmith** — ช่างตีเหล็ก/อัปเกรดอาวุธ/ปลดล็อกท่าใหม่\n\n## 5) Monsters & Bosses (ย่อ)\n- **None** — สิ่งมีชีวิตไร้ธาตุ ถูกพลังมืดกลืนกิน ดุร้าย/รวดเร็ว\n- **Star** — มอนสเตอร์ธาตุหิน เคลื่อนที่ช้า ใช้แรงกระแทก\n- **Meteor** (Mini-boss) — ยักษ์หินอุกกาบาต โจมตีหนัก/สั่นสะเทือนพื้น\n- **Blazer** (Mini-boss) — อสูรเปลวเพลิง ควบคุมไฟ โจมตีด้วยเพลิง/แรงกดดันต่อเนื่อง\n- **Rdus** (Final Boss) — ผลทดลองผิดพลาด ผสานไฟและแร่หิน ต้อง “เข้าใจ” ธาตุแท้เพื่อชนะ/ได้ “เนื้ออาร์ดัสบริสุทธิ์”\n\n## 6) Progression & Objectives\n1) เริ่มที่ **Silverleaf Village** เรียนพื้นฐานต่อสู้ ทำอาหาร อัปเกรด  \n2) สำรวจ **Elenia** ทั้ง 4 ชั้น เก็บของ/สู้มินิบอส  \n3) อัปเกรดอาวุธครัว/ปลดล็อกท่า/สกิล  \n4) เปิดเผยปริศนาอัซมารอส ระหว่างทาง  \n5) ต่อสู้ **Rdus** เพื่อนำวัตถุดิบศักดิ์สิทธิ์กลับหมู่บ้านและ “ปรุงเมนูชำระล้างโลก”\n\n## 7) Level Walkthrough (ย่อ)\n- **Floor 1 — Silverleaf Village**: Tutorial เคลื่อนที่/ต่อสู้/ครัว/ร้านค้า เควสเริ่มต้นจาก Elder  \n- **Floor 2 — Stone Golem**: เก็บสมุนไพร/แร่ สู้ None & Star เผชิญหน้า **Meteor**  \n- **Floor 3 — Blaze Zone**: พื้นที่ลาวา เก็บ “พริกศักดิ์สิทธิ์” สู้ None (ไฟ) & Light เผชิญหน้า **Blazer**  \n- **Floor 4 — Heart of the Alenia**: เผชิญหน้า **Rdus** ตัดสินใจ/บทสรุปเรื่องราว\n\n## 8) Systems & Mechanics (ตัวอย่าง)\n- **Movement**: เดิน/วิ่ง/กระโดด/หลบ (Dodge Roll)  \n- **Combat**: คอมโบโจมตี, Melee, AoE บอส, คูลดาวน์  \n- **Inventory & Crafting**: เก็บวัตถุดิบ/คราฟต์/อัปเกรด  \n- **Dialogue**: สายสัมพันธ์ NPC และปลดล็อกเควส\n\n## 9) Balancing & Telemetry (กรอบงาน)\n- ชุดตัวชี้วัด: DPS, TTK, Win/Loss, Skill Usage, Drop Rates  \n- จุดเก็บข้อมูล: สู้บอส/ใช้สกิล/ปรุงอาหาร/อัปเกรด  \n- แผนปรับแต่ง: ปรับพลังมอนสเตอร์ตามชั้น/สเกลองศ์ความร้อน/รีวอร์ดตามความเสี่ยง\n\n---\n\n> หมายเหตุ: เนื้อหานี้ดัดแปลงจาก GDD ต้นฉบับเพื่อย่อให้อ่านในเว็บบล็อก และคงโครงเรื่อง/องค์ประกอบหลักตามเอกสาร\n"
    }
  ]
}
